{
    "まだな(invisible, country, relation, East Asia, Japanese)": "- First image: Bananas\n- Second image: Hourglass\n- Relation: Time and Ripe\n- Explanation: The first image displays a bunch of bananas, which are ripe and ready to eat. The second image shows an hourglass, symbolizing the passage of time. The connection between these two images can be found in the idea of \"ripeness\" and \"time.\" Just as bananas ripen over time, the hourglass measures the passage of time. Both images can be seen as representations of the concept of time, albeit in different contexts.",
    "1997(invisible, time, mutual elements, East Asia, English)": "- First image: Ceremonial gathering featuring dignitaries from two countries.\n- Second image: An elderly man holding a photograph of a crowd of people.\n- Relation: Leadership and legacy.\n- Explanation: The first image depicts a formal ceremony with leaders from China and the UK, suggesting a diplomatic or political event. The second image shows a man holding a picture of a crowd, which could represent the legacy or leadership of a person who has impacted many lives, similar to the leaders in the first image. The common theme is the influence and reach of leaders, whether in a political or personal context.",
    "911(invisible, number, mutual elements, NA, English)": "- First image: A sleek silver sports car parked in a lot.\n- Second image: The World Trade Center on fire on a clear day.\n- Relation: Vehicles and disasters.\n- Explanation: Both images feature vehicles, albeit in vastly different contexts. The sports car in the first image is a symbol of luxury and speed, while the second image depicts a disaster with the burning World Trade Center, which also included vehicles in its aftermath. The contrast between the two images highlights the stark difference between everyday life and catastrophic events.",
    "A story of Duke Willington(invisible, history, mutual elements, USAEnglish, English)": "- First image: A close-up shot of a sliced beef wellington on a wooden cutting board with accompanying sauces and herbs.\n- Second image: A painting depicting a soldier on horseback, dressed in a red cloak and blue uniform, with a mountainous landscape in the background.\n- Relation: Heroism\n- Explanation: The first image, featuring the luxurious beef wellington, symbolizes the celebration of culinary expertise and the art of cooking, while the second image, portraying a heroic figure on horseback, represents bravery and leadership. The connection between the two lies in the theme of heroism - the beef wellington, being a dish often associated with special occasions and skillful preparation, can be seen as a culinary hero, while the soldier embodies the heroism of historical battles and leadership.",
    "Actors in Ironman(visible, movie, mutual elements, USAEnglish, English)": "- First image: A man in a suit outside a building\n- Second image: A woman holding a helmet in a spaceship-like environment\n- Relation: Technology and innovation\n- Explanation: Both images connect to the theme of technology and innovation. The man in the suit could be associated with corporate or business innovation, while the woman in the spaceship-like environment holding a helmet suggests a connection to scientific or space exploration innovation.",
    "Actors of joker(visible, movie, mutual elements, USAEnglish, English)": "- First image: A young man with blonde hair and a blue jacket is smiling at the camera.\n- Second image: An older man with a beard and mustache is also smiling at the camera.\n- Relation: Both images feature individuals smiling at the camera.\n- Explanation: Despite the difference in age and style, both individuals are displaying a similar expression of happiness. This could suggest a shared theme of positivity or a relaxed atmosphere in both settings.",
    "Animals as vehicle(visible, phenomenon, mutual elements, NA, English)": "- First image: Elephant riders\n- Second image: Flying fish\n- Relation: Creatures\n- Explanation: Both images depict scenes involving large, unique creatures. In the first image, people are riding elephants, while in the second image, a humanoid character is riding a fish with wings. Both scenes are set in natural, outdoor environments, showcasing the interaction between humans and animals. The common theme is adventure and exploration, as both images convey a sense of excitement and wonder.",
    "Arabian culture(invisible, culture, mutual elements, other, English)": "- First image: A bowl of green, smooth, and creamy hummus, garnished with a lemon wedge and a sprig of fresh herbs, served with crispy crackers.\n- Second image: A close-up of a human hand, palm down, emerging from a puddle of dark, viscous liquid, creating ripples in the water.\n- Relation: Sustainability\n- Explanation: The first image represents a sustainable food choice, as hummus is a plant-based, nutrient-rich spread that supports a healthy diet. The second image can be interpreted as a metaphor for environmental sustainability or conservation efforts, highlighting the impact of pollution or contamination. The relation between the two images is the shared theme of sustainability, one through food choices and the other through environmental awareness.",
    "Asian mathematician(visible, people, mutual elements, East Asia, English)": "- First image: A man in a suit holding a book and sitting in front of a bookshelf.\n- Second image: A man wearing a blue shirt with mathematical equations projected onto his body.\n- Relation: Academic pursuits.\n- Explanation: The first image represents a person who is well-read and possibly involved in academia, as suggested by the bookshelf in the background and the book he is holding. The second image represents a person who is engaged in mathematical or scientific research, as indicated by the mathematical equations on his shirt and in the background. Both images share a theme of academic interest and intellectual pursuits.",
    "Astringent(invisible, sense, mutual elements, NA, English)": "- First image: A green cup of tea with a spoon and a basket of tea leaves on a wooden surface.\n- Second image: A group of ripe persimmons on a wooden surface.\n- Relation: Nature and simplicity.\n- Explanation: Both images feature natural elements - tea and persimmons - set against simple, rustic wooden backgrounds. The common theme of natural products, combined with the use of a wooden surface, creates a sense of connection between the two images.",
    "Barcelona(invisible, location, mutual elements, other, English)": "- First image: A soccer player in action, possibly feeling exhausted.\n- Second image: A panoramic view of the colorful and architecturally unique Park Guell in Barcelona, Spain.\n- Relation: Barcelona connection\n- Explanation: The first image could be of a soccer player from Barcelona, and the second image showcases a famous landmark in Barcelona, establishing a connection between the two images through the city.",
    "Basketball players got first pick by spurs(invisible, sports, mutual elements, NA, English)": "- First image: A basketball player in a warm-up outfit holding a ball.\n- Second image: A basketball player in a white jersey playing with a ball.\n- Relation: basketball\n- Explanation: Both images depict basketball players engaged in the sport. The first image shows a player in a warm-up outfit, indicating a preparatory or practice setting, while the second image shows an active play situation with a player in a game uniform. Both images are related by the common theme of basketball and the presence of players interacting with the ball.",
    "Batman(visible, movie, mutual elements, USAEnglish, English)": "- First image: Bat in flight\n- Second image: Basketball player in action\n- Relation: Both images depict themes of movement and agility.\n- Explanation: The bat's wings spread wide, captured mid-flight, showcases its agility in the air. Similarly, the basketball player's dynamic pose, with one fist raised and the other clutching the ball, reflects the agility and movement inherent in sports. Both images embody the concept of swift, controlled motion, though in vastly different contexts.",
    "Beef(visible, animal, mutual elements, NA, English)": "- First image: Horses eye, close-up\n- Second image: Bread on cutting board\n- Relation: Texture, color contrast, organic subject\n- Explanation: The first image captures the detailed texture of a horse's eye, showcasing the contrast between the black pupil and the whitish skin surrounding it. The second image shows a loaf of bread with a golden-brown crust, resting on a wooden cutting board. Both images highlight organic subjects with noticeable textures and color contrasts, which draw the viewer's attention to the detailed features of each subject.",
    "Berserk(visible, cartoon or game, mutual elements, East Asia, English)": "- First image: A mysterious cloaked figure against a red backdrop.\n- Second image: A character in armor with a serene expression in a forest setting.\n- Relation: Both images feature characters in elaborate attire set against distinct backgrounds.\n- Explanation: The first image presents a cloaked figure with a dramatic red sky, evoking a sense of mystery and intensity. The second image shows a character in detailed armor amid a tranquil forest, suggesting a narrative rooted in fantasy or historical settings. While the themes and settings differ, both characters are portrayed in elaborate costumes that hint at a rich backstory or cultural significance.",
    "Basketball players exploring other sports(visible, sports, mutual elements, NA, English)": "- First image: Baseball player in action\n- Second image: Golfer in mid-swing\n- Relation: Sports action\n- Explanation: Both images feature athletes engaged in their respective sports. The first image shows a baseball player, likely fielding or preparing to throw, while the second image captures a golfer in the middle of a swing. Both athletes are depicted in active poses, emphasizing the dynamic nature of their sports.",
    "Bolivia culture(invisible, culture, mutual elements, other, English)": "- First image: A vibrant and elaborate costume in a festival setting.\n- Second image: A serene beach scene with a person holding a red umbrella.\n- Relation: Festive and serene.\n- Explanation: Both images convey a sense of celebration and joy. The first image shows a festive environment with a person in an eye-catching costume, while the second image, although more serene, showcases the beauty of nature and the happiness the person feels while holding an umbrella against the backdrop of a clear sky and calm waters.",
    "Brand ambassador(invisible, business, mutual elements, NA, English)": "- First image: A blue quilted Chanel purse\n- Second image: A woman in a field reading a book\n- Relation: elegance\n- Explanation: Both the purse and the woman exude elegance, with the purse featuring a quilted design and the woman holding a book, suggesting a refined and cultured lifestyle.",
    "Bubble economy(invisible, business, mutual elements, NA, English)": "- First image: Organizational hierarchy\n- Second image: Flowers in a pot\n- Relation: Hierarchy and growth\n- Explanation: The first image shows an organizational structure with a top-down hierarchy, while the second image features flowers that grow in a natural, organic manner. Both concepts involve the idea of growth and development, whether in a structured or natural environment.",
    "Bull(invisible, animal, mutual elements, NA, English)": "- First image: Financial chart with upward trend\n- Second image: Typography \"MOO\" on black background\n- Relation: No direct connection between the two images\n- Explanation: The first image depicts a financial chart, typically used to represent stock market trends or other economic data. The second image is a simple typography with the word \"MOO\" displayed on a black background. There is no apparent connection or shared theme between the financial chart and the typography.",
    "Card games with three-kingdom theme(visible, cartoon or game, mutual elements, USAEnglish culture, English)": "- First image: A character illustration from a card game\n- Second image: A character illustration from a card game\n- Relation: Warrior theme\n- Explanation: Both images depict characters dressed in warrior attire, holding weapons, and appearing strong and formidable. The first image features a bearded warrior riding a horse, while the second image shows a warrior standing with a sword. Despite differences in specific elements, the common theme of warriors connects the two images.",
    "Combinatoric problems(visible, STEM, mutual elements, NA, English)": "- First image: A collection of colorful Rubik's Cubes\n- Second image: Diagram of a river showing measurements\n- Relation: Geometric Patterns\n- Explanation: Both images feature geometric patterns. The first image has the distinct shapes of Rubik's Cubes, while the second image uses geometric lines to measure the river. The shared theme of geometry connects the two images.",
    "Drunken Master(visible, movie, mutual elements, East Asia, English)": "- First image: A collection of ceramic containers with a golden pattern.\n- Second image: A still from a movie featuring two actors, one holding the other.\n- Relation: Narrative and visual storytelling elements.\n- Explanation: Both images involve a form of visual representation - the first with ceramic containers that may be used for storytelling or cultural expression, and the second with actors in a movie scene that tells a story through their actions and expressions.",
    "Economic crisis(invisible, business, mutual elements, NA, English)": "- First image: A crowd of people outside a bank building, possibly in line due to an event or crisis.\n- Second image: A historical black and white photo of people pouring liquid into a stream, possibly during a protest or demonstration.\n- Relation: Community reaction\n- Explanation: Both images depict groups of people reacting to a situation. In the first image, the crowd is gathered outside a bank, possibly in response to a financial crisis or other significant event. In the second image, the people are pouring liquid into a stream, which could be an act of protest or demonstration. While the contexts and actions are different, both images convey a sense of community and collective action in response to a shared concern or event.",
    "Egypt(invisible, culture, mutual elements, other, English)": "- First image: [Adventurers in a dungeon-like setting]\n- Second image: [Anime character in a dramatic pose]\n- Relation: [Dynamic Exploration]\n- Explanation: The first image shows a group of adventurers equipped for exploration and combat, standing in a setting that resembles an ancient or fantasy-themed dungeon with statues and an adventurous ambiance. The second image portrays an anime character in an exaggerated, dramatic pose, suggesting a moment of intense action or emotion. The connection between the two images lies in their shared theme of dynamic exploration and adventure, with both scenarios presenting characters in situations that require bravery and readiness to face challenges.",
    "Elton John(invisible, music, mutual elements, USAEnglish culture, English)": "- First image: Candle flames\n- Second image: Person wearing blue sunglasses and light blue jacket\n- Relation: Style and color\n- Explanation: Both images feature a prominent light blue color, with the candle flames displaying a similar hue to the light blue jacket worn by the person. Additionally, the overall style of the images, with one being a close-up of natural elements and the other being a portrait, provides a juxtaposition of natural and human-made elements.",
    "Fengshui(invisible, culture, mutual elements, East Asia, English)": "- First image: Traditional Chinese Door Poster\n- Second image: Hand Holding Yellow Disc with Symbols\n- Relation: Cultural Heritage\n- Explanation: The first image features traditional Chinese door posters commonly found in Chinese households, depicting mythological figures and symbols with auspicious meanings. The second image shows a hand holding a yellow disc engraved with symbols, which appears to be a traditional Chinese divination tool, possibly a Di Tui or Luo Pan. Both images share cultural significance and are connected by their roots in Chinese heritage and practices.",
    "Food made by Soybean or Soy protein(visible, food, mutual elements, NA, English)": "- First image: A detailed close-up of a chickpea burger with a variety of toppings.\n- Second image: A plate of black-colored, possibly glutinous rice cakes, accompanied by a dipping sauce and decorative elements.\n- Relation: Both images feature food items that are presented artistically.\n- Explanation: The first image showcases a carefully assembled and visually appealing burger, focusing on textures and colors to enhance its appeal. Similarly, the second image presents the rice cakes in an orderly fashion, with a dipping sauce and decorative garnishes, emphasizing presentation and aesthetic arrangement. Both images highlight the importance of visual appeal in food presentation.",
    "French(invisible, country, mutual elements, Non-English European, English)": "- First image: French bread\n- Second image: Eiffel Tower\n- Relation: French connection\n- Explanation: The first image represents a staple of French cuisine, while the second image shows a famous landmark in France. Both images are related by their French origin and can be associated with the culture and heritage of France. The common theme between the two images is their French identity.",
    "French culture(invisible, culture, mutual elements, Non-English European, English)": "- First image: French bread display\n- Second image: Expressionist painting of a bridge at night\n- Relation: contrast between everyday life and abstract expression\n- Explanation: The first image represents a practical and everyday aspect of life, showcasing freshly baked French bread, which is commonly associated with simple pleasures and routine. In stark contrast, the second image portrays an abstract and emotional scene that conveys a sense of isolation and introspection, characteristic of expressionist art. Both images, despite their differences, share a common element - the human experience, one in a literal and palpable form, the other in a more metaphorical and emotional sense.",
    "Game designed by Miyazaki Hidetaka(invisible, cartoon or game, mutual elements, East Asia, English)": "- First image: Fantasy Confrontation\n- Second image: Medieval Combat\n- Relation: Battle\n- Explanation: The first image depicts a confrontation between a warrior and a monstrous creature, set in a surreal environment with a cloudy sky and white flowers, suggesting a fantasy theme. The second image shows a medieval combat scene with a samurai-like character in a traditional Japanese setting, surrounded by cherry blossom trees, indicating a historical fantasy battle scenario. Both images share fantasy and combat themes, underlined by the presence of warriors and mythical elements.",
    "German(visible, country, mutual elements, Non-English European, English)": "- First image: Fairy tale illustration\n- Second image: Beer mugs on a tray\n- Relation: Imagery and story\n- Explanation: The first image is a black and white illustration reminiscent of classic fairy tales, featuring a character in a natural setting. The second image shows beer mugs on a tray, often associated with social gatherings or celebrations. Although the two images seem unrelated at first glance, they both evoke imagery and narratives: one through storytelling and the other through the social context of sharing drinks. Both can be tied to themes of tradition and cultural practices.",
    "German celerity(invisible, people, mutual elements, Non-English European, English)": "- First image: Two men posing, one in a basketball uniform with a basketball and another in a blue shirt.\n- Second image: A young man with long hair, smiling, standing in front of a blackboard with mathematical equations.\n- Relation: Professionalism and expertise in different fields.\n- Explanation: The first image represents professionalism in sports, with one man ready for a basketball game and the other perhaps in a coaching or managerial role. The second image showcases expertise in academia, with the man standing confidently in front of a blackboard filled with mathematical equations, symbolizing his knowledge in the field of mathematics or physics. Both images depict individuals who are skilled and knowledgeable in their respective areas.",
    "GOAT in some sport fields(invisible, people, mutual elements, NA, English)": "- First image: A professional basketball player in action during a game.\n- Second image: An athlete in the middle of a sprint, likely during a track and field event.\n- Relation: Athletic achievement.\n- Explanation: Both images depict athletes in moments of high achievement and intense concentration. The basketball player, dressed in a team uniform, is captured in a dynamic pose, perhaps shooting a free throw or making a basket. Similarly, the sprinter, clad in a yellow and green uniform, is shown in mid-stride, likely crossing the finish line or reaching a significant milestone in the race. Both athletes are engaged in their respective sports with a sense of focus and determination, highlighting the universal theme of athletic achievement.",
    "Greco-Persian Wars(invisible, history, mutual elements, other, English)": "- First image: Marathon start line\n- Second image: Diagram of a rowing boat\n- Relation: Human physical activity\n- Explanation: Both images depict different aspects of human physical activity. The first image shows a large group of runners participating in a marathon, emphasizing endurance and community. The second image illustrates the mechanics and structure of a rowing boat, highlighting the technical aspects of another form of physical activity. Despite their differences, both images are connected by the theme of human physical exertion and the pursuit of fitness.",
    "Gundam drivers(visible, cartoon or game, mutual elements, East Asia, English)": "- First image: Anime character in futuristic attire.\n- Second image: Anime character holding a red rose.\n- Relation: Both are anime characters.\n- Explanation: Both images feature characters from anime. The first character is dressed in a futuristic outfit, which suggests a science fiction or space exploration theme. The second character is holding a red rose, which often symbolizes romance or passion. Despite the different themes, both characters share the common element of being anime-style characters.",
    "Hidden symbols(visible, sense, mutual elements, NA, English)": "- First image: A smiling face made of Oreo cookies and cookie crumbs.\n- Second image: A fantastical castle on a cliff surrounded by a body of water with mountains in the background.\n- Relation: Artistic creativity and the use of unconventional materials.\n- Explanation: Both images showcase the artist's creativity. The first image uses cookies to create a portrait, while the second image depicts a fantastical castle with detailed architecture and natural surroundings. Both images demonstrate the artists' unique approaches to their subjects.",
    "Hidden words(visible, sense, mutual elements, NA, English)": "- First image: Cityscape with a view of Barcelona from a high vantage point, showcasing a table with drinks against a backdrop of urban buildings and the Mediterranean Sea.\n- Second image: Forest scene featuring tall trees and a clear blue sky with the sun shining through the canopy.\n- Relation: Contrasting urban and natural environments.\n- Explanation: The first image represents a bustling cityscape with man-made structures and the second image depicts a tranquil forest scene with natural elements. Both images highlight different aspects of human experiences - one with urban life and the other with nature.",
    "High-dimension geometry(visible, STEM, mutual elements, NA, English)": "- First image: [Abstract digital art]\n- Second image: [Glass vase artwork]\n- Relation: [Fluid shapes and transparency]\n- Explanation: The first image is an abstract digital artwork that features fluid, overlapping shapes in shades of blue and pink, creating a sense of depth and movement. The second image is a photograph of a glass vase with a similar fluid design, characterized by a transparent and sleek appearance with a handle-like structure on one side. Both images share a theme of fluidity and transparency, with the digital art providing a colorful and dynamic representation, while the glass vase offers a tangible and elegant physical manifestation of these concepts.",
    "Horrible games(visible, cartoon or game, mutual elements, NA, English)": "- First image: A neglected, fenced area with signs saying \"Sickness Here\" and \"God Bless.\"\n- Second image: A solitary man walking down a foggy street with traffic lights visible overhead.\n- Relation: Contrasting environments, both isolated and eerie.\n- Explanation: The first image depicts a confined and potentially hazardous area, symbolizing neglect or abandonment, while the second image shows a solitary figure in an open space, suggesting introspection or solitude. Both images share a theme of isolation and an eerie atmosphere, but they contrast in terms of setting (enclosed vs. open) and the presence of human elements (signs vs. a human figure).",
    "Illumination(invisible, ability, mutual elements, NA, English)": "- First image: Package of white candles\n- Second image: iPhone screen displaying apps and widgets\n- Relation: Product display\n- Explanation: The first image shows a package of white candles, which is a product. The second image displays an iPhone screen with various apps and widgets, which is a digital product display. Both images showcase products, although one is a physical product and the other is a digital interface.",
    "Indian(invisible, country, mutual elements, other, English)": "- First image: Monochrome numeric pattern\n- Second image: Architectural landmark structure\n- Relation: Geometric design\n- Explanation: Both images feature a strong emphasis on geometric patterns and symmetry. The first image showcases a simple yet striking repetitive numeric pattern in a monochrome palette, while the second image captures the intricate geometric designs and symmetrical structure of the Taj Mahal, a renowned architectural landmark. The commonality lies in the attention to geometric design and symmetry, despite the vastly different subjects.",
    "Invention by French(invisible, history, mutual elements, Non-English European, English)": "- First image: Guillotine in a museum setting\n- Second image: Hot air balloon in flight\n- Relation: Contrasting human experiences\n- Explanation: The first image depicts a historical piece of equipment used for execution, representing a dark period in human history. The second image shows a hot air balloon in flight, symbolizing adventure, freedom, and the joy of human experiences. The contrast between the two images highlights the range of human experiences, from historical darkness to modern-day leisure activities.",
    "Invention by Italians(invisible, STEM, mutual elements, NA, English)": "- First image: Denim jeans and casual attire\n- Second image: Homemade pizza with tomato sauce and basil\n- Relation: Comfort and simplicity\n- Explanation: Both images convey a sense of comfort and simplicity. The first image shows a pair of classic denim jeans paired with a light blue shirt, representing a casual and comfortable style. The second image depicts a homemade pizza with simple ingredients such as tomato sauce, mozzarella cheese, and basil, symbolizing a comforting and straightforward meal. Both images share a common theme of casualness and a focus on everyday, relatable items.",
    "IT tycoons dropped their education from Harvard(visible, people, mutual elements, NA, English)": "- First image: A distinguished older man at a conference.\n- Second image: A young man with curly hair smiling on stage.\n- Relation: Both are public figures.\n- Explanation: The first image depicts a man in a formal setting, possibly giving a speech or presentation at a conference. The second image shows a young man with curly hair smiling on stage, suggesting he might be a speaker or presenter at an event. Both individuals are in the public eye and are engaged in activities that require public speaking or presentation.",
    "K-pop female singers(visible, music, mutual elements, East Asia, English)": "- First image: [Portrait of a woman with red hair and purple background]\n- Second image: [Close-up of a woman with dark hair and white and green background]\n- Relation: [Color contrast and background change]\n- Explanation: Both images feature a woman with long hair and a similar pose. However, the first image has a woman with red hair against a purple background, while the second image features a woman with dark hair against a white and green background. The color contrast and background change between the two images create a distinct visual difference while maintaining a similar subject matter.",
    "Ka-shing Li(visible, business, mutual elements, NA, English)": "- First image: Superhero parody\n- Second image: Corporate logo\n- Relation: Symbolism\n- Explanation: The first image depicts a man dressed as a superhero, symbolizing strength and heroism in a humorous way. The second image shows a corporate logo, representing a company or brand. Both images use symbolism, with the superhero costume symbolizing power and the logo symbolizing corporate identity.",
    "Kamikaze suicide attack(invisible, ability, mutual elements, NA, English)": "- First image: A fantastical creature\n- Second image: A model of an airplane\n- Relation: Both are non-human constructs\n- Explanation: The first image depicts a fictional creature that does not exist in reality, while the second image shows a model of an airplane, which is a human-made object. Both are creations that stem from imagination or human ingenuity, despite belonging to entirely different domains—the former to fantasy and the latter to aviation technology.",
    "Kung fu(invisible, culture, mutual elements, East Asia, English)": "- First image: A 3D animated panda character.\n- Second image: Two metallic rods forming an 'X' shape on a wooden floor.\n- Relation: Contrast in nature.\n- Explanation: The first image represents a fictional, animated character designed to evoke emotional responses and tell a story, while the second image depicts a simple, real-world object that appears to be functional or decorative. Despite their different purposes and contexts, they both share a connection to the 'X' shape, with the panda's crossed arm posture and the crossed metallic rods.",
    "Kusanagi-no-Tsurugi sword(visible, culture, mutual elements, East Asia, English)": "- First image: Anime figurine\n- Second image: Anime character illustration\n- Relation: Anime genre\n- Explanation: Both images are related to the anime genre. The first image shows a figurine of an anime character, which indicates that it is a collectible item representing a character from an anime series. The second image is an illustration of an anime character with a distinct look, including pointy ears and a serious expression. The common element between the two images is that they both represent characters from anime series, and the figurine could potentially be a collectible item based on the illustrated character.",
    "Lands in the Arctic Circle(visible, location, mutual elements, other, English)": "- First image: Alaska map with geographical and topographical features.\n- Second image: A globe with a highlighted region.\n- Relation: Focus on a specific region.\n- Explanation: Both images focus on a specific region, with the first image providing detailed information about Alaska's geography, and the second image highlighting a similar region on a global scale. The connection lies in the geographical focus, with both images centering on a particular area.",
    "Lion in their Icons(visible, animal, mutual elements, NA, English)": "- First image: A group of soccer players celebrating a victory or goal on the field.\n- Second image: The exterior of the MGM Grand hotel with people on an escalator and a sign about a show.\n- Relation: Both images are related to teamwork and camaraderie.\n- Explanation: In the first image, the soccer players are displaying unity and happiness as a team, which is a common theme seen in team sports. Similarly, the MGM Grand hotel, known for hosting events and shows, also embodies the spirit of bringing people together for entertainment. Both images convey a sense of collective joy and celebration, whether it is in sports or hospitality.",
    "Louis Vuitton(visible, business, mutual elements, NA, English)": "- First image: A handbag designed to look like an insect.\n- Second image: A model walking down the runway wearing a checkered shirt and holding a bag.\n- Relation: Insect theme.\n- Explanation: The first image features a handbag designed to look like an insect, while the second image shows a model wearing a checkered shirt, one of the elements of the insect-themed design. The insect theme is the connection between the two images.",
    "Mammals that can swim(visible, animal, mutual elements, NA, English)": "- First image: A duckling being held gently in a person's hands.\n- Second image: An aerial view of a whale and a calf swimming in the ocean, with a fishing rope visible in the water.\n- Relation: wildlife\n- Explanation: Both images depict different aspects of wildlife. The first image focuses on a small, vulnerable duckling being cared for by humans, showcasing a close-up and intimate interaction. The second image captures a larger marine scene, highlighting the relationship between a whale and its calf in their natural habitat. The connection lies in the fact that both images involve animals in different stages of life and environments, emphasizing the diversity and beauty of wildlife.",
    "Michelle Yeoh(visible, movie, mutual elements, East Asia, English)": "- First image: 007 gun icon\n- Second image: Film poster for \"Everything Everywhere All at Once\"\n- Relation: Action and suspense\n- Explanation: The first image features the iconic 007 gun icon, associated with the James Bond series known for its action and suspense. The second image is a film poster for \"Everything Everywhere All at Once,\" a movie known for its action-packed scenes and suspenseful plot. Both images are connected by the theme of action and suspense, suggesting dynamic and thrilling narratives.",
    "Millennium Prize Problems(invisible, STEM, mutual elements, NA, English)": "- First image: A mathematical equation representing fluid dynamics.\n- Second image: A diagram illustrating the complexity classes in computational complexity theory.\n- Relation: Both images involve concepts from physics and mathematics.\n- Explanation: The first image deals with the mathematical modeling of fluid flow and its properties, while the second image represents the theoretical aspects of computational complexity, which is related to understanding the efficiency and feasibility of algorithms. Both images are abstract representations of complex concepts in their respective fields.",
    "Movie directed by Ang Lee(invisible, movie, mutual elements, East Asia, English)": "- First image: Two men in cowboy hats sharing an intimate moment.\n- Second image: A shirtless man and a tiger on a white boat.\n- Relation: Contrast between intimacy and wild nature.\n- Explanation: The first image depicts a quiet, intimate human connection, while the second image brings forth a scenario where a human and a wild animal share a peaceful moment amidst nature. This juxtaposition highlights the contrast between calm, personal interactions and the wild, untamed aspects of the natural world.",
    "Ne pas réveiller le chat qui dort(invisible, art, mutual elements, Non-English European, English)": "- First image: Silence gesture\n- Second image: Sleeping cat\n- Relation: Quietness\n- Explanation: Both images convey a theme of quietness and peace. The first image, showing a person making a silence gesture by putting a finger to their lips, suggests the importance of silence. The second image, featuring a sleeping cat, also embodies a sense of peace and quiet. The connection between the two images lies in their shared representation of silence and tranquility.",
    "Ninja(visible, culture, mutual elements, East Asia, English)": "- First image: Anime character in action pose with flames\n- Second image: Ninjas training in a forest setting\n- Relation: Martial arts theme\n- Explanation: Both images depict characters engaged in martial arts. The first image shows an anime character with a dynamic pose and flames, which suggests power and energy, typical of martial arts anime. The second image features ninjas training in a forest, which is common in martial arts settings. The connection between the two images lies in the martial arts theme, showcasing characters in action-oriented, combat-ready stances.",
    "Nintendo games(visible, cartoon or game, mutual elements, East Asia, English)": "- First image: A character running in a bright, fantasy landscape with golden trees and floating islands.\n- Second image: A character, depicted in a pixel art style, jumping over obstacles in a simplistic, 2D platformer game.\n- Relation: Both images feature video game characters.\n- Explanation: The first image is from a more modern, graphically intense game with an expansive, fantastical environment, while the second image represents a classic, 2D platformer game with simple graphics and straightforward gameplay. Despite their differences in style and complexity, both images highlight the theme of video gaming and the exploration of virtual worlds.",
    "Nuclear power(invisible, STEM, mutual elements, NA, English)": "- First image: Abandoned Ferris wheel in a forest\n- Second image: Navy battleship sailing in the ocean\n- Relation: Man-made constructs\n- Explanation: Both images feature man-made constructs that are no longer in use. The Ferris wheel in the first image is standing still and appears to be abandoned, while the navy battleship in the second image is sailing through the ocean, showcasing its ongoing utility. Despite their different contexts and purposes, both images highlight the impact of human activity on the environment.",
    "Numbing(invisible, smell or taste, mutual elements, NA, English)": "- First image: Essential oil and spices\n- Second image: Spices\n- Relation: Cinnamon\n- Explanation: The first image depicts a bottle of essential oil, likely cinnamon oil, and some whole cinnamon sticks. The second image shows a pile of broken cinnamon sticks. Both images are related to the spice cinnamon, with the first image focusing on the oil form and the second image highlighting the dried bark form.",
    "Picaso self-potrait(visible, art, mutual elements, Non-English European, English)": "- First image: Portrait of a young man in impressionist style\n- Second image: Abstract art portrait of a monkey\n- Relation: Theme of facial expressions\n- Explanation: Both images focus on the depiction of faces, though in vastly different styles. The first image uses realistic and detailed brushstrokes to capture the facial features of a young man, while the second image employs abstract and geometric shapes to create a stylized portrait of a monkey. Despite their differences, both images explore the emotional expressions conveyed through the faces, whether it be the contemplative look of the young man or the curious expression of the monkey.",
    "Poisoning in tails(visible, animals, mutual elements, NA, English)": "- First image: A stingray on a sandy seabed\n- Second image: A black scorpion with white larvae on its back\n- Relation: Marine life and its adaptations\n- Explanation: The first image shows a marine animal, specifically a stingray, which is adapted to living on sandy seabeds. The second image depicts a terrestrial arthropod, a black scorpion, which has evolved to carry its offspring. Both images highlight the adaptations of different species to their environments, with the stingray adapted for life in water and the scorpion adapted for life on land.",
    "Pokemon with dragon and electric attributes(invisible, cartoon or game, mutual elements, East Asia, English)": "- First image: Animated character\n- Second image: Stuffed animal\n- Relation: Both are representations of fictional creatures\n- Explanation: The first image features an animated character from a popular franchise, while the second image shows a stuffed animal version of another fictional creature from the same franchise. Both images showcase different forms of media representation of these creatures.",
    "Political leaders that were actors(visible, people, mutual elements, NA, English)": "- First image: A man in a suit smiling and speaking at a podium.\n- Second image: A man in a green shirt speaking at a podium.\n- Relation: Public speaking.\n- Explanation: Both images depict individuals delivering speeches at a podium. The first image shows a man in a formal suit, suggesting a more formal event, while the second image shows a man in a casual green shirt, suggesting a more casual setting. Despite the difference in attire, both individuals are engaged in the act of public speaking.",
    "Portuguesa culture(invisible, culture, mutual elements, Non-English European, English)": "- First image: Wine corks from a renowned vineyard\n- Second image: Portuguese pastel de nata pastries\n- Relation: Portugal's culinary and vinicultural heritage\n- Explanation: Both images represent elements of Portugal's rich culture—the first image showcases wine corks, which are a significant product of the country's wine industry, while the second image features pastel de nata, a quintessential Portuguese pastry. These elements highlight Portugal's well-known contributions to both culinary arts and wine production.",
    "Prada(visible, business, mutual elements, NA, English)": "- First image: [Fashion Event with Models]\n- Second image: [High-fashion Runway Model]\n- Relation: [Fashion Industry]\n- Explanation: Both images portray elements of the fashion industry. The first image shows a group of models and attendees at a fashion event, suggesting a social or professional gathering related to fashion. The second image features a model walking the runway, which is a common aspect of fashion shows where models showcase clothing designs for an audience.",
    "PVC(invisible, material, mutual elements, NA, English)": "- First image: Pipe fittings assortment\n- Second image: Vinyl record playing on a turntable\n- Relation: Plumbing and music\n- Explanation: Both images depict objects related to different aspects of daily life, with the first image showing plumbing pipes and fittings, and the second image showing a vinyl record and a turntable. The connection between the two images lies in the fact that both are essential components of their respective systems - one for managing water flow in buildings and the other for playing music.",
    "Qin dynasty(invisible, history, mutual elements, East Asia, English)": "- First image: Terracotta Army\n- Second image: The Great Wall of China\n- Relation: Cultural Heritage\n- Explanation: Both the Terracotta Army and the Great Wall of China are significant cultural heritage sites in China. They both represent historical artifacts and engineering feats of the ancient Chinese civilization. While the Terracotta Army was built to protect the emperor in the afterlife, the Great Wall was constructed to protect the Chinese empire from invaders. Both sites are popular tourist attractions and symbols of China's rich history and culture.",
    "Religion city(visible, city, mutual elements, NA, English)": "- First image: Aerial view of a prominent religious landmark with a golden dome and intricate architectural details.\n- Second image: Aerial view of a large circular plaza surrounded by colonnades, leading to a significant monument and cityscape.\n- Relation: Both images depict iconic religious and historical sites with architectural grandeur and aerial perspectives.\n- Explanation: The first image shows the Dome of the Rock, a significant Islamic site in Jerusalem, while the second image is of St. Peter's Square in Vatican City, a renowned Christian landmark. Both images highlight the scale and design of these important cultural and religious centers, with the aerial views emphasizing their prominence and the surrounding urban landscapes.",
    "Rihanna(invisible, musics, mutual elements, USAEnglish, English)": "- First image: [Diamond Image]\n- Second image: [Umbrella Image]\n- Relation: [Reflection and Protection]\n- Explanation: The first image features a diamond, symbolizing the concept of reflection due to its ability to refract light. The second image depicts a person holding an umbrella, representing the theme of protection from elements. Both images share the idea of safeguarding something valuable – the diamond's brilliance and the person's well-being. The umbrella's protective purpose mirrors the diamond's reflective nature, highlighting different aspects of safeguarding beauty and integrity.",
    "Royal couple(visible, people, mutual elements, NA, English)": "- First image: A distinguished elderly couple at a social event.\n- Second image: A well-dressed couple waving outdoors.\n- Relation: Elderly couple, waving, social event.\n- Explanation: Both images feature elderly couples waving and dressed in formal attire. The first image captures a moment of interaction between the couple, while the second image shows them waving to an unseen audience. The common theme of elderly couples interacting in a formal setting connects the two images.",
    "Russia(visible, country, mutual elements, other, English)": "- First image: A happy white fluffy dog with perky ears and a pink tongue, set against a blue carpet background.\n- Second image: Three young ballet dancers in lilac leotards and pink tights, practicing at the barre in a wood-paneled room with large windows.\n- Relation: Both images depict subjects in their element, showcasing their natural charm and grace.\n- Explanation: The first image captures the innocent joy and playful nature of a dog, while the second image portrays the disciplined beauty and elegance of ballet dancers in training. Both subjects are at ease in their respective environments, embodying a sense of comfort and belonging.",
    "Shared economy(visible, business, mutual elements, NA, English)": "- First image: Yellow and black bicycles lined up in a row on a city sidewalk.\n- Second image: White and yellow charging lockers with a blue stripe on a city street.\n- Relation: Both images depict urban, shared-use systems (bicycles and charging lockers).\n- Explanation: The first image shows a bike-sharing system, where bicycles are available for public use. The second image shows charging lockers, likely for electric scooters or similar devices, indicating a shared-use system for battery charging. Both systems suggest a focus on sustainable urban transportation.",
    "Solar power(invisible, STEM, mutual elements, NA, English)": "- First image: Satellite in Earth orbit\n- Second image: Dried fruits and vegetables\n- Relation: Preservation\n- Explanation: Both images depict items that are preserved for extended periods. The satellite is designed to function in space for years, while the dried fruits and vegetables are preserved to last longer than their fresh counterparts. Both concepts emphasize the importance of preservation in different contexts, one for technological advancement and the other for food sustainability.",
    "Sour(invisible, sense, mutual elements, NA, English)": "- First image: A plate of orange, crispy chicken pieces topped with green onions and a drizzle of sauce.\n- Second image: A plate of cooked vegetables, possibly Chinese cabbage, with a darkened and wrinkled texture.\n- Relation: Both images showcase Asian cuisine.\n- Explanation: The first image represents a popular Chinese dish, likely sweet and sour chicken, while the second image shows a side dish often served with Asian entrees. Both dishes are common in many Asian cuisines, indicating a shared culinary theme.",
    "Spain(visible, culture, mutual elements, Non-English European, English)": "- First image: A black bull running in a dirt arena with a red wall in the background.\n- Second image: A group of football players wearing red uniforms and posing for a photo on a field.\n- Relation: Both images depict scenes of intense energy and focus, with the bull and the football players representing different forms of competitive spirit and physical power.\n- Explanation: The first image captures the raw, untamed energy of the bull as it charges in the arena, while the second image showcases the disciplined, team-oriented energy of the football players as they pose for a team photo. Both images highlight the excitement and passion associated with their respective activities, whether it's bullfighting or football.",
    "Stealth(invisible, ability, mutual elements, NA, English)": "- First image: Robotic aircraft model\n- Second image: Fantasy creature character\n- Relation: Sci-fi and fantasy themes\n- Explanation: The first image depicts a futuristic robotic aircraft, representing science fiction elements. In contrast, the second image showcases a fantasy creature, emphasizing the fantasy genre. Despite belonging to different categories, both images share a common theme of imaginative and speculative fiction, highlighting advanced technology and mythical creatures respectively.",
    "Stinky smell(invisible, sense, mutual elements, NA, English)": "- First image: A close-up photograph of a pitcher plant, showcasing its deep red color and distinctive white spots. The plant's interior is filled with water, and its surface is adorned with tiny hairs, adding to its unique appearance. The surrounding area is lush with green foliage, providing a stark contrast to the plant's vivid color.\n- Second image: A can of Surströmming, a traditional Swedish fermented herring, is displayed on a plate. The can features a yellow label with red and black lettering, and a red lid. The can is open, revealing several pieces of herring inside. A silver spoon rests on the plate, ready for use.\n- Relation: Both images feature a central object with a striking color contrast—the deep red of the pitcher plant and the yellow label of the Surströmming can. Additionally, both images highlight the object's unique features—the white spots on the plant and the herring inside the can. The green foliage in the first image and the white plate in the second image provide complementary backgrounds that emphasize the central objects.",
    "Sun Wukong(visible, myth, mutual elements, East Asia, English)": "- First image: A fierce and battle-ready fantasy character.\n- Second image: A dynamic pose of an animated character.\n- Relation: Warrior spirit.\n- Explanation: Both images depict characters with a strong, determined presence. The first image shows a fantasy warrior character with intricate armor and a weapon, ready for battle. The second image features an animated character in a fighting pose, exuding confidence and readiness for action. Both characters share a common theme of being prepared for combat and embody a warrior spirit.",
    "Symbol of rabbit(visible, sense, mutual elements, NA, English)": "- First image: Hand gesture\n- Second image: Paper rabbit\n- Relation: Origami\n- Explanation: The first image features a hand gesture that appears to be a classic finger game or a symbolic gesture. The second image shows an origami rabbit, a paper craft that involves folding paper into various shapes. The connection between the two images is the concept of origami, which is the art of paper folding. The hand gesture in the first image could be interpreted as an origami representation of a simple animal or object, similar to the paper rabbit in the second image.",
    "Symbols of Unforturenateness(invisible, myth, mutual elements, USAEnglish, English)": "- First image: Black and white close-up of a hand turning over a page of a calendar to reveal the number \"13\" followed by \"FRIDAY\".\n- Second image: A black cat with yellow eyes lying on a cat tree, surrounded by a cozy home environment.\n- Relation: None.\n- Explanation: The first image depicts a specific day on a calendar, Friday the 13th, which is often associated with superstition and considered unlucky. The second image shows a domestic scene featuring a black cat, which is a common household pet. The two images have no direct connection or shared themes.",
    "The Old Summer Palace(invisible, history, mutual elements, East Asia, English)": "- First image: A house engulfed in flames with bright orange and yellow flames.\n- Second image: A detailed bronze statue of a horse's head with lifelike eyes and a realistic expression.\n- Relation: contrast between destruction and creation.\n- Explanation: The first image shows a house burning down, representing destruction, while the second image depicts a sculpted horse's head, representing human creativity and artistry. Both images showcase powerful elements: fire in the first and metalwork in the second.",
    "Time control(invisible, ability, mutual elements, NA, English)": "- First image: A bold and assertive anime character in a vibrant scene.\n- Second image: A group of colorful anime characters engaging in an action-packed scene.\n- Relation: Dynamic energy and bold action.\n- Explanation: Both images feature anime characters in dynamic, action-packed poses, exuding a sense of boldness and assertiveness. The first image showcases a single character, while the second image features a group of characters, but the common element is the energetic and vibrant atmosphere.",
    "Topics about hero(invisible, cartoon or game, mutual elements, East Asia, English)": "- First image: Anime character holding a large futuristic weapon.\n- Second image: Group of superheroes, including Iron Man, Black Widow, Captain America, and Black Panther against a cosmic background.\n- Relation: Both images depict characters with a strong, action-oriented demeanor.\n- Explanation: The anime character appears ready for battle, similar to the determined and powerful stances of the superheroes. Each image conveys a sense of readiness and strength, despite being from different genres and styles.",
    "Transformer(invisible, sense, mutual elements, NA, English)": "- First image: Transformer architecture.\n- Second image: Movie promotional poster featuring characters and a large robot.\n- Relation: Fiction and technology.\n- Explanation: The first image illustrates a complex artificial intelligence model known as a transformer, used for processing sequential data like natural language. The second image depicts a movie poster for \"Transformers: Age of Extinction,\" a science fiction film that features giant robots and human characters. The connection lies in the term \"transformer,\" which is a central concept in both the AI model and the movie's theme involving robotic characters.",
    "Tsunami cause(invisible, history, mutual elements, East Asia, English)": "- First image: Urban Earthquake Damage\n- Second image: Nuclear Plant Water Leak\n- Relation: Disaster\n- Explanation: Both images depict scenes of significant damage and destruction. The first image shows extensive damage to urban infrastructure, including cracked roads and collapsed houses, which are typical consequences of an earthquake. The second image captures the aftermath of a water leak inside a nuclear plant, highlighting the potential for catastrophic consequences in a controlled environment. Both scenarios involve natural or man-made disasters that have caused structural and operational failures.",
    "UCLA(invisible, location, mutual elements, USAEnglish, English)": "- First image: Graduation scene\n- Second image: Book cover\n- Relation: Academic achievement\n- Explanation: The first image depicts a graduate holding a diploma in front of a university building, symbolizing the culmination of academic efforts. The second image shows the cover of \"The Book of Why,\" authored by Judea Pearl, which discusses the science of cause and effect. Both images relate to academic achievement and the pursuit of knowledge, with the book potentially serving as a resource for further learning and understanding in the field of causality.",
    "Umami(invisible, sense, mutual elements, East Asia, English)": "- First image: Aged cheese with embossed letters\n- Second image: Nori sheets\n- Relation: Edible packaging\n- Explanation: Both images feature food items that can be used as packaging. The aged cheese in the first image is often wrapped in wax or cloth, while nori sheets in the second image are commonly used to wrap sushi. Both items are consumed after being opened.",
    "Uncomfortable noise(invisible, sense, mutual elements, NA, English)": "- First image: A dog with an aggressive expression, showing teeth and snarling.\n- Second image: A hand erasing the word \"Homework\" written on a chalkboard.\n- Relation: Aggression/anger\n- Explanation: Both images convey a sense of aggression. The dog's aggressive expression in the first image symbolizes hostility or defense, while erasing the word \"Homework\" on the chalkboard in the second image can be interpreted as a metaphor for rejecting or resisting the concept of homework, which is a common source of frustration for students.",
    "Waterproof accessory(visible, stuff, mutual elements, NA, English)": "- First image: Winter glove\n- Second image: Luxury watch\n- Relation: Cold weather accessories\n- Explanation: Both images feature objects that are used as accessories to deal with cold weather. The winter glove is designed to keep hands warm and protected during winter, while the luxury watch is a sophisticated accessory that people may choose to wear even in cold weather. Both items are related to the theme of staying comfortable and stylish in cold weather conditions.",
    "Zombie(visible, myth, mutual elements, USAEnglish, English)": "- First image: Video game screenshot from Plants vs. Zombies\n- Second image: Silhouette of people being rescued by a helicopter\n- Relation: Battle or conflict\n- Explanation: The first image shows a whimsical battle between plants and zombies in a game, while the second image depicts a more serious and intense scenario of people being rescued from danger by a helicopter. Both images involve a theme of conflict or struggle, whether it's the playful fight between plants and zombies or the life-threatening situation of people being rescued.",
    "21 can be divided by 7 exactly(invisible, number, relation, NA, English)": "- First image: A poker table setup with cards and chips.\n- Second image: A serene seascape featuring a rainbow.\n- Relation: Luck and chance.\n- Explanation: Both images represent concepts of chance and luck. The poker table is a game of skill combined with chance, while the rainbow over the ocean could symbolize fate or serendipity.",
    "A movie clip of Titanic(invisible, movie, relation, USAEnglish, English)": "- First image: [portrait sketch]\n- Second image: [steamship illustration]\n- Relation: [historical context]\n- Explanation: The first image is a detailed sketch of a woman, capturing her essence and mood. The second image is an illustration of a steamship, possibly from the early 20th century. Both images, although different in subject matter, share a historical context. The steamship could represent a period when such vessels were pivotal in connecting distant lands, while the portrait sketch represents the art form of that era. Both images together evoke a sense of nostalgia and reflection on past times.",
    "A movie clip of Wolf of Wall street(invisible, movie, relation, USAEnglish, English)": "- First image: A sophisticated black and silver pen\n- Second image: A movie poster for \"The Wolf of Wall Street\" featuring Leonardo DiCaprio\n- Relation: Materialism\n- Explanation: Both images represent luxury and success, with the first image symbolizing upscale writing instruments and the second image showcasing a film about wealth and excess.",
    "A storyline of Godzilla x Kong The New Empire(visible, movie, relation, USAEnglish culture, English)": "- First image: Colosseum interior\n- Second image: Godzilla on ice\n- Relation: Prehistoric theme\n- Explanation: The first image shows the ancient Colosseum, a monumental amphitheater that was used for gladiatorial contests and ancient spectacles. The second image depicts Godzilla, a prehistoric monster. Both images share a prehistoric theme, as the Colosseum is an ancient structure and Godzilla is a prehistoric creature.",
    "A storyline of Titanic(visible, movie, relation, USAEnglish culture, English)": "- First image: A soccer player in a light blue jersey, likely part of a team, is seen spitting.\n- Second image: A vintage ocean liner with four smokestacks, sailing on a body of water.\n- Relation: Both images involve the theme of travel.\n- Explanation: The soccer player, representing an athlete traveling for games, and the ocean liner, representing a means of transportation across seas. Both images depict individuals or objects in motion, albeit in different contexts.",
    "A storyline of Transformer movie(invisible, movie, relation, USAEnglish culture, English)": "- First image: Urban landscape\n- Second image: Movie poster\n- Relation: Cinematic representation of urban environments\n- Explanation: The first image showcases the urban landscape of a bustling city with towering skyscrapers and a body of water in the foreground. The second image is a movie poster for \"Transformers: Age of Extinction,\" which features a cityscape in the background with characters in the foreground. The connection between the two images lies in the representation of urban environments, where the city serves as a backdrop for dramatic events in the movie poster, mirroring the real-world urban setting depicted in the first image.",
    "Benedict Cumberbatch(visible, movie, relation, USAEnglish culture, English)": "- First image: Magical battle scene\n- Second image: Detective duo in a study\n- Relation: Themes of mystery and intelligence\n- Explanation: Both images involve characters using their wit and intellect, with the first depicting a magical battle and the second featuring a detective duo. The common theme of using intelligence to solve problems or defeat enemies is present in both images. Additionally, the first image has a magical element, while the second has a more traditional detective setting, but both involve characters who are skilled in their respective fields.",
    "Blind(invisible, ability, relation, NA, English)": "- First image: A sitting Labrador Retriever wearing a harness\n- Second image: A man wearing sunglasses and a dark jacket\n- Relation: Both images depict a sense of style and fashion.\n- Explanation: In the first image, the Labrador Retriever is seen wearing an orange harness with the text \"HKGDA\" on it, suggesting a sense of style or purpose. In the second image, the man is also dressed in a stylish manner, wearing sunglasses and a dark jacket, exuding an air of sophistication. Both images showcase the importance of appearance and the way it can convey a message or emotion.",
    "Bulletin protection(invisible, ability, relation, NA, English)": "- First image: A nine-banded armadillo with distinctive leathery armor and a pointed snout.\n- Second image: A close-up of a woven fabric with a tightly interlocked pattern and frayed edges.\n- Relation: Weave\n- Explanation: Both the armadillo's armor and the woven fabric feature patterns composed of interlocking scales and threads, respectively. The armadillo's scales provide natural protection, while the woven fabric's pattern offers durability and strength.",
    "China(visible, country, relation, East Asia, English)": "- First image: A colorful rooster standing on a grassy field.\n- Second image: A white stone object with a dark background.\n- Relation: Nature and Sculpture\n- Explanation: The first image showcases the beauty of nature through the vibrant colors and intricate details of a rooster, while the second image depicts a white stone object, which can be seen as a form of abstract sculpture. Both images highlight different aspects of beauty, one through the natural world and the other through human-made artistic creations.",
    "Deaf(invisible, ability, relation, NA, English)": "- First image: Portrait of a historical figure\n- Second image: Modern electronic device\n- Relation: None\n- Explanation: The first image depicts a historical figure, likely a composer or writer, given the notebook and pen. The second image shows a modern electronic device, specifically a hearing aid. There is no direct connection or shared theme between the two images, as one represents a historical context while the other represents modern technology.",
    "December(invisible, time, relation, NA, English)": "- First image: Candlelit Menorah\n- Second image: Portrait of a Woman\n- Relation: Symbolism and Lighting\n- Explanation: The first image showcases a candlelit Menorah, a symbol often associated with Jewish culture and festivities like Hanukkah. The candles provide a warm, soft glow, creating a serene and spiritual atmosphere. The second image features a portrait of a woman, highlighting her facial features and elegant appearance. The lighting in this image also plays a significant role in emphasizing her features and creating an alluring visual effect. While the two images depict vastly different subjects, they share a common element of using lighting to convey mood and symbolism.",
    "Diabetic foot ulcer smell like rotten apple(invisible, smell or taste, relation, NA, English)": "- First image: Human foot with apparent infection\n- Second image: Two apples with different states of decay\n- Relation: Infected or decayed state\n- Explanation: Both images depict objects in a state of infection or decay. The human foot in the first image shows signs of a bacterial infection, while the apples in the second image exhibit different degrees of decay. This common theme of infection or decay highlights the natural process of deterioration in biological entities.",
    "Duck(invisible, food, relation, NA, English)": "- First image: Food presentation of sausages.\n- Second image: Spicy Korean dish featuring chicken and beans.\n- Relation: Spicy flavors.\n- Explanation: Both images display foods with a strong emphasis on spicy flavors. The first image features sausages, which could be spicy, and the second image clearly has a Korean dish known for its spicy ingredients. Both images convey a theme of bold, flavorful cuisine.",
    "Eason Chan(visible, music, relation, East Asia, English)": "1. First image: Asian man in professional attire.\n2. Second image: High-end mechanical watch with intricate design.\n3. Relation: Sophistication.\n4. Explanation: Both images depict sophistication through the man's professional appearance and the luxurious, detailed design of the watch.",
    "Easter egg(visible, movie, relation, USAEnglish culture, English)": "- First image: Futuristic cityscape\n- Second image: Identical twins in vintage room\n- Relation: Duality\n- Explanation: Both images explore the concept of duality. The first image depicts a futuristic cityscape with advanced technology and augmented reality elements, representing the future. The second image shows identical twins in a vintage room, representing the past. The connection between the two images lies in the contrast between the past and the future, highlighting the duality of time.",
    "Eminem(visible, music, relation, USAEnglish culture, English)": "- First image: A shirtless man with red markings on his face and torso, standing in a traditional Chinese setting with a mirror in the background.\n- Second image: A man wearing a black cap and jacket, with a beard and gold chain, standing at a podium and appearing to speak.\n- Relation: Both images feature a central figure in a dominant, confident pose, suggesting themes of power or leadership.\n- Explanation: The first image's setting and the man's attire hint at a martial arts or cultural film context, while the second image's podium and attire suggest a public speaking event or ceremony. Despite the different contexts, both subjects exude a sense of authority and presence.",
    "English channel(visible, location, relation, USAEnglish culture, English)": "- First image: a historical painting depicting a chaotic beach evacuation scene during a war, with soldiers, civilians, and ships scattered in a panic, under a sky filled with smoke and explosions.\n- Second image: a satellite view of the Dover Strait, showing the geographical separation between England and France, with the English Channel visible and landmasses marked by greenery and snow-capped areas.\n- Relation: both images represent significant aspects of the Dunkirk Evacuation during World War II, with the painting capturing the human drama and the satellite image showing the strategic geographical location of the event.\n- Explanation: The first image is a dramatic artistic representation of the Dunkirk Evacuation, focusing on the human experience of chaos and desperation during a pivotal moment in WWII. The second image provides a modern, objective view of the English Channel, highlighting the physical barrier that played a crucial role in the events of Dunkirk. Both images are connected by their depiction of the Dunkirk Evacuation, with the painting emphasizing the human and emotional impact, while the satellite image underscores the geographical and strategic significance of the location.",
    "Fermat's last theorm(invisible, STEM, relation, NA, English)": "- First image: A middle-aged man with glasses and receding grey hair, dressed in a blue and white striped shirt and a grey tweed jacket with a red and yellow pattern.\n- Second image: A mathematical equation, x^n + y^n = z^n, written in a black serif font on a white background.\n- Relation: Fermat's Last Theorem.\n- Explanation: The first image is of Andrew Wiles, a mathematician who made significant contributions to proving Fermat's Last Theorem, which is represented by the equation in the second image. Fermat's Last Theorem states that no three positive integers x, y, and z can satisfy the equation x^n + y^n = z^n for any integer value of n greater than 2. Andrew Wiles famously proved this theorem in 1994 after working on it for over seven years.",
    "Gorilla(visible, animal, relation, NA, English)": "- First image: A muscular gorilla with a highly detailed and realistic appearance.\n- Second image: An animated character, possibly from a martial arts or action-packed anime series, with a fierce expression.\n- Relation: Power and strength\n- Explanation: Both images convey a sense of power and strength. The gorilla, with its muscular build and imposing stance, embodies raw physical strength, while the animated character, with his intense gaze and serious expression, suggests inner strength and determination.",
    "Guangzhou(invisible, location, relation, East Asia, English)": "- First image: A towering skyscraper in an urban landscape.\n- Second image: Two young goats interacting on a grassy field.\n- Relation: Urban vs. natural environment.\n- Explanation: The first image depicts a man-made skyscraper in a bustling city environment, representing human architectural achievement and urban development. In contrast, the second image portrays a natural scene with two young goats, symbolizing the simplicity and serenity of the natural world. The two images juxtapose the complexities and structures of human-made environments with the organic, untouched beauty of nature.",
    "Heat(visible, STEM, relation, NA, English)": "- First image: Hand with dermatitis\n- Second image: Mechanical part illustration\n- Relation: None\n- Explanation: The first image shows a close-up of a hand with clear signs of dermatitis, which is an inflammatory condition of the skin. The second image is a technical illustration of a mechanical part, possibly a pump or motor, with detailed measurements and annotations. There is no direct connection between the two images in terms of content, theme, or subject matter.",
    "Ice hockey(visible, sports, relation, NA, English)": "- First image: National Hockey League (NHL) logo\n- Second image: Portrait of a young person with dark hair and a blue shimmering garment\n- Relation: no_relation\n- Explanation: There is no direct relation between the two images. The first image is a logo representing a professional ice hockey league, while the second image is a portrait of an individual with no apparent connection to hockey or the NHL.",
    "In Chinese culture, guardian lions are set in front of the bank entrance, implying the protection of the heritage.(invisible, myth, relation, East Asia, English)": "- First image: An image of a bank branch\n- Second image: An image of two stone lions\n- Relation: cultural significance\n- Explanation: The first image shows a bank branch belonging to ICBC, a large Chinese bank. The second image shows two stone lions, which are traditional Chinese symbols often found in front of important buildings, including banks, to ward off evil spirits and bring good luck. The common theme between the two images is their cultural significance in China.",
    "Black celebrity(visible,people, mutual element, NA, English)": "- First image: Barack Obama in a formal setting.\n- Second image: An African American man holding an Oscar award.\n- Relation: Both are in formal attire, and the second image represents an Oscar award which is similar to the formal setting in the first image.\n- Explanation: In the first image, Barack Obama is dressed in a suit and tie, indicating a formal setting. Similarly, the second image shows an African American man holding an Oscar award, indicating a formal and prestigious event. Both images feature individuals in formal attire, although the context and background are different.",
    "Naruto(visible,cartoon or game,mutual element, East Asia, English)": "- First image: Anime character in fiery attire\n- Second image: Japanese logo with text and design elements\n- Relation: Symbols and cultural representation\n- Explanation: The first image features an anime character with distinct visual elements such as a headband and a circular symbol, which are reminiscent of Japanese cultural influences. The second image is a Japanese logo, which may not directly relate to the character but shares the cultural elements like the use of symbols and Japanese text. Both images reflect aspects of Japanese culture, albeit in different forms - one being a character from anime and the other being a logo with Japanese text and design elements.",
    "Inventions during World War II(visible, history, relation, NA, English)": "- First image: Microwave in use.\n- Second image: Rocket launch.\n- Relation: Technology in use.\n- Explanation: Both images depict different types of technology in use. The first image shows a microwave oven, a common household appliance, while the second image captures a rocket launch, a complex and advanced technological process. Despite their different purposes and scales, both images highlight the role of technology in modern life.",
    "Mexican culture(invisible, culture, relation, other, English)": "- First image: Decorated skulls on a colorful woven cloth\n- Second image: Tacos with toppings on a black plate\n- Relation: Celebration of culture\n- Explanation: The first image shows skulls decorated in a style associated with the Mexican celebration of the Day of the Dead, indicating a cultural celebration. The second image, while seemingly unrelated, could also represent a cultural celebration through the food, which is a staple in Mexican cuisine. Both images, while different in content, share the theme of celebrating culture through traditional elements.",
    "Nine-tail fox(invisible, culture, relation, East Asia, English)": "- First image: Anime character with flaming swirls\n- Second image: Yellow dragon-like creature with purple accents\n- Relation: Both images depict characters with a flaming/magical element\n- Explanation: The first image shows an anime character that appears to be in a battle stance with flaming swirls around them, indicating a fiery or powerful ability. The second image features a yellow dragon-like creature with purple accents, giving the impression of a mystical or magical being. Both characters seem to represent powerful and supernatural elements, which could suggest a connection in their thematic representation of strength and magic.",
    "Streching(visible, ability, relation, NA, English)": "- First image: [Cartoon character in a humorous pose]\n- Second image: [Human hand holding rubber bands]\n- Relation: [Character's pose and the rubber bands]\n- Explanation: The first image shows a cartoon character in a humorous squatting position, holding a hat on its head. The second image displays a human hand holding two rubber bands taut between the thumb and forefinger. The relation between the two images could be the pose of the character and the action of holding the rubber bands. The squatting position of the character might be inspired by the tension and balance demonstrated by the hand holding the rubber bands.",
    "The name Vegeta inspired from vegetable(invisible, cartoon or game, relation, East Asia, English)": "- First image: Anime character in action pose\n- Second image: Assorted fresh vegetables\n- Relation: Dynamic energy and life\n- Explanation: The first image depicts a dynamic anime character in an action pose, exuding a sense of energy and movement. The second image, showing a variety of fresh vegetables, represents life and vitality in a different context. Both images convey a sense of vitality, but in different forms - one through the animated action of the character and the other through the freshness and variety of the vegetables.",
    "The same pronouciation between beetles and Beatles(visible, sense, relation, NA, English)": "- First image: Four men crossing a street.\n- Second image: A beetle on a leaf.\n- Relation: Nature and urban life.\n- Explanation: The first image depicts a scene from an urban setting, while the second image showcases a moment from nature. Despite the difference in environment, both images capture the essence of life in their respective contexts. The first image reflects the hustle and bustle of city life, while the second image highlights the beauty and intricacy of nature.",
    "The same pronunciations(invisible, sense, relation, NA, English)": "- First image: Wheat flour and wheat stalks\n- Second image: Pink tulips in a pot\n- Relation: Natural ingredients\n- Explanation: The first image represents wheat flour, a key ingredient in baking and cooking, along with wheat stalks, suggesting a focus on natural and raw materials. The second image features vibrant pink tulips in a pot, which, while not directly related to wheat, also represents natural beauty and ingredients. Both images highlight the simplicity and beauty of natural elements, whether it be agricultural products or plant life.",
    "The song mockingbird(invisible, music, relation, USAEnglish, English)": "- First image: A man speaking at an event\n- Second image: A small bird perched on a wooden post\n- Relation: Nature\n- Explanation: Both images represent elements of nature, though in very different ways. The first image shows a human engaging with an audience, which can be seen as a social or natural interaction among humans. The second image directly depicts a bird, a natural element, in its environment. While the two images depict different aspects of nature, they both share a common theme of being part of the natural world.",
    "Toriyama Akira(visible, cartoon or game, relation, East Asia, English)": "- First image: A cartoon character wearing a gas mask.\n- Second image: A black and white photo of a smiling person wearing glasses.\n- Relation: None.\n- Explanation: The first image is a colorful, cartoonish depiction of a character with a gas mask, while the second image is a black and white photo of a person with glasses. There are no apparent connections or shared elements between the two images.",
    "USA(invisible, cartoon or game, relation, USAEnglish, English)": "- First image: Anime character with pink eye\n- Second image: Statue of Liberty with US flag\n- Relation: Symbolism\n- Explanation: Both images feature characters that symbolize something larger than themselves. The anime character may represent a specific personality or theme within the story, while the Statue of Liberty represents freedom and democracy. They both serve as symbols within their respective contexts.",
    "Valentine day(invisible, art, relation, USAEnglish, English)": "- First image: Black numbers on a white wall\n- Second image: Assorted truffles in a bowl\n- Relation: No visible connection\n- Explanation: The first image shows large black numbers painted on a white wall, which could be an address or a decorative element. The second image features a bowl of assorted truffles, possibly for a festive occasion, given the background elements. There is no apparent connection between the two images as they depict different subjects and themes.",
    "Weapons in World War 1(invisible, history, relation, NA, English)": "- First image: A red biplane with German insignia, parked on a grassy field.\n- Second image: A green military tank, possibly from the mid-20th century, displayed in a museum-like setting.\n- Relation: Warfare.\n- Explanation: Both images represent military vehicles used in different eras and conflict scenarios. The biplane may have been used during World War I or II, while the tank likely saw action in World War II or later conflicts. Despite their different functions and appearances, both vehicles share a common theme of warfare and military history. The biplane's bright color and insignia suggest it may have been used for reconnaissance or display purposes, while the tank's robust design indicates its role in frontline combat.",
    "Zhuge Liang(invisible, history, relation, East Asia, English)": "- First image: [Feathered fan]\n- Second image: [Wooden crossbow]\n- Relation: [Medieval theme]\n- Explanation: The first image features a feathered fan, which could be associated with historical or medieval times as a symbol of royalty or nobility. The second image depicts a wooden crossbow, a weapon commonly used during medieval periods. Both images share a medieval theme, connecting them through their historical context and usage in past eras.",
    "かわばたやすなり(visible, art, relation, East Asia, Japanese)": "- First image: Elderly Asian man in traditional attire.\n- Second image: Train moving through a snowy landscape.\n- Relation: Cultural connection.\n- Explanation: The traditional attire of the elderly Asian man in the first image hints at a cultural background that may be linked to the country from which the train originates in the second image.",
    "周星驰(visible, movie, relation, East Asia, Chinese)": "- First image: [Movie poster of a comedy film featuring exaggerated expressions and dynamic poses]\n- Second image: [Poster of a Chinese comedy television series featuring a variety of characters and traditional Chinese attire]\n- Relation: [Humorous and exaggerated character portrayals]\n- Explanation: Both images depict comedy genres with exaggerated expressions and humorous character interactions. The first image showcases a movie poster with a central figure in a dynamic pose, surrounded by various comedic characters. Similarly, the second image features a poster for a television series set in ancient China, with characters dressed in traditional attire, and a focus on humorous and exaggerated interactions. Both posters emphasize the comedic nature of their respective works through visual exaggeration and vibrant colors.",
    "武松打虎(invisible, animal, relation, East Asia, Chinese)": "- First image: Japanese character\n- Second image: Samurai warrior\n- Relation: martial culture\n- Explanation: The first image features a Japanese character, which could be associated with martial culture. The second image depicts a samurai warrior, which is a significant aspect of martial culture in Japan. Both images share a connection to the themes of combat, discipline, and tradition.",
    "A pen is mightier than a sword(invisible, art, metaphor, USAEnglish, English)": "- First image: A man trying to lift a giant pen.\n- Second image: A hand holding a small metal sword.\n- Relation: Both images feature a person handling an oversized object.\n- Explanation: The first image portrays a man in a suit struggling to lift a giant pen, symbolizing the heavy burden of writing or paperwork. The second image shows a small hand holding a tiny metal sword, possibly representing a delicate yet powerful action. The common theme between the two images is the handling of oversized objects, which may imply the challenges and efforts involved in managing significant tasks or responsibilities.",
    "Marriage rings(invisible, stuff, metaphor, NA, English)": "- First image: Gold bars\n- Second image: A wedding ceremony\n- Relation: Value\n- Explanation: Both images depict items of significant value. Gold bars are highly valuable due to their rarity and use in finance, while a wedding ceremony represents a valuable life event that is cherished and celebrated by individuals. Although they are vastly different in context and appearance, the underlying theme of value connects them.",
    "Newton's discovery of universal gravitation(invisible, STEM, metaphor, NA, English)": "- First image: Apple logo\n- Second image: Earth and Moon orbit\n- Relation: Space\n- Explanation: The first image represents a well-known brand, Apple, with its iconic logo. The second image is a visualization of the Earth and Moon in their orbits. The relation between these two images could be interpreted as the concept of space, where the Apple logo, often associated with innovation and technology, symbolizes human advancement into space exploration and the representation of Earth and Moon's orbit showcases the vastness of space.",
    "Prisoners' dilemma(invisible, STEM, metaphor, NA, English)": "- First image: A person making a move in a game of chess.\n- Second image: Two men in orange prison uniforms standing behind bars, facing each other.\n- Relation: Strategy and planning.\n- Explanation: The first image represents a strategic decision in the game of chess, which is often associated with careful planning and foresight. The second image depicts a scene that may involve strategic planning and decision-making, given the prison context where individuals may need to make crucial decisions about their future. While the two images appear to be unrelated at first glance, both involve the concept of strategic planning and decision-making.",
    "The pot calling the kettle black(invisible, art, metaphor, USAEnglish, English)": "- First image: Modern black kettle\n- Second image: Old stainless steel pot\n- Relation: Functionality\n- Explanation: Both images display containers used for holding liquids, with the kettle likely for boiling water and the pot for cooking. While they differ in design—one modern and sleek, the other old and functional—they share the common purpose of containing liquids for different uses.",
    "Tomaten auf den Augen haben(invisible, art, metaphor, Non-English European, English)": "- First image: Close-up of a human eye with a red, watery, and swollen appearance.\n- Second image: A group of red tomatoes, some cut open revealing the seed cavity.\n- Relation: Contrast in nature\n- Explanation: The first image depicts a medical condition or symptom, while the second image shows a group of fresh, healthy tomatoes. The two images contrast each other, with the eye representing something potentially ill or in need of care, and the tomatoes representing something natural, healthy, and vibrant.",
    "Wish(invisible, myth, metaphor, East Asia, English)": "- First image: A blue animated character holding a glowing key.\n- Second image: A missile or rocket flying through the sky.\n- Relation: Both images feature elements of flight and glowing objects.\n- Explanation: The first image showcases a blue, blue-skinned character with a magical glowing key, suggesting elements of fantasy and magic. The second image shows a missile or rocket in flight, emitting a bright light and trailing smoke. Both images involve the concept of flight and the presence of a glowing element, whether it be the key or the rocket's flame.",
    "书中自有黄金屋(invisible, art, metaphor, East Asia, Chinese)": "- First image: Open book with text pages on a wooden surface.\n- Second image: A luxurious golden house with a car parked in front, surrounded by palm trees.\n- Relation: Wealth and luxury.\n- Explanation: Both images depict elements associated with wealth and luxury. The open book symbolizes knowledge and intellectual wealth, while the golden house and car represent material wealth. Both images convey a sense of opulence and affluence through their visual elements.",
    "Arabian story(invisible, art, metaphor, USAEnglish, English)": "- First image: A red and white analog stopwatch icon\n- Second image: A white curved line resembling a smiley face on an orange background\n- Relation: Time and Emotion\n- Explanation: Both images symbolize different aspects of human experience: the stopwatch represents time, urgency, and productivity, while the smiley face suggests emotions, positivity, and personal well-being. Although they seem unrelated at first glance, both concepts are closely linked in daily life, as managing time effectively can greatly impact one's emotional state and overall satisfaction.",
    "number 0 and 1(invisible, number, metaphor, NA, English)": "- First image: Binary code sequence\n- Second image: Illuminated spiral fluorescent bulb\n- Relation: Digital-analog connection\n- Explanation: The first image represents digital information through a series of binary code, while the second image shows an analog light source, a fluorescent bulb, that could be controlled or modulated using digital signals. Both images relate to the theme of information representation and transmission, one in a digital format and the other in a physical, visible light format.",
    "8(invisible, number, relation, NA, English)": "- First image: A simple representation of the infinity symbol with a purple color.\n- Second image: The number 8 is displayed in a minimalist style.\n- Relation: Symbolism\n- Explanation: Both images incorporate circular elements that can be interpreted symbolically. The infinity symbol represents endlessness and continuity, while the number 8 can be seen as two circles stacked, which can also imply a connection to the concept of infinity.",
    "number of keys on a standard piano(visible, number, mutual elements, NA, English)": "- First image: Calculator display\n- Second image: Piano keyboard\n- Relation: Musical calculations\n- Explanation: The first image shows a calculator with the number 88 displayed on its screen. The second image depicts a piano keyboard. The relation between the two images could be interpreted as the concept of \"musical calculations,\" as the number 88 is also the standard number of keys on a full-size piano keyboard (52 keys for the white ones and 36 keys for the black ones).",
    "6 and 9(visible, number, relation, NA, English)": "- First image: Black number six.\n- Second image: Number nine in a circle.\n- Relation: Circular numbering.\n- Explanation: Both images feature numbers, with the second image incorporating a circular design around the number nine, which is not present in the first image.",
    "Golden Ratio(invisible, number, mutual elements, NA, English)": "- First image: Shell drawing\n- Second image: Greek temple\n- Relation: Pattern and design\n- Explanation: The first image depicts a shell with a detailed spiral pattern, similar to the structure of the Greek temple in the second image. Both images showcase geometric precision and the use of repetitive elements to create a harmonious design. The spiral of the shell echoes the rhythmic columns of the temple, highlighting a shared theme of natural and architectural beauty through patterns.",
    "Cryptography(invisible, number, metaphor, NA, English)": "- First image: A list of numbers within a circle.\n- Second image: A heavy-duty padlock with a key set.\n- Relation: Security\n- Explanation: The list of numbers in the first image might represent a code or sequence, while the padlock in the second image represents physical security. Both images can be related to the concept of securing something, whether it's through a numerical code or a physical lock.",
    "Superstition(visible, number, mutual elements, USAEnglish, English)": "- First image: Cinematic horror logo\n- Second image: Serene black cat\n- Relation: Contrast between fear and calm\n- Explanation: The first image evokes a sense of fear and suspense associated with the horror genre, while the second image portrays a sense of calm and tranquility with the serene black cat. Despite their contrasting emotions, both images can be connected through the concept of creating a strong visual impact through their respective elements—bold, striking text in the first image and the captivating gaze of the cat in the second.",
    "H2O(invisible, number, relation, NA, English)": "- First image: [balloons]\n- Second image: [snowflake]\n- Relation: [symmetry]\n- Explanation: Both images feature symmetrical objects. The balloons are arranged in a vertical line, creating a symmetrical appearance, while the snowflake has a radial symmetry with its six arms extending outwards. Both objects suggest a sense of balance and harmony in their design.",
    "Basketball Team Composition(visible, number, metaphor, NA, English)": "- First image: Chessboard with arranged pieces.\n- Second image: Basketball court diagram.\n- Relation: Strategy and planning.\n- Explanation: Both images represent games that involve strategic planning and positioning. In the chessboard, players plan moves to outmaneuver their opponent, while in the basketball court diagram, plays are designed to outscore the opposing team. Both images symbolize the importance of foresight and strategic thinking in competitive activities.",
    "Infinity(visible, number, metaphor, NA, English)": "- First image: Infinity symbol\n- Second image: Paper ribbon\n- Relation: Representation of infinity\n- Explanation: Both images share the concept of representing the idea of infinity. The first image uses the infinity symbol, which is universally recognized, while the second image depicts a paper ribbon twisted into a loop, creating a visual representation of the continuous and endless nature of infinity. The simplicity of the ribbon against the blue background emphasizes the theme of continuity and endlessness.",
    "Solar System(visible, number, relation, NA, English)": "- First image: A detailed close-up of a large round clock with Roman numerals and exposed gears.\n- Second image: A simplified illustration of the solar system, showing the planets orbiting the sun.\n- Relation: Time and movement.\n- Explanation: Both images deal with the concept of time and movement. The clock in the first image represents time in a literal sense, while the solar system in the second image represents the passage of time on a much larger cosmic scale.",
    "Five Hundred Miles(invisible, number, relation, NA, English)": "- First image: Vintage train ticket\n- Second image: Acoustic guitar\n- Relation: Travel and music\n- Explanation: Both images represent means of creating journeys or experiences. The vintage train ticket suggests a physical journey by rail, while the acoustic guitar is associated with musical journeys or performances. Both objects are likely to evoke a sense of nostalgia and appreciation for classic experiences.",
    "12-Bar Blues(invisible, number, relation, NA, English)": "- First image: Cartoon of eggs in a tray\n- Second image: A man playing guitar on stage\n- Relation: Energy\n- Explanation: The first image portrays inanimate objects, while the second image captures a dynamic scene full of energy. The energy in the second image could be metaphorically connected to the potential energy of the eggs in the first image, awaiting activation or transformation.",
    "Chance(invisible, number, metaphor, NA, English)": "- First image: Divided circle graph\n- Second image: Hand catching coins\n- Relation: Coincidence\n- Explanation: The first image features a circle graph divided into two equal parts, representing a 50/50 split. The second image shows a hand reaching out to catch three coins. Although the two images appear to be unrelated in terms of their primary subjects, both involve the concept of division and distribution, with the first image depicting equal division and the second image suggesting the distribution of coins.",
    "One Thousand and One Nights(invisible, number, metaphor, East Asia, English)": "- First image: Binary code on a textured surface.\n- Second image: A person reading a book.\n- Relation: Digital literacy.\n- Explanation: The first image represents the binary code, which is the foundation of digital information, while the second image shows a person reading, a fundamental skill for understanding and interpreting digital content. Both images are related to the theme of acquiring knowledge, whether it’s through digital means or traditional reading.",
    "Cold War(invisible, history, relation, NA, English)": "- First image: A memorial ceremony in an urban setting with uniformed personnel and flags.\n- Second image: A military scene showing soldiers and civilians in a conflict zone, captured in black and white.\n- Relation: Military context and presence of uniformed personnel.\n- Explanation: Both images share a military theme, with the first image depicting a ceremonial aspect and the second image showing a more active, conflict-related scenario. The presence of uniformed personnel in both highlights the military context.",
    "Ancient Rome(invisible, history, relation, other, English)": "- First image: Ancient ruins\n- Second image: Calendar\n- Relation: Time\n- Explanation: The first image shows ancient ruins, which are remnants of the past, while the second image is a calendar, which represents the passing of time. Both images, though different in content, are connected through the concept of time, with the ruins being historical and the calendar marking days and months in the present.",
    "World War II(invisible, history, metaphor, NA, English)": "- First image: A bulldog standing on a grassy field.\n- Second image: A black-and-white photograph depicting a war scene with smoke and ruins.\n- Relation: Anticipation of conflict.\n- Explanation: The first image shows a bulldog, often associated with strength and determination, which could symbolize the anticipation of conflict. The second image depicts a war scene, which is an actual manifestation of conflict. The bulldog's stance and expression may reflect a readiness or preparedness for the chaos and destruction shown in the war scene.",
    "The Renaissance(invisible, history, metaphor, Non-English European, English)": "- First image: The Louvre Museum in Paris, France.\n- Second image: The Mona Lisa, a painting by Leonardo da Vinci, displayed at the Louvre Museum.\n- Relation: Museum Exhibit.\n- Explanation: The two images are related as the first image depicts the museum where the painting in the second image is exhibited. The Mona Lisa is one of the most famous artworks housed within the Louvre Museum, making the connection between the two images quite direct. Both images represent significant cultural and artistic landmarks.",
    "The Information Age(invisible, history, mutual elements, NA, English)": "- First image: A vintage 3.5-inch floppy disk labeled \"AOL Online for Windows.\"\n- Second image: A stylized graphic of an email address, \"@yourcompany.com\" with an arrow pointing to it.\n- Relation: Technology evolution.\n- Explanation: Both images are related to technology and communication. The first image represents an old form of storing and accessing data, specifically for an early internet service provider (AOL) during the era when floppy disks were commonly used for data storage and software distribution. The second image symbolizes modern digital communication, emphasizing the shift from physical media to digital information exchange via email. This evolution highlights the advancements in how we store, access, and share information.",
    "The Age of Enlightenment(invisible, history, relation, NA, English)": "- First image: Astronomical satellite in space\n- Second image: Book cover of \"Cosmos\" by Carl Sagan\n- Relation: Space exploration\n- Explanation: Both images are related to space exploration. The first image depicts an actual satellite designed for astronomical studies, while the second image is the cover of a book that explores the cosmos and the wonders of space, written by the renowned astronomer Carl Sagan. The book and the satellite both represent humanity's quest to understand and explore the universe.",
    "The Victorian Era(invisible, history, relation, Non-English European, English)": "- First image: A walking stick and top hat placed side by side\n- Second image: A steam locomotive moving on the tracks\n- Relation: Transportation\n- Explanation: Both images relate to the theme of transportation, although in different contexts. The walking stick and top hat are items associated with a formal and traditional mode of personal travel, while the steam locomotive represents a historical mode of mass transportation. Both items are symbols of movement and progress, albeit on different scales and in different times.",
    "The Roaring Twenties(invisible, history, relation, USAEnglish, English)": "- First image: A woman in a 1920s flapper dress\n- Second image: A black vintage car\n- Relation: Vintage elegance\n- Explanation: Both images reflect the elegance and style of a bygone era. The woman's attire and the car's design are indicative of the early 20th century. They both showcase a sense of sophistication and a connection to the past, highlighting the beauty of vintage fashion and automobiles.",
    "Neil Armstrong's Footprint on the Moon(invisible, history, relation, USAEnglish, English)": "- First image: Footprint in sand\n- Second image: Lunar surface\n- Relation: Footprints\n- Explanation: Both images feature footprints as a common element. The first image shows a single footprint in sand on Earth, while the second image displays the moon's surface, which is also marked by footprints left by astronauts during space missions. The connection between the two images lies in the universal theme of human presence and exploration, symbolized by the footprints on both familiar and extraterrestrial terrains.",
    "The Silk Road(invisible, history, metaphor, East Asia, English)": "- First image: Map of ancient trade routes\n- Second image: Colorful array of spices\n- Relation: Trade\n- Explanation: The first image represents the historical trade routes that connected different parts of the world, facilitating the exchange of goods, cultures, and technologies. The second image displays a collection of spices, which were significant commodities in the trade routes depicted in the first image. Both images are related through the concept of trade, as spices were one of the main items traded along these ancient routes, influencing culinary practices and cultural exchanges across continents.",
    "The Reformation(invisible, history, metaphor, Non-English European, English)": "- First image: A monk hammering a piece of paper on a wooden surface.\n- Second image: A woman operating a printing press.\n- Relation: Printing and dissemination of knowledge.\n- Explanation: Both images depict individuals involved in the process of spreading knowledge. The monk in the first image could be creating or preserving manuscripts, while the woman in the second image is using a printing press to mass-produce printed materials. This highlights the transition from handwritten manuscripts to printed materials, signifying an important development in the spread of knowledge.",
    "Hollywood Golden Age(visible, movie, relation, USAEnglish, English)": "- First image: Vintage film strip frame\n- Second image: Black and white film scene featuring a character\n- Relation: Nostalgia\n- Explanation: The first image represents a bygone era of film technology, while the second image captures a moment in a classic film, evoking a sense of nostalgia for the golden age of cinema. Both images are in black and white, further highlighting their connection to the past and the timeless nature of film as an art form.",
    "Titanic(visible, movie, metaphor, USAEnglish, English)": "- First image: Iceberg with Hidden Depths\n- Second image: Wedding RSVP Ticket\n- Relation: Hidden Details\n- Explanation: The first image showcases an iceberg with a significant portion of its mass submerged beneath the water's surface, symbolizing hidden details or information. The second image is a stylized wedding RSVP ticket, featuring intricate design elements and detailed information about the event. While the two images differ in context, they both highlight the theme of hidden details, whether it's the unseen portion of an iceberg or the underlying details of a wedding invitation.",
    "Horror(visible, movie, mutual elements, NA, English)": "- First image: A man with a mask and a large knife.\n- Second image: A promotional poster for the Texas Chainsaw Massacre movie.\n- Relation: horror\n- Explanation: The first image depicts a character that could be from a horror movie, while the second image is a movie poster for a well-known horror film.",
    "Bollywood(visible, movie, metaphor, USAEnglish, English)": "- First image: Parade drums\n- Second image: Parade route map\n- Relation: Event celebration\n- Explanation: The first image shows drums that are typically used in a parade, while the second image depicts a map of a parade route for an event, suggesting a connection in the context of a celebratory event or festival. Both images are related to the theme of parades and might be used in the context of the same event, where music and route planning play essential roles.",
    "cinema(invisible, movie, mutual elements, NA, English)": "- First image: Popcorn\n- Second image: 3D glasses\n- Relation: Entertainment\n- Explanation: Both images are related to the entertainment industry. Popcorn is commonly associated with movie theaters and watching films, while 3D glasses are used to view movies in three dimensions, enhancing the cinematic experience.",
    "Frozen(visible, movie, relation, USAEnglish, English)": "- First image: Snowman\n- Second image: Ice castle\n- Relation: Winter theme\n- Explanation: Both images share a winter theme, with the snowman representing a playful aspect of winter and the ice castle representing a magical and grand aspect. Both are made of ice, highlighting the beauty and fun of winter.",
    "Making movie(invisible, movie, mutual elements, NA, English)": "- First image: Film and music interconnection\n- Second image: Film director's chair\n- Relation: Cinematic symbolism\n- Explanation: The first image represents the combination of film and music through the depiction of a film reel intertwined with a treble clef, symbolizing the relationship between visual and audio elements in cinema. The second image shows a director's chair with the name \"Noemi Dean\" and the word \"Director\", representing a professional in the film industry. The relation between the two images lies in their cinematic symbolism, as the director's chair is a common prop in movie sets and the film reel and treble clef in the first image represent key elements in film and music production.",
    "Jurassic Park(invisible, movie, relation, USAEnglish, English)": "- First image: Dinosaur skeleton exhibit\n- Second image: Theme park entrance\n- Relation: Prehistoric theme\n- Explanation: The first image showcases a dinosaur skeleton, representing prehistoric life, while the second image depicts the entrance to Lost Island Theme Park, which may have exhibits or attractions related to prehistoric times, creating a thematic connection between the two images.",
    "Studio Ghibli and anime(invisible, movie, metaphor, East Asia, English)": "- First image: An animated poster featuring a girl holding an umbrella and a large creature in a whimsical, fantastical setting\n- Second image: A digitally illustrated character that resembles a futuristic, armored humanoid standing in a dystopian landscape with flames and aircraft overhead\n- Relation: Fantasy and Creatures\n- Explanation: Both images share elements of fantasy with the presence of unique creatures or characters that are not found in reality. The first image depicts a whimsical and magical creature alongside a young girl, while the second image features a futuristic humanoid in a dystopian setting. Despite the different themes, both images involve a sense of fantasy and imagination.",
    "Cannes Film Festival and Cinéma vérité(invisible, movie, metaphor, Non-English European, English)": "- First image: Red carpet event\n- Second image: Digital camcorder\n- Relation: Event documentation\n- Explanation: The red carpet event symbolizes a formal occasion, while the digital camcorder represents a tool for capturing and recording moments. The connection between the two is that the camcorder could be used to document the event occurring on the red carpet, such as a movie premiere or an awards show.",
    "Film Post-Production(visible, movie, mutual elements, NA, English)": "- First image: [Dolby Surround logo]\n- Second image: [Digital audio workstation interface]\n- Relation: [Audio technology]\n- Explanation: The first image is the logo of Dolby Surround, a well-known audio technology that enhances the sound quality of movies and television. The second image is a close-up of a digital audio workstation interface, a tool commonly used in modern music production and audio editing. Both images are related to audio technology and its applications in entertainment and music production.",
    "Japanese cartoon(invisible, cartoon or game, mutual elements, East Asia, English)": "- First image: A animated character emitting an energy beam from its mouth.\n- Second image: A character holding a magical wand with a moon-shaped top, surrounded by stars.\n- Relation: Both images feature characters from popular animated series, showcasing their abilities or powers.\n- Explanation: The first image shows a character from the Pokémon series, specifically Pikachu, using its signature move, Thunderbolt. The second image depicts Sailor Moon from the Sailor Moon series, holding her magical wand, which is a symbol of her power. Both images represent iconic moments from their respective series, highlighting the unique abilities of the characters.",
    "Mickey Mouse(invisible, cartoon or game, metaphor, USAEnglish, English)": "- First image: Gloves\n- Second image: African wild dog\n- Relation: Protective covering\n- Explanation: The first image shows gloves, which are often used as a protective covering for hands. Similarly, the second image shows an African wild dog, which has protective covering in the form of its fur. Both gloves and fur serve as a means of protection against the environment, whether it be from cold weather or potential harm.",
    "Video Games(invisible, cartoon or game, mutual elements, NA, English)": "- First image: Retro video game console\n- Second image: 3D rendered knight in armor\n- Relation: Gaming and medieval theme\n- Explanation: Both images relate to gaming and medieval themes, albeit in different ways. The first image represents classic gaming with a retro console, while the second image shows a knight that could be a character in a medieval-themed video game. The connection is the shared interest in these eras and themes, though the mediums are different—one being the console and the other being the character in a virtual environment.",
    "Batman(visible, cartoon or game, relation, USAEnglish, English)": "- First image: Batman symbol\n- Second image: Cityscape at night\n- Relation: Gotham City\n- Explanation: The first image features the iconic Batman symbol, which is associated with the superhero Batman. The second image shows a cityscape at night, depicting a dark and gloomy urban environment. The relation between the two images lies in the fact that the cityscape in the second image represents Gotham City, Batman's place of operation and the setting for many of his stories.",
    "Mario(invisible, cartoon or game, relation, East Asia, English)": "- First image: Cartoon mushroom\n- Second image: Cartoon dragon/turtle\n- Relation: Videogames\n- Explanation: Both images depict characters from popular video games. The red mushroom is the recognizable character from the Mario franchise, while the yellow dragon/turtle is Bowser, the main antagonist of the same series. Both characters are iconic and have become synonymous with the gaming industry.",
    "anime(invisible, cartoon or game, metaphor, East Asia, English)": "- First image: Anime-style eyes\n- Second image: Katana swords\n- Relation: Contrast\n- Explanation: The first image features large, expressive eyes characteristic of anime or manga art, emphasizing emotion and detail. The second image displays traditional Japanese swords, known for their craftsmanship and historical significance. The relation lies in the contrast between the abstract, emotive art of the anime eyes and the tangible, functional nature of the katana swords. This juxtaposition highlights the diversity in artistic expression and cultural heritage.",
    "Controller(invisible, cartoon or game, metaphor, NA, English)": "- First image: Retro gaming controller\n- Second image: Modern gaming joystick\n- Relation: Gaming peripherals\n- Explanation: Both images depict gaming controllers used for playing video games. The first image shows a classic, retro gaming controller with a simple design and limited buttons, while the second image displays a more modern joystick with a single red button and joystick. Despite their differences, both controllers are used for gaming purposes and share a common theme of gaming peripherals.",
    "Multiplayer(invisible, cartoon or game, mutual elements, NA, English)": "- First image: Colorful video game controllers.\n- Second image: Screenshot from a racing video game.\n- Relation: Gaming.\n- Explanation: Both images are related to video gaming. The first image shows various game controllers, indicating the means through which players interact with games. The second image displays a scene from a racing game, showcasing the type of digital content that players can enjoy using such controllers. The common theme of video gaming connects these two images, highlighting the gaming experience for players.",
    "Role-Play Game(RPG)(invisible, cartoon or game, metaphor, NA, English)": "- First image: Polyhedral dice.\n- Second image: Character sheet from a role-playing game.\n- Relation: Gaming.\n- Explanation: Both images are associated with role-playing games. The first image shows a common dice used for rolling random numbers in RPGs, while the second image is a character sheet for a player character in an RPG, where players track various stats and abilities.",
    "Stardew Valley(invisible, cartoon or game, relation, NA, English)": "- First Image: A tool called \"Fiberglass Rod\" is used to catch fish in the water.\n- Second Image: A list of food items and a farm scene, suggesting a survival game.\n- Relation: Farming and survival.\n- Explanation: The first image depicts a tool used for fishing, an essential skill in survival games, which is also hinted at by the second image showing food items and farming activities, both crucial for survival in the game.",
    "World-building game(invisible, cartoon or game, mutual elements, NA, English)": "- First image: Detailed topographical map\n- Second image: Digital game map interface\n- Relation: Geographical representation\n- Explanation: Both images depict maps, but with different purposes. The first image is a realistic, artistic representation of a terrain, focusing on elevation and natural features. The second image is a digital interface from a game, highlighting areas of interest and providing interaction elements for the player.",
    "Beethoven(invisible, music, relation, Non-English European, English)": "- First image: [Musician playing a trumpet]\n- Second image: [Sheet music for string quartet]\n- Relation: [Musical performance]\n- Explanation: The first image depicts a musician playing a trumpet, while the second image shows a sheet music for a string quartet. Both images are related to musical performance, as the first image represents a live performance and the second image represents the musical score that could be used in a similar live performance.",
    "Rock Music(invisible, music, mutual elements, NA, English)": "- First image: Guitar with sound waves\n- Second image: Concert crowd raising hands\n- Relation: Music and performance\n- Explanation: The first image features a guitar with sound waves emanating from it, symbolizing music. The second image depicts a concert crowd raising their hands, indicative of a live music performance. Both images are connected by the theme of music and performance, with the guitar representing the creation of music and the crowd representing the experience of music.",
    "Hip hop music(invisible, music, metaphor, NA, English)": "- First image: Turntable\n- Second image: Microphone\n- Relation: Music\n- Explanation: Both images are related to music. The turntable is used to play vinyl records, while the microphone is used to capture sound. They both play crucial roles in the production and consumption of music.",
    "Grand Piano(invisible, music, relation, NA, English)": "- First image: Symphony orchestra in a concert hall\n- Second image: Digital piano\n- Relation: Musical performance\n- Explanation: The first image depicts a large ensemble of musicians performing together in a concert hall, suggesting a classical or orchestral music setting. The second image shows a digital piano, which is a modern musical instrument commonly used for both practice and performances. The relation between the two images is their connection to musical performance, as the digital piano could be used by individual musicians as part of the larger orchestra depicted in the first image.",
    "String and Spectrum(invisible, music, relation, NA, English)": "- First image: Violin bridge and strings.\n- Second image: Colorful rainbow gradient.\n- Relation: Vibration and harmony.\n- Explanation: The violin bridge and strings are essential for creating sound and maintaining harmony in music, while the colorful rainbow gradient could symbolize the vibrancy and diversity of musical expression. Both images represent aspects of creativity and art, with the violin bridge being a tool for producing music and the rainbow gradient representing the spectrum of emotions that music can evoke.",
    "Trumpet(invisible, music, meatphor, NA, English)": "- First image: Mechanical component\n- Second image: Array of metallic tubes\n- Relation: Industrial materials\n- Explanation: Both images depict components commonly used in industrial applications. The first image shows a valve, a device used to control the flow of fluids in piping and plumbing systems, while the second image displays an arrangement of metallic tubes, which could be used as parts of a piping system or as structural elements in various industrial settings. The shared theme between the two images is their use in industrial contexts and their metallic construction.",
    "Rock Music and Electric Instruments(invisible, music, relation, NA, English)": "- First image: A towering sea cliff with a plateau on top, surrounded by ocean waves under a clear blue sky.\n- Second image: A colorful, vibrant electric guitar with a rainbow gradient design, featuring a detailed fretboard and multiple control knobs.\n- Relation: Both images display vibrant colors and a sense of natural or artistic creativity, though one is a natural landscape and the other is a man-made musical instrument.\n- Explanation: The cliff's varied hues of blue and green contrast with the white waves, creating a visually striking scene. The guitar, with its spectrum of colors and dynamic shape, mirrors this vibrancy. While they belong to different realms—nature and human artistry—both images evoke creativity and visual appeal.",
    "K-pop(invisible, music, mutual elements, East Asia, English)": "- First image: Neon lights\n- Second image: Dance performance\n- Relation: Colorful energy\n- Explanation: The first image depicts vibrant, colorful neon lights, which evoke a sense of lively and dynamic energy. The second image shows a dance performance with dancers in a dynamic pose, which also conveys a sense of energy and movement. Both images, although different in context—one being static lights and the other dynamic human movement—share the theme of vibrant, lively energy.",
    "Tango(invisible, music, metaphor, USAEnglish, English)": "- First image: Rose\n- Second image: Couple embrace\n- Relation: Love\n- Explanation: The first image features a rose, often associated with love and romance, while the second image depicts a couple embracing, a common symbol of love and affection. Both images convey the theme of love, with the rose possibly being a gift from one partner to another.",
    "El Niño(invisible, phenomenon, relation, NA, English)": "- First image: Surfboards lined up on a beach\n- Second image: Heat map of global ocean temperatures\n- Relation: Beach and water\n- Explanation: The first image shows surfboards lined up on a beach, while the second image displays a heat map of global ocean temperatures. Both images involve the beach and water as central elements, with the first image capturing a physical location for surfing and the second image illustrating the temperature variations in global oceans.",
    "Nuclear Fission(invisible, phenomenon, mutual elements, NA, English)": "- First image: Nuclear explosion\n- Second image: Nuclear chain reaction\n- Relation: Explosive energy\n- Explanation: The first image depicts the dramatic and destructive visual effects of a nuclear explosion, characterized by a mushroom cloud. The second image outlines the concept of a nuclear chain reaction, detailing how neutrons collide with atomic nuclei to generate successive generations of reactions, culminating in a rapid release of energy. The relation between the two images lies in the explosive energy produced by the nuclear chain reaction, which is visually represented by the nuclear explosion.",
    "Ocean Tides(invisible, phenomenon, relation, NA, English)": "- First image: A sinusoidal graph depicting stock prices.\n- Second image: An artistic representation of a clock with interlocking gears.\n- Relation: Time and motion.\n- Explanation: Both images relate to the concept of time, with the first image showing the fluctuation of stock prices over time and the second image representing a traditional clock that measures time. The sinusoidal pattern in the graph also suggests a sense of motion, akin to the movement of gears in the clock.",
    "Glacier Melting(invisible, phenomenon, relation, NA, English)": "- First image: Glacier thawing into a sea\n- Second image: Water bottle with blue liquid\n- Relation: Water theme\n- Explanation: Both images have water as their central theme. The first image shows a glacier, which is a large body of ice, melting into the sea, while the second image depicts a water bottle, which contains liquid water. Although the forms of water are different—solid in the glacier and liquid in the bottle—they both represent the essential element of water.",
    "Superconductivity(invisible, phenomenon, mutual elements, NA, English)": "- First image: Levitating object\n- Second image: Thermometer\n- Relation: Technology and precision\n- Explanation: The first image represents a levitating object, showcasing advanced technology and precision in its design and functionality. The second image is a thermometer that measures temperature with precision, indicating a connection in terms of the theme of precision and advanced technology. Both images symbolize the importance of precision and innovation in their respective fields.",
    "Hurricane(invisible, phenomenon, metaphor, NA, English)": "- First image: Hurricane from space\n- Second image: Disaster preparedness kit\n- Relation: Emergency response\n- Explanation: The first image shows a satellite view of a hurricane, an extreme weather event that can cause significant damage. The second image depicts a collection of items typically included in a disaster preparedness kit, which people use to stay safe and organized during emergencies like hurricanes. Both images are related to the theme of emergency response and preparedness for natural disasters.",
    "Halo Effect(invisible, phenomenon, relation, NA, English)": "- First image: Ring Symbolism\n- Second image: Interpersonal Communication\n- Relation: Dialogue and Exchange\n- Explanation: The first image features a ring, often symbolizing commitment, connection, or exchange. The second image depicts two individuals engaging in an interaction, highlighting the theme of communication and exchange. Both images suggest elements of connection and interaction, whether through the symbolic representation of a ring or through direct human communication.",
    "Reality TV(invisible, phenomenon, mutual elements, NA, English)": "- First image: A woman with a neutral expression, possibly in a professional or candid portrait setting.\n- Second image: A dramatic scene showing a man and a woman yelling at each other, suggesting a conflict or disagreement.\n- Relation: Emotional intensity.\n- Explanation: The first image portrays a calm and composed emotional state, while the second image depicts a highly intense and emotional confrontation. Both images deal with human emotions, but they present vastly different scenarios—one calm and neutral, the other charged and confrontational.",
    "Podcast Boom(invisible, phenomenon, metaphor, NA, English)": "- First image: Headset for professional or gaming use.\n- Second image: Graph showing a positive trend.\n- Relation: Progress.\n- Explanation: The headset in the first image could symbolize communication and connectivity, while the graph in the second image represents progress and analysis. Both images could be related to the idea of improvement or development in different contexts, whether it be in work, gaming, or data analysis.",
    "The Space Race(invisible, phenomenon, relation, NA, English)": "- First image: Soviet Union flag\n- Second image: Space launch\n- Relation: Soviet space program\n- Explanation: The Soviet Union flag is associated with the era of the Soviet Union, which was known for its significant contributions to the space program, including launching the first human, Yuri Gagarin, into space. The space launch image likely represents a mission from the Soviet era, reflecting the country's achievements in space exploration during its time.",
    "Cognitive Dissonance(invisible, phenomenon, metaphor, NA, English)": "- First image: Human brain illustration\n- Second image: Smoking advertisement with health warning\n- Relation: Health impacts\n- Explanation: The first image symbolizes the complexity and functionality of the human brain, while the second image highlights the negative health effects of smoking, particularly addiction. While they appear different at first glance, both images are related to health and the human body, with the brain being affected by poor lifestyle choices like smoking.",
    "The Gold Rush(invisible, phenomenon, metaphor, USAEnglish, English)": "- First image: A gold panning bucket with water and gold flakes\n- Second image: A historical photograph of a wagon train\n- Relation: Gold rush\n- Explanation: Both images are related to the gold rush era. The first image depicts a gold panning bucket with water and gold flakes, which is a common method used during the gold rush to search for gold. The second image shows a historical photograph of a wagon train, which was a common mode of transportation for people moving west during the gold rush period to search for gold. Both images represent different aspects of the gold rush experience.",
    "Le Petit Prince(invisible, art, relation, Latin American, French)": "- First image: Baobab tree\n- Second image: Red fox in snow\n- Relation: Natural habitat\n- Explanation: The first image features a baobab tree, a species known to thrive in certain regions of Africa and Madagascar. The second image shows a red fox standing in snow, a species that can be found in various parts of the world, including Europe and North America. Although the baobab tree and the red fox are different species and live in different environments, they both represent the diverse range of flora and fauna found in nature. The common theme between the two images is the natural habitat in which these species thrive.",
    "Victor Hugo(invisible, art, relation, Latin American, French)": "- First image: Lighthouse\n- Second image: Quill and Ink\n- Relation: Guidance and Communication\n- Explanation: The first image represents a lighthouse, a structure designed to guide and assist ships in navigating safely, while the second image features a quill and ink, tools used for writing and communicating. Both images symbolize guidance; the lighthouse guides ships, and the quill and ink guide words and thoughts. Additionally, both images convey a sense of history and tradition, as lighthouses and quills have been used for centuries in their respective roles.",
    "Les Misérables(invisible, art, relation, Latin American, French)": "- First image: [Candlestick chart]\n- Second image: [Riot scene]\n- Relation: [Turbulence]\n- Explanation: The first image shows a series of green and red candlesticks, suggesting a volatile stock market. The second image depicts a riot with police and protesters, representing social unrest. The common theme between the two images is turbulence, as both situations involve a degree of chaos and unpredictability. The stock market's volatile nature can be compared to the tumultuous atmosphere of a riot.",
    "Madame Bovary(invisible, art, relation, Latin American, French)": "- First image: Green apple\n- Second image: Medicine shelf\n- Relation: Health and wellness\n- Explanation: Both images are related to health and wellness. The green apple is a symbol of natural health and nutrition, while the medicine shelf represents pharmaceutical treatments and healthcare. Though they come from different angles of health, they both contribute to the overall theme of promoting well-being.",
    "Les Fleurs du mal(invisible, art, relation, Latin American, French)": "- First image: Dried rose\n- Second image: Clock face\n- Relation: Temporal decay\n- Explanation: The dried rose represents physical decay over time, while the clock face symbolizes the passage of time itself. Both images evoke themes of change and the inevitable progression from a state of being to a state of becoming. The dried rose, once vibrant and full of life, now shriveled and brown, mirrors the clock's relentless ticking towards an unalterable future.",
    "Germinal(invisible, art, relation, Latin American, French)": "- First image: Industrial landscape after mining\n- Second image: Hands holding a small plant in soil\n- Relation: Reclamation\n- Explanation: The first image depicts an industrial landscape, likely a coal mine, showing the aftermath of mining activities with a vast expanse of mined land. The second image shows hands holding a small plant in soil, symbolizing the beginning of a reclamation process where nature starts to reclaim the once-mined land. The common theme between the two images is the transformation of the land, from being mined and barren to being rehabilitated and revitalized with new growth.",
    "La Peste(invisible, art, relation, Latin American, French)": "- First image: A mysterious figure in a black cloak and bird-like mask standing in a dark, eerie forest with jack-o'-lanterns.\n- Second image: The cover of a book titled \"The Stranger\" by Jacques Ferrandez, featuring a man walking on a beach with a distant, thoughtful expression.\n- Relation: Enigma\n- Explanation: Both images suggest the concept of mystery. The first image's dark, eerie setting and the figure's mysterious appearance evoke a sense of the unknown. The second image, with its title \"The Stranger\" and the man's contemplative walk along the beach, also hints at themes of mystery and uncertainty. Both images play on the intrigue and curiosity that come with encountering the mysterious and unknown.",
    "Chercher la petite bête(invisible, art, relation, Latin American, French)": "- First image: Magnifying glass revealing a leaf beetle on a leaf.\n- Second image: A cartoon character holding a checklist, surrounded by various business and financial icons.\n- Relation: Detailed observation.\n- Explanation: Both images involve the theme of detailed observation. The first image shows the use of a magnifying glass to observe a leaf beetle closely, while the second image symbolizes a detailed review or analysis of tasks or finances, represented by the character holding a checklist and surrounded by related icons.",
    "Raconter des salades(invisible, art, relation, Latin American, French)": "- First image: Healthy meal\n- Second image: Cartoon character\n- Relation: Nutrition and education\n- Explanation: The first image features a nutritious salad, while the second image displays a cartoon character holding a microphone. The relation between the two images is the concept of education and awareness about healthy eating habits. The cartoon character could be a part of an educational campaign or program focused on teaching people about the importance of nutrition, using the salad as an example of a healthy meal.",
    "Avoir un coup de foudre(invisible, art, relation, Latin American, French)": "- First image: Lightning bolt symbol\n- Second image: Heart-shaped padlock\n- Relation: Symbolism\n- Explanation: Both images feature objects that are rich in symbolic meaning. The lightning bolt can represent strength, speed, and electricity, while the heart-shaped padlock symbolizes love and security. The connection between the two images lies in their ability to convey powerful ideas and emotions, even though they appear to be unrelated at first glance.",
    "Don Quijote de la Mancha(invisible, art, relation, Latin American, Spanish)": "- First image: Wind turbines in a field\n- Second image: Full suit of medieval armor\n- Relation: Renewable energy and historical technology\n- Explanation: Both images depict human innovations aimed at harnessing natural forces. The wind turbines are modern technology designed to convert wind energy into electricity, representing contemporary renewable energy efforts. In contrast, the medieval armor represents historical technological advancements in personal protection, showcasing the ingenuity of past civilizations. While the contexts and purposes differ, both images highlight humanity's ongoing quest to utilize and adapt to the natural environment.",
    "Cien años de soledad(invisible, art, relation, Latin American, Spanish)": "- First image: A picturesque cottage in a forest\n- Second image: A family tree chart\n- Relation: Home and Family\n- Explanation: The first image represents a physical home or dwelling place in a serene and natural setting, while the second image symbolizes a familial home or lineage, illustrating the connections and relationships within a family. Both images convey the concept of 'home', whether it be a physical structure or a familial network.",
    "La Casa de los Espíritus(invisible, art, relation, Latin American, Spanish)": "- First image: Haunted Mansion movie poster.\n- Second image: Tarot card set against a stone background.\n- Relation: Mysterious and Enigmatic.\n- Explanation: Both images have a mysterious and enigmatic vibe. The first image with its dark, eerie feel and the title \"Haunted Mansion\" suggests a storyline filled with suspense and intrigue. The second image, featuring a tarot card with a prominent eye and hand symbol, also evokes a sense of mystery and hidden meanings. The use of dark colors and intricate designs in both images enhances their mysterious appeal.",
    "El amor en los tiempos del cólera(invisible, art, relation, Latin American, Spanish)": "- First image: Abandoned letter\n- Second image: Microscopic organisms\n- Relation: Contrast of scales\n- Explanation: The first image depicts an abandoned letter, which represents human communication and possibly forgotten stories. The second image showcases microscopic organisms, highlighting the unseen and minuscule aspects of life. The contrast of scales between the human-made letter and the natural microorganisms may suggest a juxtaposition of human activities and natural processes.",
    "La sombra del viento(invisible, art, relation, Latin American, Spanish)": "- First image: Old and weathered book on a wooden surface.\n- Second image: A well-maintained labyrinth garden with colorful flowers.\n- Relation: Contrast between old and new, nature vs. man-made objects.\n- Explanation: The first image evokes a sense of history and the passage of time through the aged book, while the second image represents contemporary human creativity and the beauty of nature in a structured form. Both images showcase the beauty of different elements, one through literary history and the other through horticultural artistry.",
    "Pedro Páramo(invisible, art, relation, Latin American, Spanish)": "- First image: A spectral figure in a dark scene.\n- Second image: A deserted western town under a clear sky.\n- Relation: Contrast of life and desolation.\n- Explanation: The first image portrays a ghostly figure, symbolizing the presence of something that once was or the lingering memory of life. The second image depicts an abandoned western town, evoking a sense of desolation and the absence of life. The relation between the two images lies in the contrast between the presence of a spectral entity versus the absence of life in a deserted town. Both images touch upon themes of memory, presence, and absence, with the spectral figure hinting at life's past presence and the empty town representing the void left behind.",
    "¡Es un pez gordo(invisible, art, relation, Latin American, Spanish)": "- First image: Two men posing with a giant fish.\n- Second image: A towering modern skyscraper.\n- Relation: Scale and grandeur.\n- Explanation: Both images depict something that is large and impressive; the first image shows a gigantic fish, and the second image shows a tall, modern skyscraper. The theme of scale and the awe-inspiring nature of both objects connect the two images, highlighting human accomplishments in different fields.",
    "Dar en el clavo(invisible, art, relation, Latin American, Spanish)": "- First image: Carpentry and craftsmanship\n- Second image: Precision and accuracy\n- Relation: Focus and attention to detail\n- Explanation: Both images represent activities that require a high level of focus and precision. In the first image, a person is carefully placing a nail and preparing to hit it with a hammer, demanding precision in their actions. Similarly, the second image shows multiple arrows hitting the bullseye on a target, which requires a high degree of accuracy and skill. The shared theme is the importance of focus and attention to detail in achieving a successful outcome.",
    "Echar leña al fuego(invisible, art, relation, Latin American, Spanish)": "- First image: Stacked firewood\n- Second image: Office meeting\n- Relation: Teamwork\n- Explanation: Both images depict a sense of structured arrangement and collaboration. The first image shows firewood meticulously stacked, representing order and preparation. Similarly, the second image portrays a group of individuals engaged in a meeting, focusing on communication and teamwork to achieve a common goal. Both scenarios emphasize the importance of organization and collective effort in achieving success.",
    "Pedir peras al olmo(invisible, art, relation, Latin American, Spanish)": "- First image: Tall, solitary tree in a field\n- Second image: Wicker basket\n- Relation: Natural materials\n- Explanation: Both images feature objects made from natural materials. The tree is a living organism, while the basket is crafted from woven plant fibers. Despite their different forms and purposes, both the tree and the basket are products of nature, highlighting themes of natural beauty and craftsmanship.",
    "Faust(invisible, art, relation, Latin American, German)": "- First image: Red apple\n- Second image: Analog clock\n- Relation: Time and freshness\n- Explanation: The connection between the images could be interpreted as the concept of time and freshness. The apple, representing freshness and vitality, could symbolize the idea of time that is 'clocked' or measured by the hands of the clock. This relationship emphasizes the importance of valuing each moment, as time is as precious as the freshness of the apple.",
    "Der Prozess(invisible, art, relation, Latin American, German)": "- First image: Labyrinth garden design\n- Second image: Vintage typewriter\n- Relation: Complex structure\n- Explanation: Both images feature complex structures. The labyrinth garden design presents a maze-like pattern created from concentric circles and pathways, inviting exploration and discovery. Similarly, a vintage typewriter contains intricate mechanical components that work together to produce written communication. While they serve different purposes—one is for leisure and the other for work—they share a common theme of intricate design and functionality.",
    "Die Verwandlung(invisible, art, relation, Latin American, German)": "- First image: Ladybug on a plant\n- Second image: Broken clock\n- Relation: Temporal themes\n- Explanation: Both the ladybug and the broken clock can be related to the concept of time. The ladybug, often a symbol of patience and good luck, can suggest the passage of time as it is a common sight throughout different seasons. The broken clock, on the other hand, explicitly represents a disruption or change in time. The connection between the two images could be interpreted as a representation of the contrast between natural, cyclical time and the mechanical, linear concept of time.",
    "Die Räuber(invisible, art, relation, Latin American, German)": "- First image: Confederate flag\n- Second image: Broken glass\n- Relation: Symbolism and history\n- Explanation: The first image, depicting the Confederate flag, is historically associated with the Confederate States of America during the American Civil War. The second image, showing broken glass, could symbolize the shattering of ideologies and the breaking of historical narratives. Both images represent significant periods of American history, one through a symbol of a political entity and the other through a metaphor for the fragmentation of historical perspectives.",
    "Der Steppenwolf(invisible, art, relation, Latin American, German)": "- First image: A wolf in a snowy forest setting.\n- Second image: A person wearing a colorful, decorative mask.\n- Relation: Wilderness and freedom.\n- Explanation: Both the wolf and the person in the colorful mask evoke a sense of wilderness and freedom. The wolf, with its natural habitat in the snowy forest, represents a connection to the wild and untamed aspects of nature. The mask, with its vibrant colors and elaborate design, symbolizes personal freedom and the ability to express oneself without constraints. The two images, while different in context, both convey a powerful message of being free and untamed.",
    "Nibelungenlied(invisible, art, relation, Latin American, German)": "- First image: Mythical Dragon\n- Second image: Elephant-headed figure\n- Relation: Symbolism\n- Explanation: Both images feature figures with strong cultural and symbolic significance. The dragon in the first image is often a symbol of power and mystery in various cultures, while the elephant-headed figure in the second image is associated with wisdom and auspiciousness in Hinduism. Both figures are revered in their respective cultures and are often used as symbols of protection and strength.",
    "Ich verstehe nur Bahnhof(invisible, art, relation, Latin American, German)": "- First Image: Language Learning Books\n- Second Image: Jigsaw Puzzle Pieces\n- Relation: Knowledge Building\n- Explanation: The first image illustrates language learning books in a stack, representing different languages one could learn. The second image shows a jigsaw puzzle piece being placed into a larger puzzle. The relation between the two images is the concept of building knowledge and understanding, as learning new languages (as shown in the first image) is much like assembling a puzzle (as shown in the second image) - both require time, effort, and the correct pieces (information or language skills) to create a complete and cohesive understanding.",
    "Die Katze im Sack kaufen(invisible, art, relation, Latin American, German)": "- First image: Packaged Food\n- Second image: Domestic Cat\n- Relation: Cute and Playful\n- Explanation: The first image depicts a packaged food product, representing a commercial product. The second image showcases a domestic cat, which can evoke feelings of cuteness and playfulness. The relation between the two images could be the idea that the packaged food is intended for feeding pets, such as the cat in the second image, thereby connecting the commercial product with the end user.",
    "Hals- und Beinbruch(invisible, art, relation, Latin American, German)": "- First image: Aerial acrobat performance\n- Second image: Horse shoe with \"GOOD LUCK\" inscription\n- Relation: Chance and Risk\n- Explanation: The first image represents a high-risk, high-chance activity as the acrobat performs aerial maneuvers, which require significant skill and trust in the equipment. The second image, a horseshoe with \"GOOD LUCK\" inscribed, symbolizes the wish for fortune and safety, which can be related to the performer's endeavor in the first image. Both images touch on themes of risk and the desire for positive outcomes.",
    "Kopf in den Sand stecken(invisible, art, relation, Latin American, German)": "- First image: An ostrich in a grassy landscape.\n- Second image: A desert landscape with sand dunes.\n- Relation: Natural habitat.\n- Explanation: The first image shows an ostrich, which is native to African savannas, in a grassy, hilly landscape that could be part of its natural habitat. The second image depicts a desert, which is a different type of natural habitat. The relation between the two images lies in the fact that both depict natural environments, even though they are different types of landscapes.",
    "Easter or chocolate bunny(invisible, culture, relation, USAEnglish, English)": "- First image: A cute rabbit in a natural setting.\n- Second image: A bar of milk chocolate with pieces broken off.\n- Relation: Innocence and sweetness.\n- Explanation: Both images evoke a sense of innocence and sweetness. The rabbit, with its soft fur and curious expression, is often associated with these qualities. Similarly, milk chocolate is commonly linked to comfort and pleasure. The shared element is the comforting, gentle nature of both subjects.",
    "Elvis Presley(invisible, music, mutual elements, USAEnglish, English)": "- First image: Suede dress shoe\n- Second image: Microphone with a crown\n- Relation: Symbol of excellence\n- Explanation: Both images symbolize excellence in their respective fields. The first image showcases a high-quality suede dress shoe, representing craftsmanship and style in footwear. The second image features a microphone with a crown, symbolizing royalty or the pinnacle of success in music or public speaking. Both objects imply a certain level of sophistication and top-tier quality.",
    "Forrest Gump's box of chocolates(visible, movie, relation, USAEnglish, English)": "- First image: Assorted chocolates in individual wrappers.\n- Second image: A man sitting on a bench in a park-like setting.\n- Relation: Indulgence\n- Explanation: Both the chocolates and the man's relaxed posture on the bench suggest a theme of indulgence. The chocolates represent indulgence in taste and luxury, while the man's relaxed posture on the bench suggests indulgence in leisure and comfort.",
    "sun(visible, STEM, mutual elements, NA, English)": "- First image: Solar panel array\n- Second image: Sunflower close-up\n- Relation: Sun and energy\n- Explanation: Both images are connected through the theme of energy, with the first image showing a solar panel array capturing sunlight to convert it into electricity, and the second image displaying sunflowers, which are plants that grow towards the sun to maximize their absorption of light for photosynthesis.",
    "Halloween(invisible, culture, mutual elements, USAEnglish, English)": "- First image: Pumpkin\n- Second image: Halloween\n- Relation: Autumn\n- Explanation: The first image features a pumpkin, which is commonly associated with the autumn season. The second image shows children dressed in Halloween costumes, which is an event that typically occurs during the fall season, specifically on October 31st. Both images are linked by the theme of autumn and the activities and traditions associated with it.",
    "Leonardo da Vinci(invisible, people, mutual elements, Non-English European, English)": "- First image: Human Anatomy Illustration\n- Second image: Portrait of a Woman\n- Relation: Humanity\n- Explanation: The first image is a scientific illustration showing the detailed anatomy of the human body, highlighting various muscles, bones, and other anatomical features. The second image is a portrait of a woman, emphasizing the human aspect through art. Both images relate to humanity, with the first focusing on the physical structure of humans and the second highlighting the beauty and expression of a human face.",
    "西游记(visible, art, mutual elements, East Asia, Chinese)": "- First image: A young monkey sitting on a rock with a piece of food in its hand.\n- Second image: A Buddhist monk in an orange robe meditating outside near trees and a brick structure.\n- Relation: Spirituality and Nature\n- Explanation: Both images feature a natural setting with a focus on an individual in a state of contemplation. The young monkey, possibly exploring its surroundings, and the Buddhist monk, practicing meditation, both highlight a connection with nature and an element of spirituality. The peaceful and serene atmosphere in both images suggests a harmony between the subjects and their environments.",
    "To Kill a Mockingbird(visible, art, relation, USAEnglish, English)": "- First image: Elderly woman with short white hair wearing glasses and a black and white houndstooth blazer, smiling against a yellow background.\n- Second image: A small gray bird, possibly a mockingbird, perched on a branch against a blurred green background.\n- Relation: Contrast in themes and subjects; the first image represents human experiences, while the second image represents nature.\n- Explanation: The first image shows an individual at a formal event, which could suggest themes of social interaction, celebration, or formality. The second image depicts a bird in a natural setting, reflecting themes of wildlife, freedom, and the beauty of nature. Although the two images present different subjects and themes, they both capture moments of serene and pleasant expressions.",
    "The Beatles(invisible, music, mutual elements, USAEnglish, English)": "- First image: Close-up of a beetle on a tree bark.\n- Second image: Street scene with people crossing a zebra crossing.\n- Relation: Nature and urban life.\n- Explanation: The first image captures the intricate details of a natural creature in its environment, while the second image shows the hustle and bustle of city life. Despite their differences, both images depict elements of life - one in a natural setting and the other in an urban setting. The contrast between the two images highlights the diversity of life on Earth, from the smallest insects to the largest human populations.",
    "St. Patrick's Day(invisible, culture, mutual elements, USAEnglish, English)": "- First image: Four-leaf clovers\n- Second image: A man in green clothing and a hat\n- Relation: Irish culture\n- Explanation: The first image features four-leaf clovers, which are often associated with Irish culture and are considered a symbol of luck. The second image depicts a man dressed in green attire, reminiscent of traditional Irish clothing, further emphasizing the cultural connection. Both images share a common theme of Irish heritage and traditions, making them related in their representation of cultural symbols.",
    "Guns N' Roses(invisible, music, mutual elements, USAEnglish, English)": "- First image: Semi-automatic handgun with bullets\n- Second image: Three red roses\n- Relation: Contrast of themes\n- Explanation: The first image represents power, aggression, and potential danger with the handgun and bullets, while the second image symbolizes beauty, love, and tranquility with the red roses. The contrast between the two images highlights different aspects of human experience and emotion.",
    "Chicago(invisible, city, mutual elements, USAEnglish, English)": "- First image: Urban skyline\n- Second image: Modern art sculpture\n- Relation: Cityscape\n- Explanation: The first image represents the urban skyline of a city, showcasing its tall buildings and skyscrapers. The second image features a modern art sculpture situated in an urban setting with tall buildings in the background. The common element between the two images is the urban environment, highlighting the blend of architecture and art within the cityscape.",
    "Confucius has 72 disciples(invisible, history, relation, East Asia, English)": "- First image: Book cover\n- Second image: Number \"72\" in a circle\n- Relation: Symbolism\n- Explanation: The first image appears to be a book cover with a traditional Chinese design, suggesting a cultural or philosophical theme. The second image, featuring the number \"72\" in a circle, could symbolize a significant quantity or a philosophical concept, such as the number of principles or elements. The relation between the two images might be found in the exploration of philosophical ideas, with the number \"72\" representing a part of the content or a key concept within the book.",
    "Silk Road(invisible, history, mutual elements, East Asia, English)": "- First image: A group of people riding camels through a desert landscape.\n- Second image: A collection of neatly rolled neckties in various colors and shades.\n- Relation: Both images involve human activity and patterns.\n- Explanation: The first image shows a pattern of people and camels moving in a line across the desert, which is a human-made pattern. The second image displays a pattern of neatly rolled neckties, which is also a human-made arrangement. Both images involve human activity and organization, whether it be the act of riding camels or the act of rolling and arranging neckties.",
    "The Cold War(invisible, history, metaphor, USAEnglish, English)": "- First image: [Graffiti on the Berlin Wall]\n- Second image: [Man in winter weather]\n- Relation: [Cold and isolation]\n- Explanation: Both images evoke feelings of cold and isolation. The first image shows the graffiti-covered Berlin Wall, a symbol of separation and division. The second image features a man in a snowy environment, with his hands over his mouth, suggesting a feeling of cold and possibly isolation. Both images, despite their differences, convey a sense of coldness, both physically and emotionally.",
    "D-Day(invisible, history, mutual elements, USAEnglish, English)": "- First image: [historical military operation]\n- Second image: [artistic letter with camouflage pattern]\n- Relation: [theme of concealment and detection]\n- Explanation: Both images touch on the theme of concealment and detection. The first image depicts soldiers landing on a beach, likely during a historical military operation where concealment from enemies was crucial. The second image features an artistic letter with a camouflage pattern, a design often used in military contexts for concealment purposes. The connection between the images lies in their shared elements of hiding and seeking, protection, and the blending of one element into another (soldiers blending into the beach scene, the letter blending into the camouflage background).",
    "moonlight(invisible, music, relation, NA, English)": "- First image: Moonlit landscape\n- Second image: Portrait of a man\n- Relation: Serene reflection\n- Explanation: The first image depicts a peaceful night scene with a serene body of water reflecting the moonlight, invoking a sense of calm and tranquility. The second image, though a portrait of a man, can be seen as a metaphorical reflection of the intellectual or emotional depth inspired by the serene landscape. Both images, in their different ways, evoke a sense of introspection and quiet contemplation.",
    "E pluribus unum(invisible, culture, metaphor, USAEnglish, Latin)": "- First image: Bundle of sticks\n- Second image: Eagle emblem\n- Relation: Symbolism of strength and unity\n- Explanation: The first image of a bundle of sticks symbolizes unity and strength, often used to represent the idea that many small parts can form a strong whole. The second image of an eagle emblem, typically associated with power and freedom, also conveys a sense of strength and authority. Both images share the theme of representing strength, either through the unity of many parts or the natural power of a powerful bird.",
    "Spinach power-up(invisible, cartoon or game, relation, USAEnglish, English)": "- First image: Spinach can\n- Second image: Muscular arm\n- Relation: Nutrient-rich\n- Explanation: The first image shows a can of spinach, which is a nutrient-dense food. The second image features a muscular arm, which could imply the benefits of consuming nutrient-rich foods like spinach for building muscle. Spinach is a well-known source of vitamins and minerals, including iron and calcium, which are essential for muscle development.",
    "The Pit and the Pendulum(invisible, art, metaphor, USAEnglish, English)": "- First image: Construction pit\n- Second image: Simple harmonic motion\n- Relation: Excavation\n- Explanation: The first image depicts a construction pit, which can be metaphorically related to the concept of excavation in the context of simple harmonic motion, as shown in the second image. Both images involve the action of digging or uncovering something beneath the surface, whether it's physically digging in the ground or illustrating the motion of a pendulum bob moving back and forth in a repetitive cycle, similar to the process of digging.",
    "Siempre imaginé que el Paraíso sería algún tipo de biblioteca(invisible, art, metaphor, USAEnglish, Spanish)": "- First image: ethereal staircase\n- Second image: library\n- Relation: journey of knowledge\n- Explanation: The first image depicts an otherworldly, majestic staircase that leads to a heavenly or mythical scene, symbolizing an upward journey or transcendence. The second image shows a person in a library, which represents a journey of acquiring knowledge. The connection between the two images lies in the theme of journey—whether it's a physical ascent or a metaphorical pursuit of knowledge.",
    "洛阳纸贵(invisible, history, metaphor, East Asia, Chinese)": "- First image: Stacked beige fabric\n- Second image: Pile of gold coins\n- Relation: Material wealth\n- Explanation: Both images depict objects associated with wealth and value. The beige fabric, potentially representing cloth or textile wealth, and the pile of gold coins, symbolizing monetary wealth. The common theme between the two images is the concept of wealth, whether through material goods or money.",
    "آنکھوں کا تارا(invisible, art, relation, South Asia and South-East Asia, Urdu)": "- First image: Font Character Display\n- Second image: Close-up of an Anime Eye\n- Relation: Visual Appeal\n- Explanation: Both images showcase a clear and detailed display of elements within their respective fields—the characters in the first image are neatly organized and easily readable, while the anime eye in the second image highlights vibrant colors and intricate details. The connection between the two images lies in their visual appeal, as both are designed to be aesthetically pleasing and engaging to the viewer.",
    "بندر کیا جانے ادرک کا سواد(invisible, art, metaphor, South Asia and South-East Asia, Urdu)": "- First image: Ginger root\n- Second image: Capuchin monkey\n- Relation: Contrast in nature\n- Explanation: The first image captures a close-up of a ginger root, highlighting its yellowish texture and earthy tones, while the second image features a capuchin monkey with a distinctive facial expression, showcasing its natural habitat and appearance. Despite being completely different subjects, both images highlight elements of nature, with the ginger root being a plant part and the capuchin monkey being an animal.",
    "一朝被蛇咬，十年怕井绳(invisible, art, metaphor, East Asia, Chinese)": "- First image: A snake showing its fangs.\n- Second image: An image of a rope tied around a stone pillar.\n- Relation: Contrast between life and inanimate objects.\n- Explanation: The first image depicts a living creature, a snake, which is characterized by its movement and biological features. In contrast, the second image features inanimate objects, specifically a rope and a stone pillar, which are static and do not exhibit any biological characteristics. The contrast highlights the difference between living organisms and non-living objects in the natural world.",
    "一箭双雕(invisible, art, metaphor, East Asia, Chinese)": "- First image: arrow\n- Second image: bald eagles in flight\n- Relation: flight\n- Explanation: The first image represents an object used for flight, specifically for hunting or sport, while the second image showcases the natural flight of bald eagles, the national bird of the United States, symbolizing freedom and power. Both images share the common element of flight, but one is man-made and the other is a natural occurrence.",
    "اُونٹ کے مُنہ میں زیرہ (invisible, art, metaphor, South Asia and South-East Asia, Urdu)": "- First image: Cumin seeds\n- Second image: Camel in a natural setting\n- Relation: Nomadic lifestyle\n- Explanation: Cumin seeds are a staple spice in various cuisines, especially in regions where nomadic lifestyles are prevalent. Camels, being well-adapted to arid environments, are commonly associated with nomadic cultures that rely on spices like cumin. The connection between the two images lies in their historical and cultural significance to nomadic communities.",
    "玉兔捣药(invisible, myth, relation, East Asia, Chinese)": "- First image: Traditional Chinese medicine herbs\n- Second image: Crescent moon\n- Relation: Symbolism\n- Explanation: The first image depicts various traditional Chinese medicine herbs, which are often used as natural remedies and hold cultural significance. The second image shows a crescent moon, a celestial body that has been symbolically linked to many cultures. Both images share a common theme of natural elements with historical and cultural importance. The herbs and the moon can both be seen as symbols of natural healing and balance in traditional contexts.",
    "토요일(invisible, culture, mutual elements, East Asia, Korean)": "- First image: Hands holding soil\n- Second image: Calendar with \"SAT\" highlighted\n- Relation: Gardening and planning\n- Explanation: The first image represents the act of holding soil, which is often associated with gardening and nature. The second image displays a calendar with the word \"SAT\" highlighted, which could be related to scheduling gardening activities or planning for a day to tend to plants. The common theme between the two images could be the concept of planning and preparing for tasks, whether it be arranging a gardening schedule or preparing soil for planting.",
    "Счет(invisible, STEM, metaphor, Non-English European, Russian)": "- First image: Sugary treats displayed in an appetizing manner.\n- Second image: A cluttered antique shop filled with various items.\n- Relation: Colorful and filled with details.\n- Explanation: Both images are filled with vibrant colors and intricate details. The first image showcases colorful candy skewers, while the second image displays a wide variety of antiques and knick-knacks, creating a visually stimulating scene in both cases.",
    "Россия(visible, country, mutual elements, Non-English European, Russian)": "- First image: Matryoshka Dolls\n- Second image: Saint Basil's Cathedral\n- Relation: Russian Culture\n- Explanation: The first image depicts Matryoshka dolls, traditional Russian nesting dolls known for their colorful and intricate designs. The second image shows Saint Basil's Cathedral, an iconic landmark in Russia recognized for its vibrant and ornate architecture. Both images represent significant aspects of Russian culture, with the Matryoshka dolls being a popular folk art form and Saint Basil's Cathedral being a renowned historical monument. The vibrant colors and patterns in both images highlight the rich and colorful heritage of Russia.",
    "Япония(invisible, country, metaphor, East Asia, Russian)": "- First image: Flowers in bloom\n- Second image: Origami crane\n- Relation: Artistry\n- Explanation: The first image captures the natural beauty of flowers in full bloom, while the second image showcases the intricate art of paper folding, known as origami. Both images celebrate the intricacies and elegance found in different forms of art — one in nature and the other in human creativity.",
    "Санкт-Петербург(invisible, city, mutual elements, Non-English European, Russian)": "- First image: Grand palace and horse-drawn carriage\n- Second image: Aerial view of a fortress and a river\n- Relation: Historical significance\n- Explanation: The first image features a grand palace, which is likely a historical landmark, indicated by the presence of a horse-drawn carriage typically found in historic settings. The second image shows an aerial view of a fortress by a river, also a historically significant site. Both images display elements of history and grandeur, suggesting a connection through their shared historical themes and architectural prominence.",
    "बूंद बूंद से सागर भरता है(invisible, art, metaphor, South Asia and South-East Asia, Hindi)": "- First image: Water droplet on a leaf\n- Second image: Ocean waves under a clear sky\n- Relation: Water\n- Explanation: Both images feature water, but in different forms and settings. The first image captures a single droplet of water suspended on a leaf, symbolizing purity and the small things in nature. The second image shows a vast ocean under a clear sky, representing the vastness and power of water in nature. The connection between the two images is the element of water, which is essential to life and present in various forms in different environments.",
    "पंचतंत्र(invisible, cartoon or game, mutual elements, South Asia and South-East Asia, Hindi)": "- First image: A tortoise walking on a dirt surface.\n- Second image: A group of ducks standing in a grassy area.\n- Relation: Both are animals.\n- Explanation: The first image shows a tortoise, which is a reptile known for its slow movement and large, dome-shaped shell. The second image depicts a group of ducks, which are water birds characterized by their distinctive beaks and webbed feet. Both animals belong to the animal kingdom, showcasing different species and habitats.",
    "बोया पेड़ बबूल का, तो आम कहाँ से होय।(invisible, art, metaphor, South Asia and South-East Asia, Hindi)": "- First image: A solitary tree with a broad canopy of green leaves situated in an open landscape.\n- Second image: A cluster of green mangoes hanging from the branches of a mango tree.\n- Relation: Fruits and Trees.\n- Explanation: Both images involve trees and their produce. The first image showcases a tree in its entirety with its lush foliage, while the second image focuses on the fruit produced by the tree, highlighting the life cycle and productivity of the tree.",
    "sleigh(invisible, stuff, mutual elements, NA, English)": "- First image: Flatbed hand truck\n- Second image: Snowflake pattern\n- Relation: Both images feature symmetrical designs.\n- Explanation: The flatbed hand truck has a symmetric design with its handle and wheels evenly distributed on both sides, while the snowflake pattern also exhibits symmetry with its arms and intricate patterns evenly spread around the center. This symmetry in both images showcases balance and uniformity in their respective designs.",
    "lock(invisible, stuff, mutual elements, NA, English)": "- First image: Biodegradable shopping bag\n- Second image: Decorative golden key\n- Relation: Symbolism of access\n- Explanation: Both images represent objects that grant access to something. The biodegradable shopping bag allows access to products, while the golden key grants access to a locked door or safe. The key is typically associated with security and privacy, whereas the shopping bag is associated with consumerism and convenience. Despite their different uses, both objects serve as gateways to what they protect or contain.",
    "vampire(invisible, myth, mutual elements, NA, English)": "- First image: A detailed watercolor bat painting\n- Second image: A garlic bulb isolated on a white background\n- Relation: None\n- Explanation: The two images depict completely unrelated subjects. The first image focuses on a bat, an animal, while the second image features a garlic bulb, a vegetable. Both images are set against a plain white background, but the subjects and themes have no connection.",
    "trophy(invisible, sports, mutual elements, NA, English)": "- First image: Beer in a Glass\n- Second image: White Winner's Podium\n- Relation: Celebration\n- Explanation: The first image shows a glass of beer, a beverage often associated with relaxation and celebration. The second image depicts a winner's podium, typically used to honor achievements and celebrate victories. The common theme between the two images is the concept of celebration, as both images can be associated with social events and recognizing accomplishments.",
    "popcorn(invisible, food, mutual elements, NA, English)": "- First image: Cauliflower on a white background\n- Second image: Camera on a tripod\n- Relation: Contrasting shapes and forms\n- Explanation: The cauliflower image shows a natural, organic shape with a rough, clustered texture, while the camera image displays a structured, mechanical form with smooth lines and symmetrical designs. The contrast lies in the organic versus technological nature of the objects, both presented against a stark white background which highlights their forms and details.",
    "christmasbauble(invisible, culture, mutual elements, NA, English)": "- First image: A cartoonish bomb with a lit fuse\n- Second image: A green artificial Christmas tree\n- Relation: Contrast in themes\n- Explanation: The first image represents danger and destruction, depicted by the bomb, while the second image symbolizes joy and celebration, represented by the Christmas tree. These images convey opposing themes: one of caution and potential harm, and the other of festivity and cheer.",
    "banana(invisible, cartoon or game, mutual elements, NA, English)": "- First image: [Yellow Boomerang]\n- Second image: [Red Strawberry]\n- Relation: [Color Contrast]\n- Explanation: The first image features a yellow boomerang, while the second image depicts a red strawberry. The relation between the two images lies in the striking contrast of their colors. Both images feature a single object with a bright, solid color against a white background, highlighting the vibrant hues of the boomerang and the strawberry. This color contrast draws immediate attention to the objects, making them stand out distinctly in their respective images.",
    "coconut(invisible, stuff, mutual elements, NA, English)": "- First image: Red bowling ball\n- Second image: Palm tree\n- Relation: Contrast\n- Explanation: The two images present a stark contrast in terms of their subjects. The first image features a red bowling ball, which is an object typically associated with indoor sports and human-made materials. In contrast, the second image showcases a palm tree, a natural organism commonly found in tropical environments. The difference in the nature of the subjects highlights the contrast between human-made objects and natural elements.",
    "bottle(invisible, stuff, mutual elements, NA, English)": "- First image: A set of colorful bowling pins.\n- Second image: A glass of white wine.\n- Relation: No direct connection.\n- Explanation: The first image represents a group of bowling pins, which are used in the sport of bowling. The second image shows a glass of white wine, which is a beverage. There is no apparent connection between the two images as they represent different objects and activities.",
    "butterfly(invisible, animal, mutual elements, NA, English)": "- First image: A plaid bow tie with blue, white, and purple hues.\n- Second image: A detailed close-up of a vibrant orange and black beetle.\n- Relation: Color and pattern.\n- Explanation: Both images feature bold and striking patterns, with the bow tie showcasing a plaid design of blue, white, and purple, while the beetle's bright orange and black stripes create a visually appealing contrast.",
    "lobster(invisible, food, mutual elements, NA, English)": "- First image: [Red boxing gloves]\n- Second image: [Sushi roll on chopsticks]\n- Relation: [Contrast of forms and purposes]\n- Explanation: The first image features red boxing gloves, which are associated with physical strength, combat, and competition. The second image shows a sushi roll held by chopsticks, a symbol of culinary art, delicacy, and cultural tradition. Despite their different forms and purposes, both images represent activities that require precision, skill, and control. The boxing gloves are tools for physical exertion, while the sushi and chopsticks are implements for enjoying a cuisine that requires a different kind of skilled handling.",
    "antlers(invisible, animal, mutual elements, NA, English)": "- First image: A dried, twisted branch.\n- Second image: A full-bodied, brown deer.\n- Relation: Both images feature natural elements, specifically parts of animals.\n- Explanation: The first image presents a dried branch, which is a part of a tree, while the second image features a deer, an animal. Both elements are organic and naturally occurring in their respective environments, although they represent different life forms.",
    "rainbow(invisible, phenomenon, mutual elements, NA, English)": "- First image: Wooden bridge\n- Second image: Cloud with sun and rain\n- Relation: weather\n- Explanation: The wooden bridge is a structure that can be affected by weather conditions, while the second image represents weather elements such as clouds, sun, and rain.",
    "atomicbomb(invisible, history, mutual elements, NA, English)": "- First image: Broccoli\n- Second image: Radiation warning sign\n- Relation: Nuclear food processing\n- Explanation: The first image, which features broccoli, represents a natural food item. The second image, depicting a radiation warning sign, conveys a warning against radiation hazards. The connection between the two images could be related to the concept of nuclear food processing, where food is treated using nuclear techniques, which involves radiation. This idea brings together the themes of food and radiation, highlighting the potential impact of nuclear technology on food processing.",
    "surfboard(invisible, stuff, mutual elements, NA, English)": "- First image: Ironing board\n- Second image: Wetsuit\n- Relation: Laundry\n- Explanation: Both images feature items related to clothing maintenance and hygiene. The ironing board is used to smooth out wrinkles in clothes, while the wetsuit is a specialized garment that requires drying and care.",
    "mascara(invisible, stuff, mutual elements, NA, English)": "- First image: [Scrub brush]\n- Second image: [Lipstick]\n- Relation: [Cleanliness and beauty]\n- Explanation: The first image shows a scrub brush, commonly used for cleaning and maintaining hygiene. The second image features a lipstick, a product used for enhancing beauty. Both items relate to the themes of cleanliness and beauty, as maintaining cleanliness is important for achieving a beautiful appearance.",
    "ship(invisible, stuff, mutual elements, NA, English)": "- First image: Iron (ironing tool)\n- Second image: Fish (Pacific Salmon)\n- Relation: Shape and form\n- Explanation: Both the iron and the fish have elongated, streamlined shapes. The iron has a pointed end, similar to the pointed nose of the fish. This visual similarity in their forms suggests a common design principle of streamlining for efficiency in their respective functions - pressing clothes and swimming.",
    "rocket(invisible, STEM, mutual elements, NA, English)": "- First image: [Bullet]\n- Second image: [Satellite]\n- Relation: [Technology]\n- Explanation: The first image shows a bullet, representing the field of weapon technology. The second image displays a satellite, symbolizing space technology. Both images share a common theme of technology, focusing on different areas of technological development.",
    "toilet(invisible, stuff, mutual elements, NA, English)": "- First image: Metal can with open lid\n- Second image: Plunger with wooden handle and red rubber base\n- Relation: Both images depict objects commonly found in households\n- Explanation: The first image shows a metal can with its lid partially removed, which is often used for storage or food preservation. The second image shows a plunger, a tool used for unclogging drains. Although these objects serve different purposes, they are both common household items that people use regularly.",
    "sphinx(invisible, myth, mutual elements, NA, English)": "- First image: An orange cat lying down with a white background.\n- Second image: A golden pyramid on a white background.\n- Relation: Both images feature objects with predominantly orange/yellow tones and white backgrounds.\n- Explanation: The first image shows an orange cat with a striking contrast against the white background, while the second image depicts a golden pyramid with a similar contrast against its white background. The commonality in color and background creates a visual connection between the two images.",
    "starfish(invisible, animal, mutual elements, NA, English)": "- First image: A ceiling fan.\n- Second image: A seashell.\n- Relation: Natural elements.\n- Explanation: Both images depict objects that are commonly found in nature. The ceiling fan, although not directly natural, is a man-made object that mimics the natural process of air circulation. The seashell is a natural object that has been part of marine ecosystems for millions of years. Both objects also have a calming, aesthetic appeal and are used in everyday life, with the fan for air flow and the shell for decorative purposes.",
    "slide(invisible, stuff, mutual elements, NA, English)": "- First image: Green celery stalks.\n- Second image: Children's swing set.\n- Relation: Color theme.\n- Explanation: Both images feature objects with a predominant color of green. The celery stalks are vibrant green, while the swing set has a green and white color scheme. The shared green color creates a visual connection between the two images, despite their different contexts and functions.",
    "chalk(invisible, stuff, mutual elements, NA, English)": "- First image: Cigarette\n- Second image: Chalkboard\n- Relation: Contrast\n- Explanation: The two images present contrasting concepts. The cigarette represents a negative aspect, such as unhealthy habits and environmental harm, while the chalkboard symbolizes education, learning, and positive development. The stark contrast between the two images highlights the disparity between positive and negative elements in society.",
    "hourglass(invisible, time, mutual elements, NA, English)": "- First image: A black corset with intricate lace details and floral patterns.\n- Second image: A stopwatch displaying time increments on its face.\n- Relation: Time and control.\n- Explanation: The corset symbolizes control and shaping of the body, while the stopwatch represents the measurement of time. Both objects are tools that help individuals exert control over different aspects of their lives, whether it's physical appearance or the passage of time.",
    "cow(invisible, animal, mutual elements, NA, English)": "- First image: Dalmatian dog\n- Second image: Glass of milk\n- Relation: Contrast in nature\n- Explanation: The first image depicts a living, spotted Dalmatian dog, while the second image shows an inanimate object, a glass of milk. Both images present subjects commonly associated with domesticity and daily life, but they differ significantly in terms of their nature, with one being a living being and the other a simple beverage.",
    "triangle(invisible, music, mutual elements, NA, English)": "- First image: Triangle\n- Second image: Music Notes\n- Relation: Shape and pattern\n- Explanation: The first image features a simple geometric shape, a triangle, which can be related to the concept of a basic shape in visual design. The second image displays a sequence of music notes, which can be seen as a pattern in sound design. Both images share the commonality of containing distinct, clear shapes and patterns, but one is in the realm of visual art and the other in the realm of musical art.",
    "watermill(invisible, stuff, mutual elements, NA, English)": "- First image: Ferris wheel.\n- Second image: Wheat sheaves.\n- Relation: Wheels.\n- Explanation: Both images feature circular shapes associated with the concept of \"wheels.\" The Ferris wheel is a large amusement ride with a circular structure, while the wheat sheaves are depicted with their elongated, curved shapes, resembling small wheels. Despite their different contexts—one being an amusement park ride and the other a symbol of agriculture—the circular and wheel-like elements create a thematic link between the two images.",
    "phonograph(invisible, music, mutual elements, NA, English)": "- First image: Pink flower bud\n- Second image: Vinyl record\n- Relation: Vintage\n- Explanation: The images, though seemingly unrelated at first glance, share a common theme of nostalgia and timeless beauty. The pink flower bud symbolizes nature’s elegance and simplicity, while the vinyl record represents the classic and enduring appeal of music. Both images evoke a sense of nostalgia—the flower for natural beauty and the vinyl record for the golden age of music.",
    "scar(invisible, sports, mutual elements, NA, English)": "- First image: An illustrated American football.\n- Second image: A generic adhesive bandage.\n- Relation: Texture and pattern.\n- Explanation: Both the football and the bandage feature a similar pattern of small, evenly spaced perforations. Additionally, both objects have a distinct texture with the football having a textured surface for grip and the bandage having a woven fabric appearance. The commonality in their design elements makes them visually related despite their different functions and contexts.",
    "battery(invisible, STEM, mutual elements, NA, English)": "- First image: A roll of Kodak color film labeled \"35 mm Film for Color Prints\" and \"DXN\".\n- Second image: A simple electrical circuit diagram with a battery, a resistor, and a light bulb.\n- Relation: Both images represent analog technologies.\n- Explanation: The first image is related to analog photography, while the second image is related to basic electrical circuitry, both of which were crucial in the development of modern technology.",
    "CD(invisible, music, mutual elements, NA, English)": "- First image: Egg\n- Second image: Cassette\n- Relation: Contrast\n- Explanation: The first image is of a cooked egg, which is a symbol of nutrition and food, while the second image is of a cassette, a symbol of music and technology. These two images contrast each other in terms of their subject matter and purpose. The egg is associated with daily life and biological needs, whereas the cassette is associated with entertainment and cultural activities. Furthermore, the egg is a natural product, whereas the cassette is a man-made object.",
    "fireextinguisher(invisible, STEM, mutual elements, NA, English)": "- First image: Gas cylinder.\n- Second image: Fire.\n- Relation: Flammability.\n- Explanation: The first image depicts a gas cylinder, which contains a flammable gas. The second image represents fire, a common consequence of a flammable gas igniting. The connection between the two images is the concept of flammability, where the gas in the cylinder could potentially lead to the creation of fire if exposed to an ignition source.",
    "elephant(invisible, animal, mutual elements, NA, English)": "- First image: A metal watering can with a curved spout and a handle.\n- Second image: A full-grown giraffe standing on a plain white background.\n- Relation: None\n- Explanation: There is no direct connection between the images. The first image depicts a simple household item, while the second image shows a majestic animal. They do not share any common themes or elements.",
    "hat(invisible, stuff, mutual elements, NA, English)": "- First image: A shiny gold bell with a ring at the top.\n- Second image: A knitted scarf with blue, green, and black colors and a white stripe in the middle.\n- Relation: Both images feature objects with a focus on color and texture.\n- Explanation: The first image emphasizes the color and texture of the gold bell, while the second image highlights the texture and color pattern of the knitted scarf. Both objects are used for decoration or fashion, and they share a common theme of visual appeal based on their colors and textures.",
    "moon(invisible, sports, mutual elements, NA, English)": "- First image: Golf ball on a tee\n- Second image: Astronaut in a white space suit\n- Relation: Contrast in environments\n- Explanation: The first image is associated with a specific sport, golf, which takes place on Earth. The second image features an astronaut, a human being designed to operate in outer space. The contrast between the two images lies in the environments they represent; golf is a terrestrial activity, while space exploration involves extraterrestrial environments.",
    "balloons(invisible, food, mutual elements, NA, English)": "- First image: Green Grapes\n- Second image: Polka Dot Party Hat\n- Relation: Celebration and Colorfulness\n- Explanation: The green grapes in the first image are simple and natural, while the polka dot party hat in the second image is festive and colorful. Both images share a theme of celebration, with the grapes representing a natural celebration of life and the party hat representing a human celebration of events and festivities. Additionally, both images feature a bright, colorful element, with the green grapes' vibrant color and the polka dot party hat's colorful polka dots.",
    "hairdryer(invisible, stuff, mutual elements, NA, English)": "- First image: Handgun\n- Second image: Comb\n- Relation: Shape\n- Explanation: Both the handgun and the comb have elongated, straight shapes with parallel sides. The handgun has a more complex structure with various components like the trigger, barrel, and grip, while the comb is a simple tool with evenly spaced teeth. Despite their different functions and designs, the basic shape is similar, which makes them share a common geometric form.",
    "glasses(invisible, stuff, mutual elements, NA, English)": "- First image: Handcuffs\n- Second image: Eye\n- Relation: Freedom\n- Explanation: The first image represents restriction or imprisonment, as handcuffs are typically associated with law enforcement and the restriction of movement. The second image, an eye, can symbolize perception, awareness, and insight. The relation between the two images can be understood as the contrast between being restricted and the desire for freedom. The eye may represent the individual's longing for liberty and the ability to see and experience the world beyond their constraints.",
    "calculator(invisible, STEM, mutual elements, NA, English)": "- First image: A classic mobile phone.\n- Second image: A wooden abacus.\n- Relation: Beads.\n- Explanation: Both images feature objects with beads - the mobile phone has a D-pad with a central button that can be metaphorically likened to a bead, while the abacus is composed of multiple beads on rods.",
    "brush(invisible, stuff, mutual elements, NA, English)": "- First image: Hedgehog\n- Second image: Hairclip\n- Relation: Shapes\n- Explanation: Both images feature objects with curved, elongated shapes. The hedgehog's body is rounded with a pointed nose, while the hairclip has a curved design with a pointed end. This similarity in shapes creates a visual connection between the two images.",
    "microphone(invisible, stuff, mutual elements, NA, English)": "- First image: Vanilla ice cream in a cone\n- Second image: Black over-ear headphones\n- Relation: Contrast of leisure and audio experiences\n- Explanation: The vanilla ice cream cone represents a leisurely dessert experience, while the black over-ear headphones symbolize a modern audio experience. Both are forms of entertainment and pleasure but in different senses – one through taste and the other through sound.",
    "baseballcap(invisible, stuff, mutual elements, NA, English)": "- First image: Igloo\n- Second image: Baseball equipment\n- Relation: Sports and recreation\n- Explanation: The first image depicts an igloo, a traditional dwelling used by the Inuit people in the Arctic, primarily for habitation. The second image shows baseball equipment, which includes a bat and a glove. Both images relate to the theme of sports and recreation, albeit in different contexts. The igloo is a symbol of survival and adaptation in harsh environments, while the baseball equipment represents leisure and competitive sports. The connection between these two images lies in their significance to human activities and culture; one as a means of survival and the other as a form of entertainment and recreation.",
    "helicopter(invisible, STEM, mutual elements, NA, English)": "- First image: Dragonfly\n- Second image: Toyota Yaris car\n- Relation: Color and Design\n- Explanation: Both images feature objects that are primarily white with vibrant colors. The dragonfly has a yellow and black body, while the Toyota Yaris is silver with black accents. Additionally, both images showcase sleek and streamlined designs, with the dragonfly's wings and body structure akin to the aerodynamic shape of the Yaris.",
    "filmreel(invisible, stuff, mutual elements, NA, English)": "- First image: [Portable Power Generator]\n- Second image: [Clapperboard]\n- Relation: [Film Production and Equipment]\n- Explanation: The first image showcases a portable power generator, which is a piece of essential equipment in various settings, including film production. The second image features a clapperboard, a crucial tool in film production for synchronizing audio and video. Although these two items serve different purposes, they are both integral to the film production process, highlighting equipment used in different stages of filmmaking.",
    "collar(invisible, stuff, mutual elements, NA, English)": "- First image: [Golden chain necklace]\n- Second image: [Golden puppy]\n- Relation: [Golden color]\n- Explanation: Both images feature elements with a golden color. The first image shows a delicate gold chain necklace, while the second image depicts a cute puppy with a golden coat. Although the subjects differ, the commonality lies in the color \"gold,\" which is prominently displayed in both images.",
    "gully(invisible, stuff, mutual elements, NA, English)": "- First image: A red button with four holes.\n- Second image: A circular stone structure, possibly a fire pit or well.\n- Relation: Circular shape\n- Explanation: Both images feature objects with a circular shape. The first image shows a button with a circular form and four holes, while the second image depicts a circular stone structure. Although the objects serve different purposes, their shared circular design is a notable connection.",
    "crib(invisible, stuff, mutual elements, NA, English)": "- First image: A gold-colored, rectangular metal can with a hinged lid that is partially open.\n- Second image: A newborn baby sleeping on a soft, white surface.\n- Relation: Innocence and new beginnings.\n- Explanation: Both images represent new and untouched states. The metal can is unused, symbolizing potential and possibility, while the newborn baby represents the beginning of life and innocence. They both evoke a sense of purity and the potential for future experiences.",
    "pliers(invisible, stuff, mutual elements, NA, English)": "- First image: Crab\n- Second image: Nail\n- Relation: Claws and Nail\n- Explanation: Both the crab and the nail have sharp, protruding features. The crab has claws, which are its sharp and prominent appendages, similar to how the nail has a sharp point. Both are also used for gripping or piercing, with the claw gripping food and the nail piercing wood or other materials.",
    "railtrack(invisible, stuff, mutual elements, NA, English)": "- First image: Ladder\n- Second image: Train\n- Relation: Industrial work\n- Explanation: The first image shows a ladder, which is commonly used in industrial settings for tasks such as maintenance and construction. The second image depicts a train, which is a form of industrial transportation. Both images relate to industrial work, as ladders are used in the maintenance of industrial infrastructure and trains are a critical component of industrial transportation systems.",
    "fairy(invisible, myth, mutual elements, NA, English)": "- First image: A colorful dragonfly illustration\n- Second image: A toy doll dressed in a colorful outfit\n- Relation: Vivid Colors\n- Explanation: Both images feature a prominent use of vibrant and contrasting colors. The dragonfly has a striking blue head and a colorful body, while the doll is dressed in a brightly colored outfit with a pink tutu and blue top. The use of color in both images draws attention to the main subjects and adds to their visual appeal.",
    "spade(invisible, culture, mutual elements, NA, English)": "- First image: A Green Leaf\n- Second image: Playing Cards with Red and White Design\n- Relation: Color Contrast\n- Explanation: The first image features a green leaf, representing nature and tranquility, while the second image depicts playing cards with a red and white design, symbolizing excitement and leisure. The relation between the two images lies in the color contrast, as the green of the leaf stands in stark contrast to the red and white of the playing cards. Despite their different contexts, both images share a common theme of visual appeal and the use of color to evoke specific emotions.",
    "divingboard(invisible, sports, mutual elements, NA, English)": "- First image: Ruler\n- Second image: Swimming Pool\n- Relation: Length Measurement\n- Explanation: Both images depict objects that are measured in terms of length. The ruler is a tool used to measure dimensions precisely, while the swimming pool, although not directly measurable, contains dimensions that can be measured using a ruler or similar tools. The concept of length is the shared element between the two images.",
    "pan(invisible, stuff, mutual elements, NA, English)": "- First image: Magnifying glass\n- Second image: Stainless steel pot\n- Relation: Tools\n- Explanation: Both the magnifying glass and the stainless steel pot are tools that serve specific purposes. The magnifying glass is used to magnify objects for closer examination, while the stainless steel pot is used for cooking food. Although they belong to different categories of tools, they share the commonality of being items that assist in performing tasks.",
    "horseshoe(invisible, stuff, mutual elements, NA, English)": "- First image: Magnet\n- Second image: Dress shoes\n- Relation: Attraction\n- Explanation: The first image is a red magnet, symbolizing attraction. The second image is a pair of black dress shoes, which could metaphorically represent the attractiveness of the shoes to potential buyers. The relation between the two images is the concept of attraction, where the magnet's physical attraction can be metaphorically linked to the allure of the dress shoes in terms of style and appeal.",
    "blowfish(invisible, animal, mutual elements, NA, English)": "- First image: A blue spiky ball-like object\n- Second image: A fish isolated on a white background\n- Relation: Spikes, Texture\n- Explanation: Although the first image and the second image depict vastly different subjects, there is a common theme of texture. The blue spiky ball-like object features numerous spikes, while the fish has a textured scale pattern. Both images focus on tactile elements, with the object’s spikes and the fish’s scales creating a visually interesting texture.",
    "snail(invisible, animal, mutual elements, NA, English)": "- First image: A Stanley FatMax tape measure.\n- Second image: A green frog.\n- Relation: None.\n- Explanation: The two images have no obvious relation or shared themes. The first image is a tool typically used for measuring distances or lengths, while the second image is a living creature. They are fundamentally different in context and subject matter.",
    "TV(invisible, stuff, mutual elements, NA, English)": "- First image: Microwave\n- Second image: Oscar trophy\n- Relation: Gold and shine\n- Explanation: Both images feature objects with shiny surfaces. The microwave has a metallic exterior, while the Oscar trophy is made of gold. Both have a polished finish that catches the eye and reflects light.",
    "puzzle(invisible, art, mutual elements, NA, English)": "- First image: Tile mosaic\n- Second image: Poster of the Eiffel Tower\n- Relation: Geometric design\n- Explanation: Both images feature a strong geometric element, with the first image displaying a grid of square tiles and the second image showing a rectangular poster with a structured layout. The geometric design in both images creates a sense of order and balance.",
    "rubberball(invisible, sports, mutual elements, NA, English)": "- First image: A close-up of a spherical, transparent object with swirls and a stripe of darker material.\n- Second image: An illustration of a monkey bouncing on a trampoline, depicted in a playful and cartoonish style.\n- Relation: Both images feature circular or spherical shapes, with the first image showing a transparent sphere and the second image depicting a monkey bouncing in a circular motion.\n- Explanation: The first image showcases a spherical object with a reflective and translucent quality, while the second image captures the dynamic and circular motion of a monkey bouncing on a trampoline. The common theme of circular shapes brings these two seemingly unrelated images together.",
    "honeycomb(invisible, animal, mutual elements, NA, English)": "- First image: A hexagonal metal nut.\n- Second image: A honey bee.\n- Relation: Both images feature objects with a central, circular opening.\n- Explanation: The hexagonal metal nut has a threaded hole in the center, while the honey bee has an open circular area where its abdomen is located. Although the objects themselves are different, they both share the common characteristic of having a central opening.",
    "croissant(invisible, food, mutual elements, NA, English)": "- First image: Snail\n- Second image: Cappuccino\n- Relation: Contrast\n- Explanation: The first image shows a snail, which is a slow-moving creature, while the second image features a cappuccino, a type of fast-paced coffee beverage. These two images contrast each other in terms of speed and nature; the snail represents slowness and patience, while the cappuccino represents a quick and energizing drink.",
    "octopus(invisible, animal, mutual elements, NA, English)": "- First image: A golden metal hook with two holes at the top.\n- Second image: Six clear plastic hooks with circular bases.\n- Relation: Both are hooks.\n- Explanation: The first image shows a single, golden hook with two holes, likely used for hanging items. The second image displays multiple clear plastic hooks, designed to be mounted on walls or other surfaces. Despite differences in material and design, both images feature hooks used for hanging purposes.",
    "accordion(invisible, music, mutual elements, NA, English)": "- First image: Foldable document organizer\n- Second image: Musical note (quaver)\n- Relation: Structure and shape\n- Explanation: Both images feature a curved, arch-like structure. The first image shows an organizer with a fan-like arrangement of documents, while the second image displays a quaver, a musical note with a curved line and a circular dot. Despite their different purposes, the curvature and the overall shape of these two objects share similarities.",
    "banknote(invisible, business, mutual elements, NA, English)": "- First image: Newspaper stack\n- Second image: Coin featuring a historical figure\n- Relation: Monument\n- Explanation: Both images symbolize significant structures or representations. The stack of newspapers, often seen as a symbol of information and history, and the coin, potentially commemorating a historical figure or event, share the theme of representing historical monuments or records.",
    "lightbulb(invisible, stuff, mutual elements, NA, English)": "- First image: A single pear\n- Second image: A candle in a holder\n- Relation: Both images feature objects with a singular, unifying shape.\n- Explanation: The pear and the candle share a commonality in that they are both items that are commonly associated with a singular, rounded shape. While the pear is a natural fruit with a stem, the candle is an inanimate object designed for lighting. Despite their differences, both objects have a distinct, rounded form that stands out against the white background in their respective images.",
    "drumsticks(invisible, music, mutual elements, NA, English)": "- First image: Black and gold pen\n- Second image: White and silver bongo drums\n- Relation: Elegance and simplicity\n- Explanation: Both items represent a certain elegance and simplicity in their design. The black and gold pen has a classic and sophisticated appearance, while the white and silver bongo drums have a clean and minimalistic look. Both items also serve specific purposes—writing with the pen and playing music with the drums—showcasing functionality alongside their aesthetic appeal.",
    "nun(invisible, cartoon or game, mutual elements, NA, English)": "- First image: Penguin\n- Second image: Cross\n- Relation: Black and white\n- Explanation: Despite their vastly different subjects, both images feature a prominent black and white color theme. The penguin's distinct black and white markings are a defining characteristic, while the cross, though primarily brown, includes gold accents that provide a subtle contrast akin to white. This shared color scheme creates a visual connection between the two images.",
    "fan(invisible, stuff, mutual elements, NA, English)": "- First image: Peacock\n- Second image: Fan\n- Relation: Colorfulness\n- Explanation: Both images feature vibrant and striking colors. The peacock, with its beautiful blue and green feather patterns, is known for its colorful appearance. Similarly, the fan, while primarily white, has a distinctive black logo that adds a touch of color to its design. The connection between the two images lies in their shared use of color to create visual appeal.",
    "umbrella(invisible, stuff, mutual elements, NA, English)": "- First image: Mushroom\n- Second image: Raincoat\n- Relation: Natural element\n- Explanation: Both images depict objects associated with natural elements. The mushroom, a natural organism, is often found in forested areas and is a vital part of the ecosystem. The raincoat, designed for protection against rain, is commonly used in outdoor settings where natural weather elements are present. Both images reflect items that have evolved to adapt to and interact with their natural environments.",
    "clam(invisible, animal, mutual elements, NA, English)": "- First image: Pistachio shell\n- Second image: Pearl necklace\n- Relation: Contrast in natural vs. crafted beauty\n- Explanation: The first image depicts a pistachio shell, highlighting the natural beauty and simplicity of a common nut. The second image showcases a pearl necklace, emphasizing the intricate craftsmanship and elegance of a piece of jewelry. Both images feature objects with distinct shapes and textures, yet they belong to very different categories—one is a natural food item, while the other is a human-made accessory. The contrast between the organic, earthy appeal of the pistachio and the refined, luxurious allure of the pearl necklace underscores the diverse ways in which beauty can be appreciated.",
    "compass(invisible, stuff, mutual elements, NA, English)": "- First image: Vintage pocket watch\n- Second image: Old world map\n- Relation: Antique items\n- Explanation: Both images feature items that are considered antiques. The pocket watch has a classic design with Roman numerals and a gold casing, while the world map has a historical style with muted colors and simplistic borders. Both objects reflect a sense of nostalgia and represent a bygone era.",
    "stamp(invisible, stuff, mutual elements, NA, English)": "- First image: An urban night scene featuring a blur of cars and city lights.\n- Second image: A close-up of a green mailbox with a red flag, filled with newspapers.\n- Relation: The contrast between the fast-paced, bustling city life and the quiet, routine act of receiving mail.\n- Explanation: The first image captures the dynamic, energetic atmosphere of city streets at night, with speeding cars and vibrant lights. In contrast, the second image highlights a mundane, everyday task—mail retrieval—set against a stark white background. The juxtaposition emphasizes the difference between the excitement of urban life and the simplicity of routine activities.",
    "broom(invisible, stuff, mutual elements, NA, English)": "- First image: Porcupine with quills\n- Second image: Light blue plastic scoop\n- Relation: Spiky\n- Explanation: The first image features a porcupine with quills that are spiky, while the second image shows a light blue plastic scoop with a spiky edge. Both images contain elements with spiky features, although in different contexts.",
    "basketball(invisible, sports, mutual elements, NA, English)": "- First image: An orange pumpkin with a dark stem\n- Second image: A pair of high-top basketball shoes, one white and one black\n- Relation: Contrasting colors\n- Explanation: The first image features a bright orange pumpkin with a dark brown stem, while the second image showcases two contrasting shoes, one completely white and the other completely black. The relation between the two images lies in the use of contrasting colors: the pumpkin's vibrant orange stands out against the white background, similar to how the black shoe stands out against the white shoe and vice versa. Both images highlight the importance of color contrast in visual presentation.",
    "ring(invisible, stuff, mutual elements, NA, English)": "- First image: A single black tire viewed from a side angle.\n- Second image: A human hand open and facing upwards, palm visible.\n- Relation: Shape\n- Explanation: Both images feature circular shapes prominently; the tire's sidewall curves around its central axis, and the hand's palm and fingers create a circular opening when held open.",
    "swan(invisible, animal, mutual elements, NA, English)": "- First image: Cleaning product container\n- Second image: Colorful parrot\n- Relation: Contrast in purpose and appearance\n- Explanation: The first image depicts a container for a cleaning product, emphasizing functionality and safety through its design and labeling. In contrast, the second image showcases a vibrant parrot, highlighting beauty and nature without any utilitarian purpose. The two images differ significantly in their intended use and visual appeal, with the cleaning product focused on practicality and the parrot emphasizing aesthetic and ecological aspects.",
    "doughnut(invisible, food, mutual elements, NA, English)": "- First image: Lifebuoy\n- Second image: Muffin\n- Relation: Contrast\n- Explanation: The first image depicts a lifebuoy, an object associated with water safety and rescue operations, while the second image features a muffin, a baked food item typically enjoyed as a snack or breakfast. The two images are contrasting in terms of their function, context, and visual appearance. The lifebuoy is designed for practical use in emergency situations, whereas the muffin is meant for consumption and enjoyment. The lifebuoy's bright red and white colors are starkly different from the golden-brown hue of the muffin. Overall, the images represent distinct themes and purposes.",
    "maze(invisible, stuff, mutual elements, NA, English)": "- First image: A complex network of interwoven pipes and valves\n- Second image: A small mouse standing on a plain background\n- Relation: Metaphorical maze\n- Explanation: The first image, with its intricate pipes and valves, is reminiscent of a maze. The second image features a mouse, which is often used as a symbol of exploration and navigating through unknown territories. The relation between the two images lies in the concept of a \"metaphorical maze,\" where the mouse represents the explorer navigating through the complex and interconnected pathways represented by the pipes in the first image. This connection underscores themes of exploration, navigation, and the intricacies of systems and networks.",
    "veins(invisible, STEM, mutual elements, NA, English)": "- First image: Root system of a tree\n- Second image: IV bag with red liquid\n- Relation: Connection to life\n- Explanation: Although they appear vastly different, both images represent elements essential for life. The root system of a tree symbolizes the foundation and sustenance of life, drawing nutrients and water from the soil. Similarly, the IV bag with red liquid represents medical intervention to sustain life by providing necessary fluids and nutrients directly into the bloodstream. Both are crucial for survival, one through natural processes and the other through medical science.",
    "shuttlecock(invisible, sports, mutual elements, NA, English)": "- First image: Glass salt shaker\n- Second image: Red tennis racket\n- Relation: Contrast in function and design\n- Explanation: The first image shows a kitchen item, specifically a glass salt shaker with a silver metal top, used for adding salt to food. The second image depicts a red tennis racket, which is a sports equipment used for playing tennis. The two images contrast each other in terms of their functions and designs, with the salt shaker being a utilitarian object for cooking and the tennis racket being a sporting good for physical activity.",
    "laptop(invisible, STEM, mutual elements, NA, English)": "- First image: A brown cardboard pizza box\n- Second image: A computer motherboard\n- Relation: Industrial design\n- Explanation: Both images showcase industrial design elements. The pizza box is designed for food delivery, emphasizing simplicity and functionality, while the motherboard is designed for computing, focusing on performance, connectivity, and durability. Both designs prioritize user needs and practicality in their respective industries.",
    "snake(invisible, animal, mutual elements, NA, English)": "- First image: garden hose\n- Second image: pirate potion bottle\n- Relation: adventure\n- Explanation: The first image shows a garden hose, which is a practical tool commonly used for outdoor activities such as gardening and watering plants. The second image depicts a pirate potion bottle, which is a playful and whimsical representation often associated with adventurous stories and pirate lore. Both images evoke a sense of adventure, albeit in different contexts—one being a mundane household chore and the other being a fantastical pirate adventure.",
    "cheese(invisible, food, mutual elements, NA, English)": "- First image: A sponge\n- Second image: A cow\n- Relation: cleaning\n- Explanation: The first image shows a sponge, which is a common cleaning tool used for wiping surfaces and removing dirt. The second image depicts a cow, which is an animal that produces milk and meat. While the two images seem unrelated at first glance, they are connected through the concept of cleaning. Sponges are used to clean surfaces, and cows require cleaning to maintain their hygiene and health. Therefore, the relation between the two images can be understood as cleaning, as both sponges and cows are associated with cleanliness and maintenance.",
    "eraser(invisible, stuff, mutual elements, NA, English)": "- First image: Sponge\n- Second image: Metal file\n- Relation: Cleaning and maintenance\n- Explanation: Although the sponge and metal file serve different purposes, they are both tools commonly used for maintaining and cleaning various objects. The sponge is typically used for cleaning surfaces, while the metal file is used to smooth and shape metal objects. Both items are essential for keeping things in good condition.",
    "computermouse(invisible, stuff, mutual elements, NA, English)": "- First image: Soap bar\n- Second image: Computer monitor\n- Relation: Function\n- Explanation: Both images feature everyday objects that serve a specific function. The soap bar is used for cleaning and personal hygiene, while the computer monitor is used for displaying visual information in various settings such as homes or offices. Although they are used for different purposes, they both represent items that are essential in our daily lives, emphasizing the importance of functionality in design.",
    "chopsticks(invisible, stuff, mutual elements, NA, English)": "- First image: Skis with colorful design and bindings\n- Second image: Bowl of stir-fried noodles with shrimp and vegetables\n- Relation: Diverse uses of color\n- Explanation: Both images feature vibrant colors. The skis have a colorful design, while the bowl of noodles is filled with a variety of colorful ingredients such as shrimp, carrots, and broccoli. Although the objects and their uses are different, the common theme is the use of bright colors to attract attention and make the items visually appealing.",
    "mummy(invisible, history, mutual elements, NA, English)": "- First image: A modern sleeping bag.\n- Second image: A traditional Egyptian eye symbol (Udjat Eye).\n- Relation: Both images represent objects used for protection and comfort in their respective contexts.\n- Explanation: The first image shows a sleeping bag designed to provide warmth and comfort for sleeping outdoors, while the second image depicts the Udjat Eye, an ancient Egyptian symbol believed to offer protection from harm and evil.",
    "belt(invisible, stuff, mutual elements, NA, English)": "First image: A snake with a distinct pattern of black and white stripes on an orange-red body.\nSecond image: A pair of light stonewash-colored denim jeans.\nRelation: Contrasting colors and patterns.\nExplanation: Both images feature items with prominent patterns and contrasting colors. The snake's black and white stripes contrast with its orange-red body, similar to the contrast between the light stonewash color of the jeans and the darker stitching. The patterns and colors in both images create a visual appeal through their distinct designs.",
    "cakeserver(invisible, stuff, mutual elements, NA, English)": "- First image: A shovel\n- Second image: A cake\n- Relation: Both images feature objects with a handle and a pointed end.\n- Explanation: The shovel has a handle for gripping and a pointed end for digging, while the cake has a handle-like structure for support and a pointed end in the form of a decorative swirl on top.",
    "spider(invisible, animal, mutual elements, NA, English)": "- First image: A round coffee table with a glass top and a black base with gold accents.\n- Second image: A detailed close-up of a house fly, showing its transparent wings, large compound eyes, and yellow head.\n- Relation: None\n- Explanation: The first image depicts a piece of furniture, while the second image shows a small insect. There are no apparent connections or shared elements between the two images.",
    "corkscrew(invisible, stuff, mutual elements, NA, English)": "- First image: Pasta\n- Second image: Bottle opener\n- Relation: Cooking/food related\n- Explanation: Both images are related to cooking and food. The first image shows uncooked pasta, a staple ingredient in many dishes. The second image shows a bottle opener, which is often used in bars or restaurants to open bottles of drinks, sometimes even used for opening bottles of sparkling water which can accompany a meal.",
    "star(invisible, phenomenon, mutual elements, NA, English)": "- First image: [Juicy fruit]\n- Second image: [Gaseous giant planet]\n- Relation: [Astronomical scale]\n- Explanation: The first image shows a close-up of a yellow juicy fruit, which is likely a passion fruit. The second image depicts a gaseous giant planet, possibly Saturn, with its prominent rings. The relation between the two images is the astronomical scale — the tiny passion fruit compared to the massive planet, highlighting the vast differences in size between objects in our universe.",
    "face(invisible, stuff, mutual elements, NA, English)": "- First image: A standard electrical outlet with two slots and a grounding hole.\n- Second image: A surgical mask with ear loops, colored in a shade of teal or light green.\n- Relation: Safety and Health\n- Explanation: Both images depict items commonly associated with ensuring safety and well-being. The electrical outlet is essential for safely powering devices, while the surgical mask is used to prevent the spread of airborne particles, promoting public health.",
    "lollipop(invisible, food, mutual elements, NA, English)": "- First image: Pin with a red head\n- Second image: Candy display in pink\n- Relation: Colorful objects\n- Explanation: Both images feature objects with striking colors—red in the first and pink in the second. The pin has a red head, while the candy wrapper is pink. Despite their different purposes, the use of bright colors in both images makes them visually appealing and easily recognizable.",
    "hammer(invisible, stuff, mutual elements, NA, English)": "- First image: Wooden stamp\n- Second image: Metal nail\n- Relation: Objects used for marking or attaching\n- Explanation: Both objects are tools used for marking or attaching something. The wooden stamp is used to mark documents or materials with a specific design or symbol, while the metal nail is used to attach materials together by being hammered into them. Although they serve different purposes, they both involve making a mark or connection.",
    "heart(invisible, STEM, mutual elements, NA, English)": "- First image: Heart-shaped stone\n- Second image: Stethoscope\n- Relation: Love, Care\n- Explanation: The first image depicts a heart-shaped stone, symbolizing love and natural beauty. The second image shows a stethoscope, a medical instrument used by doctors to listen to a patient's heart and lungs, symbolizing care and medical attention. Both images share the theme of love and care, as the heart shape represents love, and the stethoscope represents medical care.",
    "scepter(invisible, stuff, mutual elements, NA, English)": "- First image: Street lamp\n- Second image: Crown\n- Relation: Symbolism\n- Explanation: Both the street lamp and the crown are symbols of power and authority. The street lamp represents the power of illumination and guidance, providing light in dark spaces, while the crown is a traditional symbol of royal power and leadership. Both objects convey a sense of control and influence over their respective domains.",
    "fries(invisible, food, mutual elements, NA, English)": "- First image: A box of matchsticks with a fall scene printed on the lid.\n- Second image: A burger with sesame seed bun, lettuce, tomato, cheese, and a beef patty.\n- Relation: Contrast\n- Explanation: The first image represents simplicity and basic needs, while the second image signifies indulgence and luxury.",
    "t-shirt(invisible, stuff, mutual elements, NA, English)": "- First image: Black T shape on white background\n- Second image: Heathered gray men's shorts with skull graphic\n- Relation: color contrast\n- Explanation: The first image features a stark contrast with a black T shape on a white background, emphasizing simplicity and minimalism. The second image displays heather gray men's shorts adorned with a skull graphic, showcasing a more detailed and textured design. Both images utilize a color contrast to highlight the main elements, whether it's the black shape against the white background or the detailed skull graphic on the shorts.",
    "tent(invisible, stuff, mutual elements, NA, English)": "- First image: A stylized, orange fabric lantern with a sun motif on the sides and a black metal hook at the top.\n- Second image: A rolled up sleeping bag or mat with a predominantly dark grey color and turquoise straps attached for carrying or hanging.\n- Relation: Both images feature objects that can be hung or suspended, with distinct color schemes and practical functions.\n- Explanation: The lantern in the first image is designed to be hung and emits light, while the sleeping bag or mat in the second image is rolled up with straps for hanging or carrying. Both objects serve different purposes but share a commonality in their hanging functionality and unique visual designs.",
    "barbell(invisible, sports, mutual elements, NA, English)": "- First image: [Starfighter jet model]\n- Second image: [Abdominal exercise machine]\n- Relation: [Asymmetry and functionality]\n- Explanation: Both images show objects with distinct asymmetrical designs that serve specific functional purposes. The starfighter jet model has a unique, angular shape optimized for aerodynamics and combat, while the abdominal exercise machine is designed to provide targeted fitness training. Despite their different contexts—one being a toy model and the other a piece of exercise equipment—they both emphasize form following function.",
    "mouse(invisible, animal, mutual elements, NA, English)": "- First image: A transparent plastic tape measure with a red cap and the brand \"Nivek Technologies\" printed on it.\n- Second image: A wooden mousetrap with a spring mechanism and a small metal trigger.\n- Relation: Both images display everyday tools designed for specific tasks, highlighting functionality and practicality.\n- Explanation: The tape measure is utilized for measuring distances or lengths, while the mousetrap is used to capture or kill mice. Both items serve distinct purposes but share the commonality of being practical tools that address specific needs in everyday situations.",
    "stopsign(invisible, stuff, mutual elements, NA, English)": "- First image: Table tennis paddle\n- Second image: Crosswalk sign\n- Relation: Traffic regulation\n- Explanation: The table tennis paddle is a sports equipment used in the game of table tennis, while the crosswalk sign is a traffic sign used to indicate pedestrian crossing zones. Both images represent elements related to regulation, one in sports and the other in traffic.",
    "eye(invisible, stuff, mutual elements, NA, English)": "- First image: [Eye pendant]\n- Second image: [Binoculars]\n- Relation: [Visual Acuity]\n- Explanation: The first image shows a decorative eye pendant, symbolizing perception and awareness. The second image depicts binoculars, which are tools designed to enhance visual acuity. Both images are related through the theme of vision and the ability to see clearly, with the eye pendant representing the eye itself and binoculars representing a tool that aids in seeing distant objects more clearly.",
    "lighthouse(invisible, stuff, mutual elements, NA, English)": "- First image: Stone Castle Tower\n- Second image: LED Flashlight\n- Relation: cylindrical structure\n- Explanation: Both images feature cylindrical structures. The first image depicts a cylindrical stone castle tower, while the second image shows a cylindrical LED flashlight. Although their functions and designs are different, the common cylindrical shape is a key connection between the two images.",
    "syringe(invisible, stuff, mutual elements, NA, English)": "- First image: [Tower structure]\n- Second image: [Pill organizer]\n- Relation: [Contrasting forms and functions]\n- Explanation: The first image shows a tall, slender, and complex tower structure with metallic and geometric elements designed for communication purposes. The second image depicts a pill organizer with simplistic and functional design, aimed at ease of use and organization. The two images contrast in terms of form and function, with the tower being a static structure and the pill organizer being a portable, everyday object. Both images, however, emphasize precision and functionality in their respective contexts.",
    "kangaroo(invisible, animal, mutual elements, NA, English)": "- First image: Toy dinosaur\n- Second image: Baby carrier\n- Relation: Parenting\n- Explanation: The first image shows a toy dinosaur, which may be a toy for children to play with. The second image shows a baby carrier, which is used by parents to carry their babies. Both images are related to the theme of parenting, as they both involve items that are used by or for children.",
    "puck(invisible, sports, mutual elements, NA, English)": "- First image: UFO\n- Second image: Hockey helmet\n- Relation: Sport\n- Explanation: Both images represent objects used in sports. The UFO is often associated with the sport of \"flying saucer golf,\" while the hockey helmet is used in the sport of ice hockey.",
    "flyswatter(invisible, stuff, mutual elements, NA, English)": "- First Image: Kitchen utensil (spatula)\n- Second Image: Insect (mosquito)\n- Relation: Both images contain tools used for specific tasks.\n- Explanation: The spatula is a tool used for cooking, particularly for flipping or turning food items in a pan. The mosquito, although not a tool, is an insect that performs the task of blood feeding, which is essential for its survival and reproduction. The connection between the two lies in their respective roles as instruments for performing specific functions.",
    "urn(invisible, stuff, mutual elements, NA, English)": "- First image: [striped colorful vase]\n- Second image: [decorative coffin with skeleton]\n- Relation: [artistic expression]\n- Explanation: Both images showcase artistic expressions, with the first image featuring a vase with vibrant stripes and the second image displaying a coffin with decorative elements including a skeleton. Despite their different purposes and designs, both items highlight creativity and craftsmanship, making the connection between them one of shared artistic value.",
    "trafficlights(invisible, stuff, mutual elements, NA, English)": "- First image: Electrical outlet with covers\n- Second image: No left turn traffic sign\n- Relation: restriction\n- Explanation: Both images depict objects that restrict access or movement. The electrical outlet has covers that prevent unauthorized access to the sockets, while the no left turn sign prohibits left turns at an intersection.",
    "prison(invisible, stuff, mutual elements, NA, English)": "- First image: Caged bird.\n- Second image: Gavel.\n- Relation: Symbolism of confinement and authority.\n- Explanation: The first image represents confinement and the restriction of freedom, as symbolized by the bird in a cage. The second image, the gavel, is a symbol of authority and the power to make decisions, often in a legal context. Both images, while appearing to be unrelated at first glance, can be connected through the theme of control and restriction: the bird is restricted by the cage, and the gavel represents the authoritative control within a courtroom.",
    "seesaw(invisible, stuff, mutual elements, NA, English)": "- First image: A golden scale of justice.\n- Second image: A children's climbing frame.\n- Relation: Play and fairness.\n- Explanation: The first image symbolizes fairness and justice, while the second image represents play and childhood. Although seemingly unrelated at first glance, both images share a common theme of balance. The scale of justice balances opposing forces, while the climbing frame requires children to balance their physical and mental efforts to climb and play. Both images convey the importance of balance in different contexts.",
    "brain(invisible, STEM, mutual elements, NA, English)": "- First image: Human brain illustration\n- Second image: Human skeleton\n- Relation: Anatomical structure\n- Explanation: Both images depict key anatomical structures of the human body. The first image illustrates a human brain, highlighting its intricate folds and grooves, which are essential for cognitive functions. The second image shows a full human skeleton, providing a comprehensive view of the body's structural framework. The connection between the two images lies in their representation of the human body's complexity, with the brain being the center of the nervous system and the skeleton providing the physical support and structure for the entire body.",
    "turtle(invisible, animal, mutual elements, NA, English)": "- First image: A used and worn military helmet with a camouflage pattern.\n- Second image: A colorful chameleon perched on a green branch.\n- Relation: Camouflage\n- Explanation: Both the helmet and the chameleon exhibit patterns that help them blend into their respective environments, highlighting the concept of camouflage. The helmet's camouflage pattern is designed for military use, while the chameleon's colorful skin is a natural adaptation for survival in the wild.",
    "camera(invisible, stuff, mutual elements, NA, English)": "- First image: A front-loading LG washing machine.\n- Second image: A compact, silver tripod with a black head.\n- Relation: Utility.\n- Explanation: Both objects are household items that serve utilitarian functions. The washing machine is used for cleaning clothes, while the tripod is used to stabilize cameras or other devices for better photography or videography. Although they belong to different categories of household items, they share a common purpose of enhancing the user's convenience and efficiency in their respective tasks.",
    "cottoncandy(invisible, food, mutual elements, NA, English)": "- First image: Balls of cotton\n- Second image: Salt shaker\n- Relation: Container\n- Explanation: The first image shows cotton balls, which can be used as a container for small items. The second image shows a salt shaker, which is a container for holding and dispensing salt. Both images feature objects that serve as containers for other items.",
    "pizza(invisible, food, mutual elements, NA, English)": "- First image: Wooden wagon wheel\n- Second image: Brick oven\n- Relation: rustic\n- Explanation: Both images feature objects with a rustic appearance, characterized by their simple and traditional designs. The wooden wagon wheel, with its natural wood and metal spokes, and the brick oven, with its stone and brick construction, share a common aesthetic that evokes a sense of history and craftsmanship.",
    "crosswalk(invisible, location, mutual elements, NA, English)": "- First Image: Black and white zebra\n- Second Image: Road with dashed lines\n- Relation: Dashed pattern\n- Explanation: Both images feature a pattern with dashed lines. The zebra has black and white stripes, which can be seen as a form of dashed pattern. The road also has dashed lines painted on it, which serve as a visual guide for drivers. The commonality between the two images lies in the repetition and contrast created by the dashed patterns.",
    "cane(invisible, stuff, mutual elements, NA, English)": "- First image: [Bamboo Stalks]\n- Second image: [Wheelchair]\n- Relation: [Utility]\n- Explanation: Both images depict objects that are used for practical purposes. Bamboo stalks are used in various applications such as construction, furniture making, and even musical instruments. Similarly, a wheelchair is a mobility aid designed to assist individuals with physical disabilities in moving around. While they serve different functions, both objects are essential tools that enhance people's quality of life.",
    "onion(invisible, food, mutual elements, NA, English)": "- First image: Orthodox church illustration\n- Second image: Fresh carrots with leaves\n- Relation: Contrast between spiritual and earthly elements\n- Explanation: The first image represents a religious symbol, an Orthodox church, which is associated with spirituality and faith. The second image depicts fresh carrots, a common and everyday food item. The contrast lies in the difference between the sacred and the mundane, highlighting how the two images represent vastly different aspects of human experience and culture."
}