{
    "Tea Ceremony(culture, relation, East Asia, English)": {
        "confidence": "Confidence: 0.60",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that the elements are unrelated, while the original answer clearly connects them through the theme of nature."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer vaguely connects the elements to a cultural event, but it does not capture the original answer's focus on nature."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer mentions traditional practice but misses the original answer's emphasis on the natural world and its beauty."
            },
            {
                "specificity_level": 3,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer discusses cultural ritual and significance, but it does not align with the original answer's focus on nature and natural beauty."
            },
            {
                "specificity_level": 4,
                "score": 0.6,
                "reason": "Moderate similarity; the fallback answer correctly identifies the tea ceremony context but does not emphasize the natural theme as strongly as the original answer."
            }
        ]
    },
    "Wedding Traditions(culture, mutual elements, Non-English European, English)": {
        "confidence": "Confidence: 0.94",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that wedding rings and bouquets have no connection to weddings, which contradicts the original answer."
            },
            {
                "specificity_level": 1,
                "score": 0.7,
                "reason": "Very similar semantic meaning; both answers recognize the cultural significance of wedding rings and bouquets in ceremonies, but the fallback answer lacks the specific focus on weddings."
            },
            {
                "specificity_level": 2,
                "score": 0.8,
                "reason": "Very similar semantic meaning and reasoning; both answers identify wedding rings and bouquets as elements in wedding rituals, aligning closely with the original answer."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Nearly identical semantic meaning; both answers describe wedding rings and bouquets as symbols in wedding ceremonies, with the fallback answer adding a focus on commitment and beauty."
            },
            {
                "specificity_level": 4,
                "score": 0.9,
                "reason": "Nearly identical semantic meaning and reasoning; both answers explicitly identify wedding rings and bouquets as traditional elements in Western wedding ceremonies, closely aligning with the original answer."
            }
        ]
    },
    "Funeral Rites(culture, mutual elements, Non-English European, English)": {
        "confidence": "Confidence: 0.80",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that coffins and black clothing are unrelated to funerals, which contradicts the original answer's focus on mourning and remembrance."
            },
            {
                "specificity_level": 1,
                "score": 0.6,
                "reason": "Moderately similar; the fallback answer broadly mentions cultural rituals related to death, which aligns with the original answer's theme of mourning, but lacks the specific focus on remembrance and funeral urns."
            },
            {
                "specificity_level": 2,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies coffins and black clothing as elements associated with funerals, aligning with the original answer's focus on mourning practices, though it does not explicitly mention funeral urns."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Nearly identical; the fallback answer directly connects coffins and black clothing to mourning practices during funerals, closely matching the original answer's explanation and reasoning."
            },
            {
                "specificity_level": 4,
                "score": 0.8,
                "reason": "Very similar; the fallback answer specifically mentions Western funeral rites, which aligns with the original answer's cultural context, though it does not explicitly mention funeral urns."
            }
        ]
    },
    "Coming-of-Age Rituals(culture, relation, Non-English European, English)": {
        "confidence": "Confidence: 0.71",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that the items are unrelated and focuses on Quinceañera dresses, which are not mentioned in the original answer."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer correctly identifies the items as associated with cultural events, but it does not capture the formal attire aspect or the specific milestones mentioned in the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.6,
                "reason": "Moderately similar; the fallback answer identifies the items as ritual symbols, which aligns somewhat with the original answer’s focus on milestones, but it misses the formal attire and specific event details."
            },
            {
                "specificity_level": 3,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies the items as representing cultural milestones, closely aligning with the original answer’s focus on important life events and celebration."
            },
            {
                "specificity_level": 4,
                "score": 0.8,
                "reason": "Very similar; the fallback answer correctly identifies the items as symbols of coming-of-age rituals, closely aligning with the original answer’s focus on milestones, though it slightly diverges by mentioning Quinceañera dresses instead of a ball gown."
            }
        ]
    },
    "Harvest Festivals(culture, mutual elements, Non-English European, English)": {
        "confidence": "Confidence: 0.94",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that the objects are unrelated, which contradicts the original answer's focus on seasonal abundance and harvest themes."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer identifies cultural symbols but does not explicitly connect them to the themes of harvest and seasonal abundance as the original answer does."
            },
            {
                "specificity_level": 2,
                "score": 0.6,
                "reason": "Moderately similar; the fallback answer mentions festival elements, which aligns somewhat with the original answer's focus on harvest themes, but it lacks the depth of seasonal context."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Very similar; the fallback answer's focus on seasonal symbols representing abundance and harvest closely aligns with the original answer's themes and reasoning."
            },
            {
                "specificity_level": 4,
                "score": 0.9,
                "reason": "Nearly identical; the fallback answer's emphasis on traditional symbols associated with harvest festivals closely matches the original answer's focus on seasonal abundance and harvest themes."
            }
        ]
    },
    "Traditional Music(culture, mutual elements, Non-English European, English)": {
        "confidence": "Confidence: 1.00",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly states that the objects are unrelated and focuses on unrelated uses (classical music vs. parades), completely missing the connection as musical instruments."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer vaguely mentions a cultural association but fails to identify the specific connection as musical instruments, which is the core theme of the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer correctly identifies a cultural association but lacks the specificity of the original answer, which focuses on the instruments' roles in music."
            },
            {
                "specificity_level": 3,
                "score": 0.9,
                "reason": "Nearly identical in meaning and reasoning; the fallback answer correctly identifies the relation as musical instruments and connects them to traditional music, closely aligning with the original answer."
            },
            {
                "specificity_level": 4,
                "score": 0.85,
                "reason": "Very similar; the fallback answer correctly identifies the relation as traditional music and emphasizes cultural heritage, though it slightly narrows the focus compared to the broader musical instruments theme in the original answer."
            }
        ]
    },
    "Folk Dance(culture, relation, Non-English European, English)": {
        "confidence": "Confidence: 0.80",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly associates clogs and polka, which is unrelated to the original answer's focus on traditional dance and scattered shoes."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer vaguely mentions a possible cultural association, which is somewhat related but lacks the specificity and reasoning of the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer discusses cultural practices, which aligns with the original answer's cultural connection but misses the focus on dance traditions."
            },
            {
                "specificity_level": 3,
                "score": 0.7,
                "reason": "Very similar; the fallback answer focuses on dance traditions, closely aligning with the original answer's emphasis on traditional dance, though it does not mention the scattered shoes."
            },
            {
                "specificity_level": 4,
                "score": 0.85,
                "reason": "Nearly identical in meaning; the fallback answer specifically addresses folk dance, aligning well with the original answer's focus on traditional dance and cultural practices, though it does not explicitly mention the scattered shoes."
            }
        ]
    },
    "National Dress(culture, relation, Non-English European, English)": {
        "confidence": "Confidence: 0.94",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little similarity; the fallback answer denies any relation between kilts and dirndls, while the original answer emphasizes their cultural connection."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer vaguely suggests a cultural connection, but lacks the specificity and reasoning of the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies kilts and dirndls as traditional clothing, aligning with the original answer's focus on cultural attire."
            },
            {
                "specificity_level": 3,
                "score": 0.9,
                "reason": "Nearly identical; the fallback answer accurately describes kilts and dirndls as cultural attire representing specific cultures, closely matching the original answer's semantic meaning and reasoning."
            },
            {
                "specificity_level": 4,
                "score": 0.85,
                "reason": "Very similar; the fallback answer correctly identifies kilts and dirndls as national dress, but slightly diverges by emphasizing cultural identity rather than the broader cultural diversity highlighted in the original answer."
            }
        ]
    },
    "Cultural Etiquette(culture, relation, Non-English European, English)": {
        "confidence": "Confidence: 0.25",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity. The fallback answer discusses bows and handshakes in the context of meetings and respect, which is unrelated to the original answer's focus on handshakes and ribbons as symbols of formal agreements and festive occasions."
            },
            {
                "specificity_level": 1,
                "score": 0.2,
                "reason": "Limited similarity. The fallback answer vaguely mentions handshakes and bows in relation to culture, but it does not address the specific contrast between formal and festive symbols as in the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.3,
                "reason": "Moderately similar. The fallback answer acknowledges handshakes and bows as cultural practices, but it does not capture the contrast between the formal and light-hearted connotations of handshakes and ribbons."
            },
            {
                "specificity_level": 3,
                "score": 0.4,
                "reason": "Moderately similar. The fallback answer discusses handshakes and bows as greeting customs in different cultures, which is somewhat related but does not address the specific contrast in the original answer."
            },
            {
                "specificity_level": 4,
                "score": 0.5,
                "reason": "Moderately similar. The fallback answer focuses on cultural etiquette and greeting customs, which aligns somewhat with the original answer's theme of cultural symbols but misses the specific contrast between formal and festive connotations."
            }
        ]
    },
    "Taboo Subjects(culture, relation, Non-English European, English)": {
        "confidence": "Confidence: 0.75",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly associates the images with unrelated concepts (comics and superstitions) and fails to address the theme of obscured or fragmented reality."
            },
            {
                "specificity_level": 1,
                "score": 0.2,
                "reason": "Limited similarity; the fallback answer vaguely mentions a cultural association but does not capture the original answer's focus on obscured reality and fragmented perception."
            },
            {
                "specificity_level": 2,
                "score": 0.3,
                "reason": "Moderate similarity; the fallback answer identifies the images as cultural symbols but does not delve into the specific theme of obscured or fragmented reality."
            },
            {
                "specificity_level": 3,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer associates the images with cultural taboos but does not fully align with the original answer's emphasis on the challenges of understanding truth when information is censored and perception is fractured."
            },
            {
                "specificity_level": 4,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer touches on taboo subjects and cultural sensitivities but does not fully capture the original answer's nuanced exploration of obscured reality and fragmented perception."
            }
        ]
    },
    "Body Language(culture, relation, NA, English)": {
        "confidence": "Confidence: 0.40",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity. The fallback answer interprets crossed arms and thumbs-up in a completely unrelated context (warmth and hitchhiking), which does not align with the original answer's focus on positive feedback or approval."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity. The fallback answer vaguely suggests that these might be gestures, but it lacks the specific connection to positive feedback or approval that the original answer provides."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity. The fallback answer correctly identifies crossed arms and thumbs-up as physical gestures, but it does not explore their specific meanings or the connection to positive feedback or approval."
            },
            {
                "specificity_level": 3,
                "score": 0.6,
                "reason": "Moderately similar. The fallback answer recognizes crossed arms and thumbs-up as nonverbal communication, which aligns with the original answer's theme. However, it does not explicitly link them to positive feedback or approval."
            },
            {
                "specificity_level": 4,
                "score": 0.85,
                "reason": "Very similar. The fallback answer accurately identifies crossed arms and thumbs-up as body language and connects them to defensiveness and approval, respectively. This aligns closely with the original answer's reasoning, though it does not explicitly mention the theme of accomplishment or satisfaction."
            }
        ]
    },
    "Oktoberfest(culture, mutual elements, Non-English European, English)": {
        "confidence": "Confidence: 0.43",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly identifies the objects as unrelated and focuses on beer steins and dirndl dresses, which are not mentioned in the original answer."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer vaguely suggests a possible festival connection but does not align with the specific traditional elements highlighted in the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer correctly identifies festival items but does not capture the traditional and cultural significance emphasized in the original answer."
            },
            {
                "specificity_level": 3,
                "score": 0.6,
                "reason": "Moderately similar; the fallback answer correctly identifies cultural elements but does not fully align with the specific traditional craftsmanship and attire discussed in the original answer."
            },
            {
                "specificity_level": 4,
                "score": 0.8,
                "reason": "Very similar; the fallback answer correctly identifies Oktoberfest and its traditional elements, closely aligning with the original answer’s focus on tradition and cultural heritage."
            }
        ]
    },
    "Hollywood  Walk of Fame star(culture, relation, NA, English)": {
        "confidence": "Confidence: 1.00",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.2,
                "reason": "Little similarity; the fallback answer incorrectly labels the relation as 'Unrelated Landmarks' and does not connect the Hollywood Sign and Walk of Fame Star to the entertainment industry."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer vaguely suggests a possible connection to entertainment or culture but lacks the specificity and reasoning of the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies both as cultural symbols, aligning with the original answer's focus on their symbolic nature, but misses the specific connection to celebrity recognition."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Nearly identical; the fallback answer accurately describes the relation as 'Celebrity Recognition' and aligns closely with the original answer's explanation and reasoning about the Hollywood Sign and Walk of Fame Star."
            },
            {
                "specificity_level": 4,
                "score": 0.9,
                "reason": "Nearly identical; the fallback answer closely matches the original answer's semantic meaning and reasoning, emphasizing the Hollywood Sign and Walk of Fame Star as symbols of the entertainment industry and celebrity recognition."
            }
        ]
    },
    "Fourth of July  Fireworks(culture, relation, USAEnglish, English)": {
        "confidence": "Confidence: 0.94",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly categorizes the relation as 'Unrelated Objects' and does not align with the original answer's focus on celebration and national pride."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer suggests a possible connection to traditions but lacks the specificity and depth of the original answer's explanation about celebration and national pride."
            },
            {
                "specificity_level": 2,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies the American flag and fireworks as part of cultural traditions in the United States, aligning well with the original answer's focus on celebration and national pride."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Nearly identical; the fallback answer accurately describes the American flag and fireworks as national symbols associated with the United States and its Independence Day, closely matching the original answer's semantic meaning and reasoning."
            },
            {
                "specificity_level": 4,
                "score": 0.9,
                "reason": "Nearly identical; the fallback answer precisely explains that the American flag symbolizes the United States and fireworks are a traditional part of Fourth of July celebrations, closely aligning with the original answer's focus on celebration and national pride."
            }
        ]
    },
    "TLDR  A very long article(culture, relation, NA, English)": {
        "confidence": "Confidence: 1.00",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little to no similarity; the fallback answer incorrectly interprets TLDR as 'The Longest Day Run,' which is unrelated to the original answer's focus on information dissemination and summarization."
            },
            {
                "specificity_level": 1,
                "score": 0.5,
                "reason": "Moderately similar; the fallback answer correctly identifies TLDR as a possible summary but lacks the depth and specific context of the original answer's explanation and reasoning."
            },
            {
                "specificity_level": 2,
                "score": 0.7,
                "reason": "Very similar; the fallback answer correctly identifies TLDR as a method for text shortening, aligning with the original answer's focus on summarizing complex information into a digestible format."
            },
            {
                "specificity_level": 3,
                "score": 0.85,
                "reason": "Nearly identical; the fallback answer accurately explains TLDR as an abbreviation for 'Too Long; Didn't Read' and its use in summarizing long texts, closely matching the original answer's semantic meaning and reasoning."
            },
            {
                "specificity_level": 4,
                "score": 0.9,
                "reason": "Nearly identical; the fallback answer precisely captures the essence of TLDR as a summary tool for long articles, aligning perfectly with the original answer's focus on information dissemination and concise communication."
            }
        ]
    },
    "Baseball  Hotdog(culture, relation, USAEnglish, English)": {
        "confidence": "Confidence: 0.50",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.2,
                "reason": "Little similarity; the fallback answer claims no relation between the items, while the original answer highlights their contrasting roles in sports and food."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer suggests a vague connection to baseball, but the original answer focuses on the contrast between sports equipment and food."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer links both items to baseball, but the original answer emphasizes their distinct roles in sports and food."
            },
            {
                "specificity_level": 3,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer connects the items to baseball games, but the original answer focuses on their broader contrasting roles."
            },
            {
                "specificity_level": 4,
                "score": 0.6,
                "reason": "Moderate similarity; the fallback answer ties both items to baseball games, but the original answer emphasizes their distinct roles in sports and food, not just their association with baseball."
            }
        ]
    },
    "Mona Lisa  Sfumato technique description(art, relation, NA, English)": {
        "confidence": "Confidence: 0.57",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "The fallback answer incorrectly states that Sfumato is unrelated to the Mona Lisa, which contradicts the original answer's focus on the Sfumato technique in the Mona Lisa."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "The fallback answer correctly identifies Sfumato as a technique used in the Mona Lisa but lacks detail about the effect, which is a key part of the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.5,
                "reason": "The fallback answer correctly identifies Sfumato as a technique in the Mona Lisa and mentions the blurred effect, aligning partially with the original answer's focus on the smoky, soft effect."
            },
            {
                "specificity_level": 3,
                "score": 0.7,
                "reason": "The fallback answer correctly identifies Sfumato as a technique in the Mona Lisa and describes the smoky, soft effect, closely aligning with the original answer's description."
            },
            {
                "specificity_level": 4,
                "score": 0.8,
                "reason": "The fallback answer accurately describes the Sfumato technique in the Mona Lisa and its smoky, blurred effect, closely matching the original answer's explanation and reasoning."
            }
        ]
    },
    "A melting clock  A dream sequence in a film(culture, relation, NA, English)": {
        "confidence": "Confidence: 0.60",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.1,
                "reason": "Little similarity; the fallback answer incorrectly states that melting clocks and dream sequences are unrelated, which contradicts the original answer's focus on surrealism and defying conventional reality."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer suggests a possible connection between melting clocks and dreams, but it lacks the depth and focus on surrealism and architecture present in the original answer."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer acknowledges a relationship between melting clocks and dreams but misses the original answer's emphasis on surrealism and architectural elements."
            },
            {
                "specificity_level": 3,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer correctly links melting clocks to dreams and dream sequences to films but does not address the surreal and architectural aspects highlighted in the original answer."
            },
            {
                "specificity_level": 4,
                "score": 0.6,
                "reason": "Significant similarity; the fallback answer accurately describes melting clocks as surrealist symbols linked to dreams and dream sequences in films, aligning partially with the original answer's focus on surrealism, though it still omits the architectural elements."
            }
        ]
    },
    "A Picasso portrait  Geometric shapes(art, relation, NA, English)": {
        "confidence": "Confidence: 0.60",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.2,
                "reason": "Little similarity; the fallback answer incorrectly states no relation between Picasso's portraits and geometric shapes, which contradicts the original answer's focus on abstract art and geometric illustration."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer suggests a possible connection to Cubism but does not align with the original answer's detailed comparison of abstract art and geometric illustration."
            },
            {
                "specificity_level": 2,
                "score": 0.35,
                "reason": "Moderate similarity; the fallback answer links both Picasso's portraits and geometric shapes to Cubism, but it lacks the detailed explanation and reasoning provided in the original answer."
            },
            {
                "specificity_level": 3,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer correctly associates geometric shapes with Cubism but does not fully capture the original answer's nuanced comparison of abstract art and geometric illustration."
            },
            {
                "specificity_level": 4,
                "score": 0.45,
                "reason": "Moderate similarity; the fallback answer accurately describes the incorporation of geometric shapes in Picasso's Cubist style but still misses the broader context of comparing abstract art and geometric illustration as in the original answer."
            }
        ]
    },
    "Ink brush  A character in kanji or hanja(art, relation, East Asia, English)": {
        "confidence": "Confidence: 0.50",
        "reasons": [
            {
                "specificity_level": 0,
                "score": 0.2,
                "reason": "Little similarity; the fallback answer incorrectly states no connection between ink brushes and kanji/hanja, contrary to the original answer's focus on writing systems."
            },
            {
                "specificity_level": 1,
                "score": 0.3,
                "reason": "Limited similarity; the fallback answer vaguely suggests a possible connection to calligraphy, which does not align with the original answer's focus on writing systems and tools."
            },
            {
                "specificity_level": 2,
                "score": 0.4,
                "reason": "Moderate similarity; the fallback answer associates both ink brushes and kanji/hanja with calligraphy, which partially aligns with the original answer's theme of writing and communication."
            },
            {
                "specificity_level": 3,
                "score": 0.6,
                "reason": "Moderate similarity; the fallback answer correctly links ink brushes to calligraphy and kanji/hanja as characters written with them, aligning somewhat with the original answer's focus on tools and writing systems."
            },
            {
                "specificity_level": 4,
                "score": 0.5,
                "reason": "Moderate similarity; the fallback answer is more specific about ink brushes and kanji/hanja in calligraphy, but it diverges from the original answer's broader emphasis on writing systems and tools."
            }
        ]
    }
}